[
    {
        "nr": 1,
        "q": " Krzywą, która przedstawia zbiór wszystkich kombinacji nakładów dwóch czynników produkcji, których koszt całkowity jest taki sam, nazywamy",
        "a": " [13]\nIzokosztą.\n(możliwe też że: Krzywą możliwości produkcyjnych lub Krzywa jednakowego kosztu).\n"
    },
    {
        "nr": 2,
        "q": " Rynek sprzedawcy oznacza, że",
        "a": " [2]\nProducenci, ze względu na nadwyżkę popytu nad podażą (na określone dobro) zajmują silniejszą pozycję w stosunku do nabywców.\n"
    },
    {
        "nr": 3,
        "q": " Rynek nabywcy oznacza, że",
        "a": " [1]\n\tPodaż przewyższa popyt. Klient ma większy wybór.\n"
    },
    {
        "nr": 4,
        "q": " Produktywność krańcowa definiowana jest jako",
        "a": " [3]\nPrzyrost wielkości produkcji w konsekwencji wzrostu nakładu kapitału (lub ogólnie czynnika  produkcji, np. pracy) o jednostkę, przy założeniu że nakłady wszystkich innych czynników pozostają stałe.\n\n"
    },
    {
        "nr": 5,
        "q": " Produktywność przeciętna definiowana jest jako",
        "a": " \n\tIlość produktu całkowitego przypadająca na jednostkę czynnika wytwórczego.\n\n"
    },
    {
        "nr": 6,
        "q": " Miernikiem całkowitych dochodów osiąganych przez obywateli danego kraju, niezależnie od miejsca (kraju) świadczenia usług przez czynniki produkcji jest",
        "a": " [4]\nPNB\n\nPNB per capita\nPKB\nPNN\n\n"
    },
    {
        "nr": 7,
        "q": " Do obliczenia PKB można stosować metodę",
        "a": " [5][6]\nWydatkową (jako wydatki na dobra i usługi finalne różnych podmiotów gospodarczych jak: gospodarstwa domowe, przedsiębiorstwa, państwo i cudzoziemcy, w tym wypadku: PKB = C + I + G + X, gdzie PKB to produkt krajowy brutto, C - konsumpcja, I - inwestycje, G - wydatki rządowe, X - eksport netto)\nDochodową (jako suma płac i  uzyskanych przez różne grupy wytwarzające PKB, tj.: PKB = dochody z pracy + dochody z kapitału + dochody państwa + amortyzacja.)\nProdukcyjną (jako wielkość produkcji w różnych gałęziach gospodarki np. rolnictwie, przemyśle, transporcie itd, tj: PKB = produkcja globalna kraju – zużycie pośrednie = suma wartości dodanej ze wszystkich gałęzi gospodarki krajowej..)\n\n\n"
    },
    {
        "nr": 8,
        "q": " Popyt efektywny można zdefiniować jako",
        "a": " [7]\nChęć i możność nabycia określonych dóbr po określonej cenie\nChęć i możliwość nabycia dóbr zaspokajających podstawowe potrzeby po najniższej cenie\nChęć i możliwość nabycia dóbr przy najniższej cenie rynkowej\nChęć i możliwość nabycia dóbr luksusowych i normalnych\n\n\tChęć dokonania zakupów przez osoby, które dysponują środkami płatniczymi. Wyklucza się dodatkowe dobra, w posiadanie których mogliby wejść bezrobotni, gdyby podjęli pracę, lub potencjalni przedsiębiorcy, gdyby mogli uzyskać środki finansowe na otwieranie własnej działalność (popyt efektywny jest zatem wydatkiem ex ante i nie istnieje wówczas równowaga rynkowa).\n\n\n"
    },
    {
        "nr": 9,
        "q": " Cykle koniunkturalne powtarzające się co 8-10 lat nazywamy cyklami",
        "a": " [8]\n\tJuglara (cykl średni). Przykładowo wahania bezrobocia, PKB, inflacji.\n"
    },
    {
        "nr": 10,
        "q": " W badaniach ekonomicznych bezrobotny jest zdefiniowany jako",
        "a": " [9]\nniepracujący w okresie badanego tygodnia\naktywnie poszukujący pracy\ngotowy do podjęcia pracy w badanym lub następnym tygodniu\n(i jest w wieku 15-74 lat)\n"
    },
    {
        "nr": 11,
        "q": " Koszty stałe na wykresie zależności kosztów od wielkości produkcji przedstawia",
        "a": "\n\tPółprosta równoległa do osi X o charakterze funkcji stałej rozpoczynająca się w punkcie wyznaczającym wartość kosztów całkowitych dla wielkości produkcji równej 0 (koszty stałe to fixed costs, czyli TFC).\n(Ilustracja 1)\n\n"
    },
    {
        "nr": 12,
        "q": " Koszty zmienne na wykresie zależności kosztów od wielkości produkcji przedstawia",
        "a": "\n\tKrzywa o charakterze funkcji rosnącej rozpoczynająca się w punkcie (0,0) (koszty zmienne to variable costs, czyli TVC).\n\t(1)\n"
    },
    {
        "nr": 13,
        "q": " Punkt, w którym koszty całkowite zrównują się z przychodami ze sprzedaży nazywa się",
        "a": " [601]\n\tProgiem rentowności (Break even point) bądź punktem wyrównania.\n"
    },
    {
        "nr": 14,
        "q": " PNB w ujęciu realnym mierzy się w cenach",
        "a": " [4]\n\tstałych. Jest on skorygowany o skutki inflacji względem roku bazowego.\n"
    },
    {
        "nr": 15,
        "q": " Do PKB nie wliczamy",
        "a": " [6]\ndóbr i usług pośrednich\nnakładów (czynników)\ndóbr używanych\naktyw finansowych (np. akcje i obligacje)\ndóbr i usług wytworzonych za granicą\n"
    },
    {
        "nr": 16,
        "q": " Zależność między wpływami do budżetu z tytułu podatków a wysokością stopy podatkowej ilustruje",
        "a": " [10] \n\tKrzywa Laffera.\n \n\t(2)\n"
    },
    {
        "nr": 17,
        "q": " Obniżka rynkowej stopy procentowej powoduje",
        "a": " [604]\nobniżenie oprocentowania depozytów na rachunkach bankowych, czyli przykładowo odsetki od lokat zmniejszają się, a po drugie zmniejszy się także koszt kredytu, kredyty konsumenckie będą udzielane z mniejszym oprocentowaniem.\n\n"
    },
    {
        "nr": 18,
        "q": " Co jest miernikiem ogólnej inflacji w gospodarce? [602]\n\tObliczaniem zmian ogólnego poziomu cen zajmują się specjalne instytucje. W tym celu konstruuje się wskaźnik cen (pełna nazwa",
        "a": " wskaźnik cen towarów i usług konsumpcyjnych, CPI-consumer price index), będący miarą procentowych zmian wydatków związanych z zakupem pewnego ustalonego zestawu dóbr (tzw. koszyka) w jakimś okresie. \n\n"
    },
    {
        "nr": 19,
        "q": " Inflacja kosztowa może pochodzić od",
        "a": " [11]\nInflacja kosztowa (inaczej inflacja wywołana szokiem podażowym) to inflacja wynikająca z podażowej strony rynku i mająca swoje źródło w gwałtownym wzroście kosztów produkcji. W globalnym układzie popytu i podaży przedstawiana jest przez przesunięcie w górę krzywej AS.\n\nPojawia się wówczas, gdy nałożone są ograniczenia na  lub gdy  jakiegoś zasobu zostaje zwiększona. Przyczyny inflacji kosztowej (podażowej):\nwzrost cen surowców,\nwzrost płac,\nwzrost cen  importowanych,\nwzrost cen surowców i półproduktów importowanych,\nwzrost cen surowców i półproduktów pochodzenia krajowego,\nwzrost narzutów na płace (np. składek na ),\nwzrost innych składników kosztowych (np. wzrost  płaconych odsetek od , wzrost kosztów ),\n\n"
    },
    {
        "nr": 20,
        "q": " Inflacja popytowa może pochodzić od",
        "a": " [11]\nInflacja popytowa to inflacja wywołana nadmiernym popytem na rozmaite dobra, spowodowana na przykład dużym wzrostem ogólnego popytu. \"Inflacyjna presja popytu na rynku towarów konsumpcyjnych pochodzi także ze zmniejszenia oszczędności ludności i zwiększenia pożyczek”. Inflacja popytowa może być stymulowana przez wzrost  lub wydatków rządowych.   popytowa - występuje wtedy gdy , czyli całkowita wielkość planowanych wydatków wzrasta szybciej niż całkowita wielkość produkcji. Keyes stwierdził jednoznacznie iż ten typ inflacji ma miejsce wtedy gdy łączny  w gospodarce przewyższa możliwości jego zaspokojenia (możliwości wytwórcze), czyli ludzie chcą kupić więcej niż wytwarza gospodarka, co powoduje konkurencję między społeczeństwem o ograniczone zasoby.\nMoże pochodzić od: gospodarstwa domowe, które są głównymi nabywcami; związki zawodowe, które spekulują wzrostem płac; - zaciąganie kredytów - banki udzielają kredytu mniej lub bardziej zależnie od potrzeb upłynnienia pieniądza; - państwo jako dysponent budżetu (jest nabywcą wielu dóbr i usług), jeżeli wydatki państwa są wyższe od jego możliwości (dochodu) to również zwiększy się popyt a przy tym wzrośnie inflacja; - inwestorzy przedsiębiorstw -. Inwestorzy kupują dobra kapitałowe (maszyny, budynki itp.) w efekcie rosną ceny materiałów itd. - wzrasta cena produkcji, co powoduje wzrost cen w efekcie końcowym.; W momencie kiedy dany rynek nie jest w stanie produkować danego towaru - wzrost takiego eksportu może spowodować wzrost cen na rynku.  \n\n"
    },
    {
        "nr": 21,
        "q": " Prawo, które mówi, że zadowolenie z pierwszej konsumowanej jednostki dobra jest znacznie większe niż z kolejnej, drugiej jednostki itd., nazywamy",
        "a": " [14]\nprawem malejącej użyteczności krańcowej/ prawem nasycalności potrzeb/ pierwszym prawem Gossena\n"
    },
    {
        "nr": 22,
        "q": " Prawo, które mówi, że maksymalne zadowolenie z konsumpcji dwóch dóbr (maksymalną użyteczność) konsument osiąga wówczas, gdy stosunek użyteczności marginalnych tych dóbr zrównuje się z relacją ich cen, nazywamy",
        "a": " [15]\nII Prawo Gossena lub inna nazwa- prawo wyrównywania użyteczności krańcowych\n“Maksymalne zadowolenie (maksymalną użyteczność) z konsumpcji dobra A i B konsument osiąga wówczas, kiedy stosunek użyteczności krańcowych tych dóbr zrówna się z relacją ich cen. A więc użyteczności krańcowe (Uk) tych dóbr są proporcjonalne do ich cen (P) (Dach, 2007, s. 98).\nZjawisko to nazywane jest  lub znane jest także pod nazwą prawa wyrównywania użyteczności krańcowych.\n\n\n\n\n\n\n\n"
    },
    {
        "nr": 23,
        "q": " Dobra, na które wielkość popytu rośnie wraz ze wzrostem ceny, nazywamy",
        "a": "  [20]\nDobra Griffena\nDobrami zwyczajnymi\nDobrami Veblena\nDobrami normalnymi\nDobra luksusowe (dobra Veblena) lub dobra podstawowe (Giffena; np. żywność)\n\nWystępują 3 wyjątki, gdzie wzrost ceny i tak powoduje wzrost popytu:\nparadoks Giffena - odnosi się do dóbr podstawowych. \"Im chleb jest droższy, tym więcej się go spożywa\" - gdy ceny wszystkich artykułów żywnościowych rosną, chleb staje się ich   substytutem. Wraz ze wzrostem ceny dobra, wzrasta jego popyt. (Wielkość zapotrzebowania może rosnąć przy wzroście ceny, ponieważ dochody konsumentów tego dobra są bardzo niskie a jego cena - choć wyższa niż wcześniej - wciąż jest niższa od substytutów lub takich bliskich substytutów nie ma.)\n  snoba) - dotyczy dóbr luksusowych. Zamożne grupy społeczeństwa chcąc pokazać swój status materialny, nabywają te dobra, których ceny wzrastają (np. samochód).\nparadoks spekulacyjny - jest związany z prognozowaniem kształtowania się cen w przyszłości. Jeśli cena danego dobra w przyszłości będzie rosła, wielkość popytu również będzie rosnąca.\n\n"
    },
    {
        "nr": 24,
        "q": " Dobro komplementarne można zdefiniować jako",
        "a": " [12]\nDobra komplementarne to dwa produkty, które w oczach konsumentów są ze sobą nierozerwalnie związane (wzajemnie się uzupełniają, przez co najczęściej są konsumowane razem, np. monitor i komputer, benzyna i samochód). Wzrost ceny jednego z nich powoduje spadek popytu na drugie.\nInaczej: W przypadku, gdy wzrost ceny pierwszego dobra (A) przy niezmienionej cenie drugiego dobra (B) spowoduje spadek ilości zarówno pierwszego jak i drugiego dobra nabytego przez konsumentów możemy powiedzieć, że są to dobra komplementarne.\n\n"
    },
    {
        "nr": 25,
        "q": " Dobro substytucyjne można zdefiniować jako",
        "a": " [12]\nDobra substytucyjne to dobra, które ze sobą konkurują (przez wzgląd na podobne cechy i funkcjonalność mogą być stosowane zamiennie). Wzrost ceny jednego z nich zwiększa popyt na drugie.\n\n"
    },
    {
        "nr": 26,
        "q": "Dobra, na które wielkość popytu maleje wraz ze wzrostem ich ceny nazywam",
        "a": "\nDobra zwykłe (normalne)\n\n"
    },
    {
        "nr": 27,
        "q": " Korzyści skali pojawiają się wtedy, gdy wraz ze wzrostem produkcji",
        "a": " [16]\nDługookresowe koszty przeciętne spadają.(koszt jednostkowy produkcji obniża się)\n \n"
    },
    {
        "nr": 28,
        "q": " Stopa bezrobocia jest obliczana jako stosunek liczby osób bezrobotnych do",
        "a": " [17]\nLiczby ludności aktywnej zawodowo (zasobu siły roboczej danej populacji lub liczby ludności w wieku produkcyjnym). \n\n"
    },
    {
        "nr": 29,
        "q": " Zależność między stopą bezrobocia a stopą inflacji ilustruje",
        "a": " [18]\nKrzywa Phillipsa.\n\n\n"
    },
    {
        "nr": 30,
        "q": " Stwierdzenie o tym, że dla każdego procentu wzrostu rzeczywistej stopy bezrobocia powyżej naturalnej stopy bezrobocia luka PKB powiększa się o około 3%, nazywamy",
        "a": " [19]\nPrawem Okuna.\n\n"
    },
    {
        "nr": 31,
        "q": " Jakie są podstawowe przesłanki wydania przez Urząd Patentowy decyzji o udzieleniu patentu na wynalazek i prawa ochronnego na wzór użytkowy",
        "a": " [100] [101]\nPatent (warunki):\nnowe\nposiada poziom wynalazczy\nnadaje się do przemysłowego stosowania\nInaczej ujmując, patentu udziela się na wynalazki o charakterze technicznym spełniające ustawowe warunki do uzyskania patentu (posiadające zdolność patentową)\n\nwzór użytkowy (warunki):\nnowe\nużyteczne rozwiązanie o charakterze technicznym (kształt, budowa, zestawienie przedmiotów o trwałej postaci)\nInaczej ujmując, prawa ochronne udziela się na wzory użytkowe spełniające ustawowe warunki do uzyskania prawa ochronnego (posiadające zdolność ochronną).\n\nW obu przypadkach decyzja o udzieleniu patentu lub prawa ochronnego jest decyzją warunkową. Udzielenie prawa  następuje pod warunkiem uiszczenia opłaty za pierwszy okres ochrony obejmujący pierwsze trzy lata ochrony. W razie nieuiszczenia opłaty w wyznaczonym terminie, Urząd Patentowy stwierdza wygaśnięcie decyzji o udzieleniu patentu.\n\nPatent na wynalazek/prawo ochronne na wzór użytkowy jest prawem, którego udziela Urząd Patentowy w drodze decyzji warunkowej (pod warunkiem udzielania opłaty za pierwszy okres ochrony, czyli pierwsze 3 lata) na rzecz podmiotu uprawnionego do uzyskania patentu/prawa ochronnego po stwierdzeniu w procedurze pełnego badania, że zostały spełnione warunki wymagane do jego uzyskania. \nDla oceny zdolności patentowej rozpatrywanego przedmiotu zgłoszenia niezbędne jest aby:\n- zgłoszenie ujawniało wynalazek w sposób dostatecznie jasny i wyczerpujący;\n- zastrzeżenia patentowe były  w całości poparte opisem wynalazku i określały w sposób zwięzły i jednoznaczny, przez podanie cech technicznych rozwiązania, zastrzegany wynalazek oraz zakres żądanej ochrony.\nZgodnie z art. 24 P.w.p. „patenty są udzielane – bez względu na dziedzinę techniki – na wynalazki, które są nowe, posiadają poziom wynalazczy i nadają się do przemysłowego stosowania”. \nWynalazek uważa się za nowy, jeśli nie jest on częścią stanu techniki (art. 25 ust. 1 P.w.p.).\nZdolność ochronną posiadają te wzory użytkowe, które są nowymi i użytecznymi rozwiązaniami o charakterze technicznym, dotyczącymi kształtu, budowy lub zestawienia przedmiotu o trwałej postaci (art. 94 ust. 1 P.w.p.)\n\n"
    },
    {
        "nr": 32,
        "q": "W jaki sposób oznacza się pierwszeństwo do uzyskania patentu",
        "a": " [21]\nWedług daty zgłoszenia.\n\nPierwszeństwo do uzyskania prawa ochronnego na znak towarowy, oznacza się według daty zgłoszenia znaku towarowego w Urzędzie Patentowym RP (art. 123 ustawy pwp). Jednakże, na zasadach określonych w umowach międzynarodowych, możliwe jest zastrzeżenie pierwszeństwa z wcześniejszego zgłoszenia, złożonego w innym niż polski, urzędzie ds. własności przemysłowej, pod warunkiem, iż w ciągu 6 miesięcy od daty tego pierwszego prawidłowego zgłoszenia, kolejne zgłoszenie zostanie złożone w Urzędzie Patentowym RP. W takim przypadku polskie zgłoszenie będzie korzystało z daty pierwszego zgłoszenia, jako daty pierwszeństwa (art. 124 ustawy pwp).\n\n"
    },
    {
        "nr": 33,
        "q": " Jaki charakter ma prawo pierwszeństwa do uzyskania patentu",
        "a": " [106]\nZbywalny, dziedziczny , międzynarodowy?\n\n"
    },
    {
        "nr": 34,
        "q": " Jakie zachowanie stanowi nieuczciwą konkurencję",
        "a": " [603]\nUstawa uznaje za czyn nieuczciwej konkurencji działanie sprzeczne z prawem lub dobrymi obyczajami, jeżeli takie zachowanie miałoby zagrażać lub naruszać interes innego przedsiębiorcy lub klienta.\nAby natomiast dany czyn uznać za nieuczciwy, wskazane powyżej przesłanki powinny zostać spełnione kumulatywnie (tj. łącznie). A więc by dane zachowanie uznać za czyn nieuczciwej konkurencji:\ndziałanie to musi zostać podjęte w związku z działalnością gospodarczą i \nmusi ono być sprzeczne z prawem lub dobrymi obyczajami i \nmusi ono zagrażać lub naruszać interes innego przedsiębiorcy lub klienta.  \n\nCzynami nieuczciwej konkurencji są na przykład:\nwprowadzające w błąd oznaczenie ,\nfałszywe lub oszukańcze oznaczenie pochodzenia geograficznego, bądź wprowadzające w błąd oznaczenie,  albo ,\nnaśladownictwo , jeżeli może wprowadzić  w błąd co do tożsamości  lub produktu,\nnaruszenie tajemnicy przedsiębiorstwa,\nnakłanianie do rozwiązania lub niewykonania umowy,\npomawianie lub nieuczciwe zachwalanie,\nutrudnianie dostępu do , na przykład poprzez stosowanie cen \nprzekupstwo osoby pełniącej funkcję publiczną,\n lub  ,\norganizowanie systemu  oraz prowadzenie lub organizowanie działalności w systemie .\n\n\n"
    },
    {
        "nr": 35,
        "q": "  Jakie uprawnienia uzyskiwane są poprzez udzielenie patentu przez Urząd Patentowy RP",
        "a": " [104]\nPatent na wynalazek to prawo wyłącznego korzystania (monopolu) z wynalazku w sposób zarobkowy lub zawodowy na całym obszarze Rzeczypospolitej Polskiej (art. 63 P.w.p.) \nKorzystanie z wynalazku objętego patentem obejmuje wszelkie postacie stosowania wynalazku, czerpania korzyści z wynalazku oraz dysponowania nim. \nKorzystanie z wynalazku przez inne osoby możliwe jest jedynie za zgodą uprawnionego (Uprawniony z patentu może w drodze umowy udzielić innej osobie upoważnienia (licencji) do korzystania z jego wynalazku (umowa licencyjna)).\nUprawniony z patentu może zakazać osobom trzecim, nie mającym jego zgody, korzystania z wynalazku w sposób zarobkowy lub zawodowy.\n\nPosiada też prawo pierwszeństwa zgłoszenia w innych urzędach patentowych.\n \n"
    },
    {
        "nr": 36,
        "q": " W kraju, w którym działa przedsiębiorstwo XYZ, zmieniono przepisy regulujące ochronę danych osobowych. Zmiana ta dotyczy",
        "a": " \n\tśrodowiska zewnętrznego, otoczenia ogólnego, wymiar polityczno-prawny\n\n"
    },
    {
        "nr": 37,
        "q": " W kraju, w którym działa przedsiębiorstwo XYZ, istotnie zmieniła się stopa bezrobocia. Zmiana ta dotyczy",
        "a": " \n\tśrodowiska zewnętrznego, otoczenia ogólnego, wymiar ekonomiczny\n\n"
    },
    {
        "nr": 38,
        "q": " Dwaj  główni  konkurenci  przedsiębiorstwa  ABC  właśnie  ogłosili  współpracę  strategiczną. Zmiana ta dotyczy",
        "a": " \n\tśrodowiska zewnętrznego, otoczenia celowego (mikrootoczenie), konkurenci\n\n"
    },
    {
        "nr": 39,
        "q": " Główny dostawca przedsiębiorstwa ABC właśnie ogłosił upadłość. Zmiana ta dotyczy",
        "a": "\n\tśrodowiska zewnętrznego, otoczenia celowego, dostawcy\n\n"
    },
    {
        "nr": 40,
        "q": " W kraju, w którym działa przedsiębiorstwo XYZ zmienia się struktura  wiekowa  obywateli (następuje starzenie społeczeństwa). Zmiana ta dotyczy",
        "a": "\n\tśrodowiska zewnętrzne, otoczenia ogólnego, wymiar społeczno-kulturowy  \n\n"
    },
    {
        "nr": 41,
        "q": " W metodzie SWOT szanse oznaczają",
        "a": "\nuwarunkowania, które przy umiejętnym wykorzystaniu mogą wpływać pozytywnie na rozwój firmy\n\n"
    },
    {
        "nr": 42,
        "q": " W przedsiębiorstwie XYZ dotychczas handlowcy prowadzili rozmowy z klientami, posługując się własną wiedzą, umiejętnościami i doświadczeniem. Obecnie wprowadzono zasadę, iż handlowcy powinni posługiwać się ujednoliconymi scenariuszami rozmowy przygotowanymi przez kierownictwo. Której z cech struktury organizacyjnej dotyczy ta zmiana",
        "a": " [22]\nstandaryzacja\n\n(wymiar standaryzacji dotyczy ujednoliconych sposobów postępowania, typowości ról i procedur organizacyjnych)\n\n"
    },
    {
        "nr": 43,
        "q": " W przedsiębiorstwie ABC dotychczas handlowcy mogli ustalać warunki umów z klientami jedynie wtedy, gdy wcześniej zostały one zaakceptowane przez dyrektora handlowego. Obecnie wprowadzono zasadę, że handlowcy mogą samodzielnie ustalać warunki sprzedaży oferowane klientom. Której z cech struktury organizacyjnej dotyczy ta zmiana",
        "a": " [22]\ndecentralizacja\n(wczesniej byla formalizacja, ale chyba nie)\n"
    },
    {
        "nr": 44,
        "q": " W przedsiębiorstwie ABC dotychczas wszyscy pracownicy podlegali bezpośrednio dyrektorowi naczelnemu. Obecnie powołano dwóch zastępców dyrektora, którzy podlegają dyrektorowi, a którym z kolei podlegają pracownicy wykonawczy. Której z cech struktury organizacyjnej dotyczy ta zmiana",
        "a": " [22]\nKonfiguracja / DELEGOWANIE\n\n(wymiar konfiguracji określa kształt struktury organizacyjnej (wyrażający sposób rozczłonkowania organizacji))\n\n"
    },
    {
        "nr": 45,
        "q": " Które dwie cechy struktury organizacyjnej są połączone ze sobą w ten sposób, że zwiększenie jednej zmniejsza drugą",
        "a": "  [23]\ncentralizacja i decentralizacja\n\n"
    },
    {
        "nr": 46,
        "q": " Cechą charakterystyczną stanowiska sztabowego w organizacji jest to, iż",
        "a": " [24]\nma za zadanie służyć doświadczeniem, radą i wsparciem stanowiskom liniowym.\n\n"
    },
    {
        "nr": 47,
        "q": " Zgodnie z definicją struktury mechanistycznej jest ona",
        "a": " [25]\nStruktury mechanistyczne są rozwiązaniami „sztywnymi”, które charakteryzują się wysokim stopniem formalizacji i centralizacji władzy oraz „silną” hierarchią (czyli jest hierarchiczną strukturą organizacyjną; mało elastyczne). Tego typu struktury mogą być efektywne w otoczeniu stabilnym i przewidywalnym. \n\n"
    },
    {
        "nr": 48,
        "q": " W przedsiębiorstwie ABC zasadniczy podział na działy przedstawia się następująco",
        "a": " dział projektowania, dział produkcji, dział handlowy, dział marketingu, dział księgowości. Jaki typ struktury organizacyjnej reprezentuje to przedsiębiorstwo: \nstruktura funkcjonalna\n\n\n"
    },
    {
        "nr": 49,
        "q": " Struktura przedsiębiorstwa ABC oparta jest na dwóch nakładających się kryteriach grupowania",
        "a": " z jednej strony istnieje podział na dział projektowania, dział produkcji, dział handlowy, dział marketingu, dział księgowości, a z drugiej podział na zespoły projektowe. Jaki typ struktury organizacyjnej reprezentuje to przedsiębiorstwo: [26]\nstruktura macierzowa\n\n"
    },
    {
        "nr": 50,
        "q": " Elastyczna i w bardzo niewielkim stopniu sformalizowana struktura organizacyjna przedsiębiorstwa to struktura",
        "a": "[27]\nstruktura amorficzna\n\n"
    },
    {
        "nr": 51,
        "q": " W której ze struktur organizacyjnych pracownik ma więcej niż jednego przełożonego",
        "a": " [28]\nMechanistycznej\nMacierzowej\nFunkcjonalnej („typ U”)\nHoldingowej\n\n\n"
    },
    {
        "nr": 52,
        "q": " Zmienne brane pod uwagę w metodzie BCG to",
        "a": " [29]\nWielkość przedsiębiorstwa i dynamika rynku\nWzględny udział w rynku oraz dynamika rynku\nStopa oprocentowania kredytów i dynamika rozwoju rynku\nProcentowy udział w rynku i średnia stopa zwrotu z inwestycji\n\nRelatywny udział w rynku \nDynamika wzrostu rynku\n\n"
    },
    {
        "nr": 53,
        "q": " W metodzie BCG gwiazdy od znaków zapytania różnią się",
        "a": " [29]\n\trelatywnym udziałem w rynku (niższy dla znaków zapytania).\n\nGwiazdy - inaczej nazywane \"przebojami”. Są to produkty, które wymagają tak dużego finansowania, że nie generują nadwyżki. Nie oznacza to jednak, że nie uzyskuje się z nich przychodów. Inwestowanie w gwiazdę jest bardzo opłacalne, ponieważ tempo wzrostu rynku jest wysokie a sam produkt jest konkurencyjny i rozwojowy. Gwiazdy z biegiem czasu mogą przekształcić się w dojne krowy. \nZnaki zapytania - inaczej dylematy, są to produkty deficytowe, których możliwości jest trudno określić. Charakteryzują się niskim udziałem w szybko rozwijającym się rynku. Przynoszą przedsiębiorstwu niskie dochody, jednak w dłuższej perspektywie, jeżeli zostaną doinwestowane, mogą stać się gwiazdami.\nRóżnią się rentownością : gwiazdy wysoka, z.zapytania słaba.\n\n"
    },
    {
        "nr": 54,
        "q": " Analiza pięciu sił konkurencyjnych Portera NIE obejmuje",
        "a": " \nOBEJMUJE: \nrywalizacja pomiędzy konkurentami będącymi już w danym sektorze\nDostawcy – czyli siła przetargowa dostawców\nNabywcy – czyli siła przetargowa nabywców\nSubstytuty – czyli groźba substytucyjnych produktów lub usług\nPotencjalni wchodzący- czyli groźba nowych wejść\n\n\n"
    },
    {
        "nr": 55,
        "q": " W metodzie BCG gwiazdy od dojnych krów różnią się",
        "a": " [29]\n\tdynamiką wzrostu rynku (niższa dla dojnych krów).\n\nGwiazdy - inaczej nazywane \"przebojami”. Są to produkty, które wymagają tak dużego finansowania, że nie generują nadwyżki. Nie oznacza to jednak, że nie uzyskuje się z nich przychodów. Inwestowanie w gwiazdę jest bardzo opłacalne, ponieważ tempo wzrostu rynku jest wysokie a sam produkt jest konkurencyjny i rozwojowy. Gwiazdy z biegiem czasu mogą przekształcić się w dojne krowy.\nDojne krowy - produkty, będące żywicielami jednostki organizacyjnej. Wzrost rynku jest wolny, ale dzięki dużym udziałom w rynku mają mocną i stabilną pozycję. Są to wyroby, które generują przedsiębiorstwu nadwyżkę netto i mogą finansować pozostałe wyroby, inwestycje lub być wsparciem dla rozwijających się gwiazd.\nRóżnią się potrzebami finansowania: gwiazdy mają duże, a d.krowy małe potrzeby finansowe.\n\n"
    },
    {
        "nr": 56,
        "q": " Zgodnie z definicją dywersyfikacja pozioma zależna działalności przedsiębiorstwa to",
        "a": "\nDywersyfikacja pozioma polega na rozszerzeniu produkcji o wyroby lub też usługi nie wykraczające poza przemysł, w którym firma działa obecnie. \nDywersyfikacja zależna- strategia, według której organizacja prowadzi kilka jednostek operacyjnych w jakiś sposób wzajemnie ze sobą powiązanych.\n\n"
    },
    {
        "nr": 57,
        "q": " Zgodnie z definicją dywersyfikacja pozioma niezależna działalności przedsiębiorstwa to",
        "a": "\nDywersyfikacja niezależna- strategia, według której organizacja prowadzi kilka jednostek operacyjnych niepowiązanych ze sobą.\n\tźródło: Ricky Griffin, Podstawy zarządzania organizacjami, Warszawa 1996\n\n"
    },
    {
        "nr": 58,
        "q": " W jaki sposób wysoka nieprzewidywalność otoczenia wpływa na poziom zapasów materiałów",
        "a": " [30]\nzwiększa się poziom zapasów\n\n"
    },
    {
        "nr": 59,
        "q": " W jaki sposób wysoka złożoność i niepewność otoczenia wpływa na poziom centralizacji władzy w przedsiębiorstwie",
        "a": " [31]\nwysoka złożoność i niepewność otoczenia prowadzi do decentralizacji\n\n"
    },
    {
        "nr": 60,
        "q": " Sytuacja, w której na danym rynku występuje tylko jeden klient i wielu dostawców, to",
        "a": " [32]\nmonopson\n\n"
    },
    {
        "nr": 61,
        "q": " Która z konfiguracji rynkowych daje klientowi lepszą pozycję przetargową",
        "a": " [33]\nmonopson \n\n"
    },
    {
        "nr": 62,
        "q": " Która z ról organizacyjnych nie jest rolą kierowniczą",
        "a": " [34]\nLider zespołu\nStrateg\nWykonawca\n\nRolami kierowniczymi SĄ:\ninterpersonalne (rola reprezentanta, przywódcy, łącznika/pośrednika)\ninformacyjne (rola rzecznika, obserwatora/specjalisty/eksperta/monitora, propagatora/upowszechniającego informacje)\ndecyzyjne (rola przedsiębiorcy, przeciwdziałającego zakłóceniom, dysponenta/rozdzielającego zasoby, negocjatora)\n\n"
    },
    {
        "nr": 63,
        "q": " Która z funkcji zarządzania obejmuje tworzenie struktury organizacyjnej przedsiębiorstwa",
        "a": " [35]\norganizowanie\n(Funkcje zarządzania to: planowanie, koordynowanie, organizowanie, kontrolowanie, przewodzenie)\n"
    },
    {
        "nr": 64,
        "q": " Właściwa kolejność działań w procesie kontroli to",
        "a": " [36]\nUstalanie norm.\nMierzenie wyników.\nPorównywanie wyników z normami.\nOcenę uzyskanych wyników: akceptującą stan, powodującą korektę odchyleń,\nzmieniającą normę.\n\n"
    },
    {
        "nr": 65,
        "q": " O efekcie synergicznym mówimy, gdy",
        "a": " [37]\nproces współdziałania dwóch albo więcej czynników z uzyskaniem większego efektu od łącznej interakcji niż od efektu ich pojedynczego działania.\n\n"
    },
    {
        "nr": 66,
        "q": " Elementem funkcji organizowania NIE jest",
        "a": " [38]\nOrganizowanie obejmuje:\norganizację przestrzenną\npodział pracy\nopracowanie struktury organizacyjnej \ndelegowanie uprawnień decyzyjnych i odpowiedzialności \nopracowanie procesów \nkoordynowanie działań w czasie i przestrzeni,\nbudowa zespołów \nzapewnienie informacji \n\n"
    },
    {
        "nr": 67,
        "q": " Elementem funkcji planowania jest",
        "a": " [38]\nW ramach planowania należy:\nrozpoznać i zrozumieć obecną sytuację,\nprzewidzieć przyszłe zmiany sytuacji,\nokreślić niezbędne zasoby (techniczne, ludzkie, finansowe itp.),\nsformułować działania niezbędne do osiągnięcia celów,\nprzewidzieć konsekwencje podjęcia i niepodejmowania działań,\nokreślić sposób monitorowania i kontroli realizacji planów.\nOKREŚLIĆ CELE, KTÓRE OBEJMUJĄ:\n*strategiczne (określa ogólną orientację przedsiębiorstwa w otoczeniu, precyzuje jego misję, główne cele, wyroby i rynki, rozdziela zasoby między podstawowe obszary działania przedsiębiorstwa) \n* operacyjne (dobór narzędzi do realizacji planów strategicznych)\nDo zadań planowania należy:[wykłady z Podstaw zarządzania]\n 1. Ustalenie zadań dla poszczególnych komórek organizacyjnych przedsiębiorstwa na krótkie okresy. \n2. Zapewnienia pełnego, terminowego i rytmicznego wykonywania zadań rocznych przedsiębiorstwa.\n 3. Aktualizacja i dostosowanie zadań rocznych do nowo zaistniałych warunków w zakresie postępu technicznego, rynku zbytu. \n"
    },
    {
        "nr": 68,
        "q": " Funkcje planowania i organizowania skupione są",
        "a": " \nwokół celów strategiczne i operacyjne organizacji \nna wyższych szczeblach organizacyjnych ()\n\n\n\n"
    },
    {
        "nr": 69,
        "q": " Elementem funkcji kontroli jest",
        "a": " \n\nFUNKCJE KONTROLI \n• sygnalizacyjna [informacyjna] \n• korygująca [ochronna, pozwala na bieżące poprawki] \n• inspirująca [pobudzająca, skłania do danych zachowań] \n• profilaktyczna [prewencyjna, zniechęca do danych zachowań] \n• instruktażowa [instruowanie osób kontrolowanych] \n• dydaktyczno-wychowawcza             \n\nETAPY KONTROLI:\nustalenie normy,\nPomiar\nkontrola wstępna -  ilości i jakości nakładów rzeczowych;\nkontrola bieżąca - kontrola warunków przetwarzania i wyników etapowych; \nkontrola następcza - kontrola efektow na potrzeby przyszłych decyzji\n     3) Porównanie danych pomiarowych z normą\n     4) Ustalenie potrzeby działań korygujących            \n a) akceptacja stanu lub           \n b) korekta odchyleń lub           \n   \t c) korekta normy\n\n\n   [wykłady z Podstaw Zarządzania]\n\n"
    },
    {
        "nr": 70,
        "q": " Elementem funkcji organizowania jest",
        "a": " \n\tOrganizowanie to kształtowanie struktury organizacyjnej, która zapewnia realizację opracowanego wcześniej  i tym samym obranego wcześniej celu. To podejmowanie przez aparat rządzący czynności i decyzji organizacyjnych, które zmierzają do określenia pozycji oraz indywidualnych i zbiorowych ról członków organizacji. Poza tym mają na celu określenie kanałów informacyjnych. Konstruowanie struktury organizacyjnej to ustanawianie reguł poziomego i pionowego podziału pracy i zasobów potrzebnych do realizacji zadań, ustalanie przepływów informacji i dostępu do niej oraz zasad umiejscowienia uprawnień do podejmowania decyzji. Organizowanie jest to więc ustalanie procedur pełnienia ról organizacyjnych. Utworzona struktura tak sprzęga działania, że realizacja celów jest zapewniona. []\n \n"
    },
    {
        "nr": 71,
        "q": " Do jakiej grupy metodyk zarządzania projektami należy metodyka PMI/PMBoK? ",
        "a": "\nZwinnych zarządczych\nTradycyjnych zarządczych \nTradycyjnych wytwórczych\nZwinnych wytwórczych\n\nmetodyka tradycyjna / klasyczna\n\n"
    },
    {
        "nr": 72,
        "q": " Która z metodyk obejmuje całość procesów zarządzania projektami przez wszystkie osoby związane z projektem np. zarząd? ",
        "a": "\nPrince 2 - tu ważny jest zarząd\n"
    },
    {
        "nr": 73,
        "q": " Która z metodyk zarządzania projektami określa najmniej ról w projekcie? ",
        "a": "\nscrum\n"
    },
    {
        "nr": 74,
        "q": " W której metodyce zarządzania projektami określona jest wprost grupa procesów dotyczących zarządzania zasobami?",
        "a": "\nPMBok\n"
    },
    {
        "nr": 75,
        "q": " Którą metodykę zarządzania projektami charakteryzuje ciągłe uzasadnienie biznesowe? [47]",
        "a": "\nPRINCE2\n\n"
    },
    {
        "nr": 76,
        "q": " Zestaw wartości, przekonań, zachowań, obyczajów i postaw, który pomaga członkom organizacji zrozumieć, za czym organizacja się opowiada, jak działa i co uważa za ważne to",
        "a": "[39]\nKultura organizacyjna \n"
    },
    {
        "nr": 77,
        "q": " Upełnomocnienie pracowników polega na",
        "a": " [40]\nUpełnomocnienie pracowników, po angielsku empowerment, jest procesem, podczas którego poszczególne jednostki lub zespoły pracownicze, zosta0ją upełnomocnione. Dzięki temu mogą one same określać zakres swoich obowiązków oraz zadania, jakie muszą wykonać. Tacy pracownicy sami muszą kontrolować swoją pracę, wyznaczać sobie cele i kierunki działań w firmie. Przekłada się to na zwiększenie zaangażowania, jak i poczucia odpowiedzialności za swoje czyny u pracownika. \n"
    },
    {
        "nr": 78,
        "q": " Wymiarami siatki przywódczej są",
        "a": " [41]\nZorientowanie/troska/nastawienie na ludzi i zorientowanie na zadania/produkcję\n\n\n"
    },
    {
        "nr": 79,
        "q": " Przywodztwo charyzmatyczne polega na tym, iż",
        "a": " \nprzywódca posiada charyzmę, dzięki której może łatwo przekonać do siebie ludzi. To zdolność wpływania na innych ludzi, która bazuje na trzech komponentach, które Arystoteles 2500 lat temu nazwał logos (logika, dowody, rozumowanie), etos (wiarygodność mówcy, etyka) i patos (dostęp do emocji).\n\n"
    },
    {
        "nr": 80,
        "q": " Kierowanie konfliktem w organizacjach polega na",
        "a": "\ndziałaniach zmierzających do minimalizowania negatywnych skutków konfliktu dla funkcjonowania organizacji, a równocześnie wzmacniania jego skutków pozytywnych\n\nZarządzanie konfliktem to wszelkie działania które mają za zadanie eliminacje, redukcję i wyciszenie konfliktu lub ukierunkowanie jego skutków by maksymalnie wykorzystać jego pozytywne skutki i twórcze efekty. Konflikt z natury zbiorowości ludzkich jest stanem naturalnym. Kompletna jego eliminacja jest niemożliwa a co więcej niepożądana.\n\n"
    },
    {
        "nr": 81,
        "q": " Ile wynosi szósta potęga liczby i",
        "a": "\n-1\n\n"
    },
    {
        "nr": 82,
        "q": " Ile rozwiązań w ciele liczb zespolonych ma równanie z3=1+i",
        "a": " [48]\n3\n\n"
    },
    {
        "nr": 83,
        "q": " Jaki jest warunek istnienia macierzy odwrotnej do A",
        "a": " [49]\ndet A≠0\ndet A=0x\nwszystkie elementy macierzy A spełniają warunek aij=0\nwszystkie elementy macierzy A spełniają warunek aij≠0\n\nwyznacznik macierzy A musi być różny od 0, czyli macierz A nie może być macierzą osobliwą.\n\n"
    },
    {
        "nr": 84,
        "q": " Wyznacznik iloczynu macierzy A i B spełnia ogólny warunek",
        "a": " [50]\nwyznacznik ich iloczynu jest równy iloczynowi ich wyznaczników det(AB)=detA*detB [Twierdzenie Cauchy’ego (teoria wyznaczników)]\n\n"
    },
    {
        "nr": 85,
        "q": "  Jaką postać ma wzór na wysokość jednorazowej składki netto dla polisy na życie",
        "a": " [51]\n\n\n"
    },
    {
        "nr": 86,
        "q": " Stopa jednorazowej składki netto dla polisy terminowej na dożycie dla mężczyzn w wieku lat 30 jest?\n\nwyższa niż składka terminowa na “życie” i “składka bezterminowa” mezczyzn \nniższa niż składka terminowa na “życie i dożycie” mężczyzn chat gpt twierdzi ze to xDD\n\nniższa od składki terminowej na dożycie u kobiet\nWyższa niż dla  mężczyzn 30+\nniższa niż dla mężczyzn poniżej 30 roku życia\nJeżeli zgon nastąpi po n latach od wykupu polisy, to zostaje wypłacane. Jeżeli zgon nastąpi podczas n lat nie zostanie wypłacone.\n \nStopa składki netto dla ubezpieczenia na dożycie, dla metody liczb komutacyjnych wyznaczamy ze wzoru  Ax=Dx+nDx  , gdzie\n \nn - to termin polisy (ilość lat)\nDx= lx* Vx\n \nStopa jednorazowej składki netto dla polisy terminowej na dożycie dla mężczyzn w wieku lat 30 jest równa A30 = D30+nD30\n\n\nznalezione materiały",
        "a": "  brak wniosków\n\n"
    },
    {
        "nr": 87,
        "q": " Kredyt z oprocentowaniem nominalnym 10% w wysokości 10 tys. spłacany jest w 5 ratach rocznych, (kapitalizacja złożona, zgodna). Jaki typ oprocentowania jest  korzystniejszy  dla klienta?\n10000*(1,1^5)=16 105,10   10000*(0,9^(-5))=16 935,09\n\nWg mnie z dołu, bo to przecież kredyt",
        "a": " im mniej tym lepiej - Popieram, bo poza tym płacąc z dołu ma więcej “czasu” na spłatę - nie płaci całości od razu XDD\n\nChyba, że pytanie jest o coś innego tj. “typ oprocentowania”, a nie sposób kapitalizacji.\n\n"
    },
    {
        "nr": 88,
        "q": " Kredyt z oprocentowaniem nominalnym 10% w wysokości 10 tys. spłacany jest w 5 ratach rocznych, (kapitalizacja złożona, zgodna). Czy korzystniejsze są spłaty o stałych łącznych ratach, czy też o stałych ratach kapitałowych?",
        "a": "\nKorzystniejsze są stałe raty kapitałowe\n\n"
    },
    {
        "nr": 89,
        "q": " Czym jest awersja do ryzyka? [52]",
        "a": "\nJest to cecha aktorów gospodarczych, którzy mając do wyboru pewność wypłaty określonej kwoty lub loterię o wartości oczekiwanej tej samej wysokości, preferują pewną wypłatę (czyli unikają ryzyka).\n\n"
    },
    {
        "nr": 90,
        "q": " Jaki jest wzór na oczekiwaną stopę zwrotu dla portfela budowanego metodą Markowitza? [53]",
        "a": "\n\nErP = Xa*ErA + xBErB\n\nErP - oczekiwana stopa zwrotu\n\n\n\n\n\n"
    },
    {
        "nr": 91,
        "q": " Całka oznaczona funkcji f(x) w granicach całkowania x=a, x=b jest równoważna",
        "a": "\n\n\nGranicy kolejnych przybliżeń pola obszaru ograniczonego wykresem funkcji y=f(x) oraz osiami OX x=a, x=b, ale tylko wtedy gdy f(x)>0  ?\nGranicy kolejnych przybliżeń pola obszaru ograniczonego wykresem funkcji i osią OX oraz prostymi x=a, x=b. ?\nGranicy ciągu sum częściowych , którą tworzą dowolne prostokąty o podstawie odcinka zawierającego się w odcinku [a,b} oraz wartości f(c), gdzie c należy do wnętrza tego odcinka\nRodzinie pewnych funkcji różniących się stałą\n?\n\n\n(gdzie F to funkcja pierwotna, czyli pochodna z F(x) to f(x))\n\n\n"
    },
    {
        "nr": 92,
        "q": " Kiedy całka oznaczona funkcji w granicach całkowania jest równa różnicy wartości funkcji pierwotnej w punktach ?",
        "a": "\nkiedy funkcja pierwotna jest ciągła w przedziale [a,b] - jest to zasadnicze twierdzenie rachunku całkowego \n\n"
    },
    {
        "nr": 93,
        "q": " Kryterium Leibniza dotyczy zbieżności szeregów liczbowych",
        "a": " \nszeregów naprzemiennych ( =(-1)nan )\n\n"
    },
    {
        "nr": 94,
        "q": " Warunkiem koniecznym zbieżności szeregu liczbowego jest, aby",
        "a": "\nCiąg an był ograniczony ?\nNie ma założen dotyczących ciągu an\nan był ciągiem o wyrazach dodatnich, dążącym do zera\nan był ciągiem dążącym do zera\n?\n\nGranica ciągu jest równa zero. lim nan = 0 \n\n"
    },
    {
        "nr": 95,
        "q": " W równaniu różniczkowym pierwszego rzędu występuje",
        "a": "\npierwsza pochodna funkcji niewiadomej \n\n"
    },
    {
        "nr": 96,
        "q": " W  równaniu różniczkowym  drugiego  rzędu,liniowym  i  jednorodnym  o  stałych współczynnikach występuje",
        "a": "\n\nRównanie charakterystyczne \n\n"
    },
    {
        "nr": 97,
        "q": " Z funkcją wielu zmiennych mamy do czynienia, gdy",
        "a": "\nDziedziną  funkcji f : X → Y jest podzbiór iloczynu kartezjańskiego co najmniej dwóch zbiorów liczb rzeczywistych \n\n"
    },
    {
        "nr": 98,
        "q": " Pochodna funkcji w punkcie istnieje, gdy",
        "a": "\nPochodna lewostronna i prawostronna są sobie równe dla danego punktu.\n\n"
    },
    {
        "nr": 99,
        "q": " Ciąg jest silnie rosnący, gdy",
        "a": "\nMówimy, że ciąg  jest silnie rosnący, jeśli \n\n"
    },
    {
        "nr": 100,
        "q": " Jeśli pochodna w punkcie x0 jest równa zero to funkcja",
        "a": "\nOsiąga w tym punkcie ekstremum.\n"
    },
    {
        "nr": 101,
        "q": " Jeżeli zmienna losowa ma rozkład symetryczny względem , to",
        "a": " [42]\nZmienna losowa X ma rozkład symetryczny, jeżeli istnieje takie a, że:\n\nGdy X ma rozkład symetryczny to:\na = EX\nE(X- EX)k = 0, dla k nieparzystych\n"
    },
    {
        "nr": 102,
        "q": " Niech X będazie zmienną losową o rozkładzie ciągłym o gęstości f. Wówczas jej wartość oczekiwana jest równa",
        "a": "[42]\n\t\n"
    },
    {
        "nr": 103,
        "q": " Jeżeli X jest zmienną losową o rozkładzie N(2,1), to",
        "a": " [43]\nEX = 2, D2(X) = 1, rozkład jest symetryczny\nN(m, sigma) -> EX = m; D2(X) =  sigma2\n"
    },
    {
        "nr": 104,
        "q": " Jeżeli X jest zmienną losową typu ciągłego o gęstości f, to",
        "a": "[44]\nMówimy, że X jest zmienną losową ciągłą, jeżeli istnieje funkcja f (gęstość rozkładu) taka, że:\n                                                            \t\nD2(X) =\nMoment zwykły:  \nMoment centralny:\n"
    },
    {
        "nr": 105,
        "q": " Test Kołmogorowa służy do badania",
        "a": "[45]\nTest Kołmogorowa-Smirnowa dla jednej próby służy  testowaniu podobieństwa uzyskanego rozkładu naszej badanej zmiennej z innym teoretycznym rozkładem np.: normalnym, Poissona, jednostajnym. ()\nTest Kołmogorowa-Smirnowa .\ndla dwóch prób pozwala porównać dwa rozkłady zmiennych losowych i stwierdzić czy różnią się od siebie\n"
    },
    {
        "nr": 106,
        "q": " Błąd pierwszego rodzaju to",
        "a": " [46]\nOdrzucenie hipotezy głównej w przypadku, gdy jest ona prawdziwa / Odrzucenie hipotezy zerowej, gdy w istocie jest ona prawdziwa. \n\n"
    },
    {
        "nr": 107,
        "q": " W agregatowym indeksie cenowym Laspeyresa porównujemy",
        "a": " [54]\nPorównujemy cenę i-tego artykuły w okresie badanym do ceny i-tego artykuły w okresie podstawowym, przy ilości sprzedaży lub zakupu tego artykułu w okresie podstawowym.\n\n"
    },
    {
        "nr": 108,
        "q": " Co to jest indeks łańcuchowy? [55]",
        "a": "\nIndeks łańcuchowy to indeks, w którym okres, do którego się odnosimy jest okresem poprzednim, tzn. analizując np. kolejne lata możemy dowiedzieć się o ile procent wzrosła/spadła wartość względem poprzedniego roku.\nIloraz teoretycznego poziomu zjawiska w okresie badanym, do teoretycznego poziomu zjawiska w okresie poprzedzającym okres badany.\n"
    },
    {
        "nr": 109,
        "q": " Miarą rozproszenia danych jest między innymi",
        "a": " [56]\nRozstęp, rozstęp kwartylowy, wariancja, odchylenie standardowe, współczynnik zmienności. \n"
    },
    {
        "nr": 110,
        "q": " Miarą  poziomu  współzależności  pomiędzy  dwiema  zmiennymi  nominalnymi,  z  których przynajmniej jedna zawiera trzy albo większą liczbę potencjalnie przyjmowanych wartości jest miedzy innymi",
        "a": " [617]\n- Współczynnik korelacji Spearmana. raczej nie -> on jeśli wartości są na skali porządkowej, przy czysto nominalnych zmiennych nie zdziała\n- Współczynnik kontyngencji (współczynnik kontyngencyjny lub współczynnik kontyngencji Pearsona)  \n"
    },
    {
        "nr": 111,
        "q": " Co między innymi obrazuje dynamikę zmian zjawisk ekonomicznych?",
        "a": " [618]\nIndeksy statystyczne: indywidualne(np. indywidualny indeks ilości i cen, indywidualny indeks wartości)  i agregatowe(np. agregatowy indeks ilości i cen, agregatowy indeks wartości).\n"
    },
    {
        "nr": 112,
        "q": " Co to jest indeks jednopodstawowy?",
        "a": " [57]\nIndeks jednopodstawowy to indeks, w którym okres, do którego się odnosimy jest z góry ustalony, tzn. analizując np. kolejne lata możemy dowiedzieć się o ile procent wzrosła/spadła wartość względem z góry ustalonego roku.\n"
    },
    {
        "nr": 113,
        "q": " Kamień milowy w zarządzaniu projektami to",
        "a": " [58]\nJest to ważne zdarzenie w harmonogramie o czasie trwania 0, które podsumowuje określony zestaw zadań bądź daną fazę projektu.\nOznacza on jednocześnie pewne istotne, jednorazowe zdarzenie, które można w jednoznaczny sposób określić. Może to być: podpisanie dokumentu, otrzymanie wyniku, ważne spotkanie, zatwierdzenie pracy etc. Sam kamień milowy nie pochłania zasobów, czasu lub pieniędzy, lecz po prostu jest punktem odniesienia dla oceny wykonania planu.\nZazwyczaj wystąpienie kamienia milowego wiąże się z dalszymi decyzjami odnośnie rozwoju projektu.\n"
    },
    {
        "nr": 114,
        "q": " Ścieżka krytyczna pozwala przede wszystkim na",
        "a": " [59]\nOdnalezienie takich zadań (znajdujących się na ścieżce), że opóźnienie któregokolwiek z nich opóźni zakończenie całego projektu.\nOkreślenie najkrótszego możliwego czasu wykonania działań zawartych w planie. //chyba bardziej OCZEKIWANEGO czasu trwania: czas trwania ścieżki krytycznej determinuje czas trwania całego projektu ()\nW praktyce narzędzie planowania i kierowania prac i zapewnienia ich prawidłowego przebiegu w czasie. \n"
    },
    {
        "nr": 115,
        "q": " Które z narzędzi zarządzania projektami pozwala na wyświetlanie zadań na osi czasu?",
        "a": "\nMicrosoft Project // a nie chodzi. np. o Wykres Gantta?\n"
    },
    {
        "nr": 116,
        "q": " Co oznacza TCP/IP?",
        "a": "\nTransmission Control Protocol/Internet Protocol - pełni w sieciach komputerowych funkcje wzorca odzwierciedlającego strukturę internetu. Jest to zbiór protokołów używanych do transmisji danych przez sieci komputerowe. Podstawa struktury internetu, implementuje funkcjonalności 7 warstw standardowego modelu OSI.\n\n"
    },
    {
        "nr": 117,
        "q": " Sztuczna inteligencja odwzorowuje",
        "a": " \nzdolności przypisane ludzkiemu myśleniu: podejmowanie decyzji, rozwiązywanie problemów, uczenie się\n\n"
    },
    {
        "nr": 118,
        "q": " Co jest podstawowym mechanizmem w systemach sztucznej inteligencji?",
        "a": "\nmechanizm wnioskowania\n\n"
    },
    {
        "nr": 119,
        "q": " Zaliczanie obiektów do klas to",
        "a": " \nklasyfikacja (a nie klasteryzacja? To i to. Klasyfikacja to zaliczanie obiektów do klas w uczeniu z nadzorem, a klasteryzacja w uczeniu bez nadzoru (na podstawie wykładów z Politechniki Wrocławskiej); ściślej rzecz biorąc, klasteryzacja jest jedną z metod klasyfikacji bez nadzoru; klasyfikacja może być i z nadzorem, i bez nadzoru)\n\n"
    },
    {
        "nr": 120,
        "q": " Hierarchizacja kategorii w modelu danych pozwala na",
        "a": " [605]\n\nProstą formę wyszukiwania danych danej klasy przechodząc po przez kolejne poziomy szczegółowości.\n\n"
    },
    {
        "nr": 121,
        "q": " Jak nazywa się język pozwalający na zapis obiektów i właściwości interfejsu WPF? ",
        "a": "\nXAML\n\n"
    },
    {
        "nr": 122,
        "q": " Interfejs pozwalający na responsywne wyświetlania zawartości na dowolnym urządzeniu z systemem Windows określany jest mianem",
        "a": "\n\n\tWPF (NOTE: może to być UWP)\n\n"
    },
    {
        "nr": 123,
        "q": " W przypadku dużej liczby operacji wstawień do środka kolekcji najlepszym typem kolekcji będzie",
        "a": "\n\nLista\n\n\n\n"
    },
    {
        "nr": 124,
        "q": " Kolekcja pozwalająca na wycofywanie ostatnich operacji to",
        "a": " \n\nStos \n\n"
    },
    {
        "nr": 125,
        "q": " Na system bazy danych składa się",
        "a": " [606]\n\nDBMS (system zarządzania bazą danych)\nBaza danych \njęzyk komunikowania się\n()\n \n"
    },
    {
        "nr": 126,
        "q": " Odkrywanie wiedzy w danych, wcześniej nieznanych zależności, schematów i trendów na podstawie dużej liczby danych dotyczy pojęcia",
        "a": " [607]\n\nData Mining\n\n"
    },
    {
        "nr": 127,
        "q": " Kostkę OLAP można scharakteryzować jako",
        "a": "\nNarzędzie przekształcania informacji w wiedzę\nWielowymiarową bazę danych, gdzie dane są porządkowane\nHomogeniczna bazę danych\nNarzędzie odkrywania wiedzy w danych\n\nKostka OLAP (ang. OLAP cube) – struktura danych, która pozwala na szybką analizę danych. Przechowuje ona dane w sposób przypominający wielowymiarowe arkusze kalkulacyjne. Dzięki temu umożliwia manipulowanie i analizowanie danych z różnych punktów widzenia.\nPrzykładowa kostka:\n\n\n"
    },
    {
        "nr": 128,
        "q": "  Niech będzie dany algorytm postaci ",
        "a": " Algorytm B = { if(g) A1 else A2 }. Wiadomo, że warunek g wymaga wykonania t(g) operacji dominujących. Algorytmy A1 i A2 wymagają wykonania odpowiednio t(A1) i t(A2) operacji dominujących. Ile operacji dominujących wykonane zostanie w algorytmie B?\n\nto jest poprawne !!! : t(g)+t(A1) lub t(g)+t(A2) \na może: t(g) + t(A1) lub t(A2)? (myślę, że jednak pierwsza wersja, ponieważ i tak algorytm musi przetworzyć ten warunek, by się dowiedzieć, czy jest spełniony, czy nie.)\n\n"
    },
    {
        "nr": 129,
        "q": " Drzewo rozpinające graf (ang. Spanning Tree) to drzewo, które zawiera wszystkie wierzchołki grafu G, natomiast zbiór krawędzi drzewa jest podzbiorem zbioru krawędzi grafu. Do jego wyznaczenia można wykorzystać? [610]",
        "a": "\n\n\tDFS i BFS\n\n"
    },
    {
        "nr": 130,
        "q": " Jakie funkcje pełni serwer Apache? [608]",
        "a": "\nJest to internetowy Serwer bazy danych\nJest to rozbudowana warstwa systemu operacyjnego niezbędna do budowania internetowych stron www\nWraz z PHP i silnikiem baz danych MySQL Apache stanowi oprogramowanie, które jest popularną platformą dynamicznych stron www\nJest to język pozwalający na budowanie oprogramowanie bazy danych MySQL\n\n"
    },
    {
        "nr": 131,
        "q": " Dokumenty udostępniane przez serwery HTTP są identyfikowane za pomocą adresów URL (Uniform Resource Locator). Adres URL jest łańcuchem znakowym, który zawiera",
        "a": " [609]\n\nCzęści określającą rodzaj zasobu/usługi, dwukropka i części zależnej od rodzaju zasobu (ang. scheme-specific part) zawsze zaczynającej się od ukośnika /.\n\nURL to format adresowania zasobów w internecie, ale najczęściej mówimy o nim w kontekście adresu strony internetowej.\nCzęści składowe adresu URL:\n– rodzaj zasobu - w przypadku adresu www będzie to HTTP lub HTTPS (usługa szyfrowanego HTTP)\n– część zależna - nazwa domeny, rozszerzenie, ścieżka dostępu\n\n\n"
    },
    {
        "nr": 132,
        "q": " W modelu MVC aplikacji internetowej warstwę danych zapisujemy w klasach",
        "a": " \n\nW klasach modelu (MVC - Model-View-Controller)\nTypu POCO, które przechowują przetworzone dane, bez logiki biznesowej\n oznacza prosty obiekt nieobciążony , praktycznie niezawierający logiki biznesowej i nieposiadający atrybutów wymaganych do współpracy ze specyficznymi \n\n\n"
    },
    {
        "nr": 133,
        "q": " W nowym modelu obiektowym PHP (+5.0) konstruktor klasy Klasa zapisujemy jako",
        "a": " \n\nclass BaseClass {\n    function __construct() {\n        print \"In BaseClass constructor\\n\";\n    };\n\n"
    },
    {
        "nr": 134,
        "q": " Co to jest programowanie imperatywne?  [623]",
        "a": "\n\nProgramowanie imperatywne to najbardziej pierwotny sposób programowania, w którym program postrzegany jest jako ciąg poleceń dla komputera. Jest to paradygmat, w którym programowanie jest sekwencją instrukcji, które zmieniają stan programu.\n\n"
    },
    {
        "nr": 135,
        "q": " Przykładem języka programowania logicznego jest",
        "a": " \n\nProlog\n\n"
    },
    {
        "nr": 136,
        "q": " Co w języku programowania C oznacza modyfikator extern przed nazwą stałej globalnej?",
        "a": "  [626]\n\nJeżeli extern poprzedza deklarację niezainicjalizowanej  (globalnej lub lokalnej) albo stałej, oznacza to wówczas, że deklarowany obiekt nie zawiera się w danym pliku, a w innej jednostce kompilacji (może to być inny moduł, nagłówek, biblioteka statyczna lub dynamiczna itp.)\n\n\n\n\n"
    },
    {
        "nr": 137,
        "q": " Zakładając, że liczba całkowita 15 jest zapisana w systemie U2 na 1 bajcie, jaką liczbę otrzymamy w wyniku operacji negacji bitowej tej liczby?",
        "a": "\n\n\n\npoprawna odpowiedź: -16\n\n\n"
    },
    {
        "nr": 138,
        "q": " Jaka jest średnia złożoność algorytmu quicksort?",
        "a": " [624]\n\nT(n) = O(n ln n) \n\nZłożoność pamięciowa: O(logn)\n\n"
    },
    {
        "nr": 139,
        "q": " Ze względu na podejście do obsługi typów zmiennych Python jest językiem o typowaniu (typing)",
        "a": "[622]\n\ndynamicznym\n\n"
    },
    {
        "nr": 140,
        "q": " Blok kodu w języku Python oznaczony jest za pomocą",
        "a": "\n\nWcięcia\n\n"
    },
    {
        "nr": 141,
        "q": " Ekspresyjność rachunku zdań jest",
        "a": "\nniedostateczna? Rachunek zdań jest zbyt mało ekspresyjny ?  słaba\nmoże gorsza od ekspresyjności języka naturalnego???\n(str 20 tu: )\n\n"
    },
    {
        "nr": 142,
        "q": " Relacja w relacyjnym modelu danych jest",
        "a": "\nprzecięciem zbiorów\npodzbiorem iloczynu kartezjańskiego dziedzin\nsumą zbiorów\niloczynem kartezjańskim\n\n\nRelacja jest to zdefiniowanie logicznego połączenia między tabelami bazy danych. W efekcie zmiana wiersza bieżącego w tabeli głównej powoduje automatyczną zmianę wiersza bieżącego w tabeli przyłączonej.\n\n“W modelu relacyjnym baz danych wszystkie dane są przechowywane w dwuwymiarowych tabelach (relacjach). W skład bazy danych może wchodzić wiele relacji.”\nźródło - >\n\n \n"
    },
    {
        "nr": 143,
        "q": " Operacja selekcji w języku SQL pozwala na",
        "a": "\nOperacja selekcji umożliwia wyodrębnienie podzbioru krotek relacji, które spełniają warunek selekcji.\n\n"
    },
    {
        "nr": 144,
        "q": " Jak należy zamknąć bieżący obiekt okna w kodzie aplikacji Windows Presentation Foundation lub Windows Forms",
        "a": "\nthis.Close()\n \n"
    },
    {
        "nr": 145,
        "q": " W celu sprawdzenia liczby elementów kolekcji np. List czy Stack należy odwołać się do",
        "a": "\n[nazwalisty].Count\n\n"
    },
    {
        "nr": 146,
        "q": " Czego przykładem jest poniższy kod",
        "a": "\n \nclass A{\n        \t private string x;\n        \tpublic string GetX{\n        \t return x;\n        \t}\n\n  hermetyzacji pola x\n"
    },
    {
        "nr": 147,
        "q": " Kod pośredni C# (CIL) powstaje w wyniku",
        "a": " [629]\n\nKompilatory kompilują kod źródłowy do postaci uniwersalnego kodu zwanego kodem pośrednim (nazywa się on obecnie CIL). Do CLR (ang. Common Language Runtime)  należy zadanie kompilowania i uruchamiania kodu zapisanego językiem kodu pośredniego (CIL).. Kod pośredni powstaje w wyniku kompilacji kodu C#, a wykonanie to odbywa się na platformie .NET\n\n"
    },
    {
        "nr": 148,
        "q": " Poniższy diagram UML jest przykładem",
        "a": "\n\n\n \nAgregacji\nGeneralizacji\nAsocjacji jednokierunkowej\nAsocjacji dwukierunkowej\n\nrealizacji asocjacji jednokierunkowej jeden do wielu (poprzez dodanie atrybutu w klasie A)\n\n"
    },
    {
        "nr": 149,
        "q": " Przy spełnionych założeniach twierdzenia Gaussa-Markowa estymatory parametrów jednorównaniowego liniowego modelu ekonometrycznego są",
        "a": "\n        \tBLUE (Best Linear Unbiased Estimator), tzn. najlepszy w klasie wszystkich estymatorów liniowych, a więc jest nieobciążony, efektywny (ma najmniejszą wariancję) i zgodny przy warunku nieskorelowanych błędów.\n\n\n\n\n \n"
    },
    {
        "nr": 150,
        "q": " Prognozowanie ex-ante polega na wnioskowaniu o przyszłych wartościach zmiennej endogenicznej na podstawie",
        "a": "\n        \tPrognozowanie ex-ante polega na wnioskowaniu o przyszłych wartościach zmiennej endogenicznej na podstawie modelu wyjaśniającego kształtowanie się tej zmiennej i znajomości wartości zmiennych objaśniających w  przyszłości (z czego te wartości zmiennych egzogenicznych również są tylko przewidywane, bo “ante” oznacza z góry).\nPrognozy ex ante są natomiast oparte na nieznanych wartościach zmiennej objaśniającej lub zmiennych objaśniających. Te nieznane w momencie prognozowania wartości dotyczące okresu prognozowanego należy – w określony sposób – ustalić.\n \n"
    },
    {
        "nr": 151,
        "q": " Występowanie zjawiska autokorelacji składnika losowego jest spodziewane dla modelu ekonometrycznego opisującego",
        "a": "\n        \tszeregi czasowe\n \n"
    },
    {
        "nr": 152,
        "q": " Do wyboru jednego spośród kilku modeli ekonometrycznych nie służy/ą",
        "a": "\n        \tprawdopodobnie chodzi o R2, ponieważ zawsze gdy dodajemy do modelu zmienną R2 wzrasta, niezależnie od prawdziwej wartości tej zmiennej\n… natomiast służą na pewno: istotność współczynnika determinacji R2, skorygowany współczynnik R2,test t-Studenta (istotność zmiennych objaśniających), test Walda, kryteria informacyjne AIC, BIC…\n\n"
    },
    {
        "nr": 153,
        "q": " Dany jest model (przy standardowych oznaczeniach)",
        "a": " Jest to przykład modelu:\n        \tliniowego\n lub modelu jednorównaniowego \n"
    },
    {
        "nr": 154,
        "q": " Dany jest model (przy standardowych oznaczeniach)",
        "a": "  Jest to model:\nbłądzenia losowego\nbiałego szumu\nnieliniowy sprowadzalny do postaci liniowej\nrównaniach łącznie współzależnych\n \n"
    },
    {
        "nr": 155,
        "q": " Proces stochastyczny X(t) jest stacjonarny w szerszym sensie według definicji, jeżeli",
        "a": "\n\nWarunkiem stacjonarności w szerszym sensie  jest tylko to, aby pierwszy i drugi  nie zmieniał się w czasie. (słaba stacjonarność)\n\n \n1.   \n2.    , wartość oczekiwana jest stała w czasie.\n3.    , kowariancja procesu w dwóch punktach czasu zależy jedynie od odległości między nimi.\n\nWówczas jest stacjonarny w szerszym sensie (słaba stacjonarność). Ogólnie stacjonarność procesu stochastycznego polega na tym, że proces jest stały w czasie.\n\n//Znaleziono również takie warunki:\n\n \n"
    },
    {
        "nr": 156,
        "q": " Do estymacji parametrów modelu ARMA(0.1) posłużyć się można",
        "a": "\nMetodą największej wiarygodności, (metodą momentów?), metodą najmniejszych kwadratów, kanoniczna analiza korelacji, estymacja modelu ARIMA zapisanego w przestrzeni stanu, metoda Yule’a-Walkera (wykład z ekonometrii, str 193)\n \n"
    },
    {
        "nr": 157,
        "q": " Jakie warunki muszą być spełnione, aby można było mówić, że o zadaniu programowania mieszanego liniowego (PML)",
        "a": "\n        \tPML to programowanie liniowe w którym tylko część zmiennych przyjmuje wartości całkowite. Część zmiennych musi być typu całkowitego, a reszta innego rodzaju.\n(Występują zmienne ciągłe i dyskretne, dyskretne czyli np całkowitoliczbowe lub binarne)\n \n"
    },
    {
        "nr": 158,
        "q": " Co przedstawia graf w metodzie ścieżki krytycznej?",
        "a": "\nPrzedstawia zdarzenia i czynności składające się na projekt. Składa się z wierzchołków i\nłuków. Wierzchołki symbolizują wydarzenia rozpoczęcia lub zakończenia czynności, a łuki czynności. \n\n"
    },
    {
        "nr": 159,
        "q": " Które sformułowanie przedstawia zasadę optymalności Bellmana",
        "a": "?\ndot. programowania dynamicznego\nZasada optymalności Bellmana:\nPolityka [strategia] optymalna ma tę własność, że jakikolwiek jest stan\npoczątkowy i początkowa decyzja, pozostałe decyzje muszą tworzyć politykę\n[strategię] optymalną ze względu na stan wynikły z pierwszej decyzji.\n\n"
    },
    {
        "nr": 160,
        "q": " Sformułowanie modelu programowania liniowego nie wymaga w zapisie matematycznym",
        "a": "\n  model matematyczny zawiera:\nfunkcję celu (inaczej  kryterium) jest to najważniejsza część modelu, gdyż obrazuje  jaki chcemy osiągnąć. Musi to być funkcja liniowa zależna od wszystkich zmiennych decyzyjnych.\nzmienne decyzyjne opisują narzędzia i zasoby jakie mamy w posiadaniu, aby cel osiągnąć. Przyjmują one wartości nieujemne.\nwarunki ograniczające są to przeszkody, jakie mogą się pojawić w trakcie realizacji celu. Zapisujemy je w postaci nierówności, których lewe strony są funkcjami liniowymi.\n[]\n\n"
    },
    {
        "nr": 161,
        "q": " Co to jest optymalizowanie, jakie jest kryterium optymalizacji w metodzie ścieżki krytycznej? \noptymalizacja",
        "a": " metoda wyznaczania najlepszego (optymalnego) rozwiązania (poszukiwanie ekstremum funkcji) z punktu widzenia określonego kryterium (wskaźnika) jakości \nkryterium: czas\nCzyli w metodzie ścieżki krytycznej optymalizowany jest czas\n\n\n"
    },
    {
        "nr": 162,
        "q": " Co przedstawia graf stosowany w metodzie programowania dynamicznego?",
        "a": "\nWszystkie możliwe sposoby realizacji projektu (zadania)\nWszystkie operacje (etapy) konieczne do realizacji projektu (zadania)\nOgraniczenia kolejnościowe poszczególnych etapów realizacji projektu (zadania)\nOptymalny – wg przyjętego kryterium – zestaw operacji (etapów) koniecznych do realizacji projektu (zadania)\n\nPrzedstawia możliwe przejścia/połączenia ? Pozwala także znaleźć najkrótszą ścieżkę?\nzbiór węzłów i krawędzi\n\n\n\n"
    },
    {
        "nr": 163,
        "q": " Zdanie  ",
        "a": " „Jeśli będę uważał na wykładzie i przeczytam podręcznik to na pewno zdam egzamin”można  zapisać  w  języku  logiki  przyjmując: p-będę  uważał  na  wykładzie; q–przeczytam podręcznik; s-zdam egzamin w postaci:\n \n(p ^ q) => s\n\n"
    },
    {
        "nr": 164,
        "q": " System logiczny to układ złożony z języka, operacji konsekwencji oraz semantyki języka. Natomiast język systemu składa się z",
        "a": " \n\nJęzyk systemu to język formalny, zdefiniowany poprzez podanie jego alfabetu (zestawu symboli prostych) oraz reguł tworzenia wyrażeń złożonych. W skład alfabetu wchodzą zmienne (określonych kategorii, np.: zdaniowe, nazwowe), inne symbole proste (np. predykaty, symbole funkcyjne, stałe), stałe logiczne (np. symbole funktorów prawdziwościowych, kwantyfikatory, funktory reprezentujące modalności) oraz, ewentualnie, symbole pomocnicze (np. nawiasy, przecinek)c\n\n"
    },
    {
        "nr": 165,
        "q": " Formułą w rachunku predykatów jest",
        "a": "\n\nKażdy term\nKażde wyrażenie, które zawiera kwantyfikator\nKażda formuła atomowa\nKażda zmienna indywidualna\n\n\n\n"
    },
    {
        "nr": 166,
        "q": " We wnioskowaniu przesłankę oczywistą, ale pominiętą nazywa się przesłanką",
        "a": "\nPrzesłanka entymematyczna\n"
    },
    {
        "nr": 167,
        "q": " Poprawną definicją algorytmu jest",
        "a": "\nAlgorytm – jest skończonym, uporządkowanym ciągiem jasno zdefiniowanych czynności, koniecznych do wykonania postawionego zadania.\n"
    },
    {
        "nr": 168,
        "q": " Podstawowe cechy algorytmu to",
        "a": "\n- poprawność          (algorytm daje oczekiwane wyniki),\n- jednoznaczność    (zawsze daje te same wyniki przy takich samych danych wejściowych),\n- skończoność         (wykonuje się w skończonej liczbie kroków),\n- sprawność            (czasowa - szybkość działania i pamięciowa )\n\n\n"
    },
    {
        "nr": 169,
        "q": " Algorytm  asymetryczny  szyfrowania  to algorytm z dwoma lub więcej kluczami szyfrowania",
        "a": " publicznym i prywatnym. Wykorzystuje on przede wszystkim:\ndwa klucze, jeden do szyfrowania wiadomości, a drugi do deszyfrowania. Istotna jest zamiana tekstu jawnego w tekst tajny (kryptogram), w drodze stosowania podstawień i przestawień\n\nOperacje jednokierunkowe \n\n"
    },
    {
        "nr": 170,
        "q": " Algorytm wyszukiwania binarnego jest stosowany",
        "a": "\ndo wyszukiwania danych w tablicy posortowanych liczb. Algorytm ten został oparty o metodę „dziel i zwyciężaj” dzięki czemu potrafi w czasie logarytmicznym znaleźć szukaną liczbę oraz zwrócić jej indeks jeśli oczywiście została odnaleziona.\n\n"
    },
    {
        "nr": 171,
        "q": " W algorytmie wypisującym wierzchołki grafu w porządku DFS (ang.Depth-First-Search) należy użyć struktury danych",
        "a": "\nstos\n\n"
    },
    {
        "nr": 172,
        "q": " W algorytmie wypisującym wierzchołki grafu w porządku BFS (ang.Breadth-First-Search)należy użyć struktury danych",
        "a": "\nkolejka\n\n"
    },
    {
        "nr": 173,
        "q": " Podstawową różnicą pomiędzy kodem kompilowanym a skryptowym jest",
        "a": "\nkod skryptowy nie wymaga uprzedniej kompilacji, podczas pierwszego uruchomienia może zostać utworzony kod zoptymalizowany do szybkiego uruchamiania\nnie ma różnicy – jeden i drugi wymaga specjalnego programu do uruchomienia\nkod skryptowego nie można debugować \nkodu kompilowanego nie można debugować\n\nskryptowe -programy napisane w ten sposób to właściwie pliki tekstowe (i tak, można je edytować nawet w notatniku), uruchamia się je za pomocą dodatkowego programu i w momencie uruchomienia tekst (kod) jest interpretowany (zamieniany na postać zrozumiałą dla komputera i wykonywany).\n\nkompilowane -  zanim uruchomimy nasz kod, musimy go skompilować, tzn. przetłumaczyć na język zrozumiały dla komputera. W przypadku języków skryptowych proces ten odbywa się w momencie uruchamiania, za każdym razem jak program jest uruchamiany. W językach kompilowanych proces ten jest wykonywany tylko raz, jeszcze przed uruchomieniem programu.\n\n"
    },
    {
        "nr": 174,
        "q": " „Przenaszalność kodu” oznacza, że",
        "a": "\nmożliwość przenoszenia napisanego programu komputerowego na inną platformę sprzętową lub do innego systemu operacyjnego\n\n"
    },
    {
        "nr": 175,
        "q": " Czy program napisany w języku skryptowym po jego uruchomieniu może być modyfikowany?",
        "a": "\nnie\nw momencie uruchomienia tekst (kod) jest interpretowany (zamieniany na postać zrozumiałą dla komputera i wykonywany) - ogólnie to można zmienić kod ale nie program już uruchomiony\n\n"
    },
    {
        "nr": 176,
        "q": " „Interpreter” to inaczej",
        "a": "\nprogram wykonujący program zapisany w pewnym języku programowania w ten sposób, że tekst programu jest czytany i natychmiast wykonywany (odwrotnie niż w przypadku kompilatora, tłumaczącego tekst programu na postać, którą można potem wielokrotnie wykonywać);\nInterpreter to program, który analizuje kod źródłowy, a przeanalizowany fragment kodu wykonuje na bieżąco.\n\n"
    },
    {
        "nr": 177,
        "q": " Jakie składniki oprogramowania są niezbędne do rozwijania programu w języku Python?",
        "a": "\nIDE np. PyCharm\ninterpreter Python (w sumie najbardziej, bez tego nic nie uruchomisz), dowolny notatnik\n\n"
    },
    {
        "nr": 178,
        "q": " IDE to inaczej",
        "a": "\nZintegrowane środowisko programistyczne, IDE (od  integrated development environment) –  lub zespół programów (środowisko) służących do tworzenia, modyfikowania, testowania i konserwacji oprogramowania.\n\n"
    },
    {
        "nr": 179,
        "q": " Jakie elementy muszą być zawarte w pakiecie dystrybucyjnym programu napisanego w języku Python?",
        "a": "\nKażdy pakiet w Pythonie jest folderem, który MUSI zawierać specjalny plik nazwany __init__.py. Ten plik może być pusty i służy informowaniu, że ten folder zawiera pakiet Pythona. \n\nkod źródłowy, interpreter python i zależności (biblioteki …)\n\n"
    },
    {
        "nr": 180,
        "q": " Czy i pod jakimi warunkami w programie napisanym w języku Python można korzystać z bibliotek napisanych w języku C?",
        "a": "\nDzisiaj na potrzeby kodu Pythona można przywoływać biblioteki C i C ++, mogą być nazywane, jak w programach C i C ++ oraz mogą integrować się z komponentami języków Java i .NET.  Warunkiem jest dołączenie w C nagłówka \"Python.h\".\n\nMożna korzystać z bibliotek C w Pythonie, należy dołączyć nagłówek „Python.h” w C.\n#include <Python.h> // 1\n\n\n"
    },
    {
        "nr": 181,
        "q": " W której metodyce zarządzania projektami zostały określone trzy poziomy planowania?",
        "a": "\nPrince 2 - Zaleca zastosowanie trzech podstawowych poziomów planowania odzwierciedlających poszczególne szczeble zarządzania projektem. projektu, etapow, zespołów\n\n\n"
    },
    {
        "nr": 182,
        "q": " Sterowanie etapem w metodyce PRINCE2 polega na",
        "a": "\nSterowanie etapem (SE) jest głównym mechanizmem w projektach zarządzanych zgodnie z PRINCE2. Właścicielem procesu, w którym wykonuje się większość działań związanych z bieżącym zarządzaniem projektu, jest kierownik projektu. Cały etap powinien być realizowany jako ciągły cykl składający się z:\nPozwala podzielić duży projekt na łatwiej zarządzalne etapy (części)\n\nSE1 - Zgoda na wykonanie grupy zadań - jest głównym narzędziem kierownika projektu do przekazywania prac jak i elementem bieżącego sterowania, który odpowiada za przygotowanie, wydanie i uzgodnienie grup zadań. Prace do wykonania są przekazywane kierownikom zespołów lub bezpośrednio pracownikom przy pomocy grup zadań, na których zgodę wydaje kierownik.\nSE2 - Ocena postępów - to etap zbierania informacji o aktualnym stanie prac i przekazywanie ich do procesu \"Dokonywanie przeglądu stanu etapu\". Informacje potrzebne do uaktualnienia zatwierdzonego etapu zarządczego pochodzą z:\nraportów z punktów kontrolnych\nkart pracy\nzagadnień projektowych\nSE3 - Rejestrowanie zagadnień projektowych - polega na rejestracji pojawiających się zmian i podejmowania odpowiednich decyzji. Wszystkie zmiany traktowane są jako zagadnienia projektowe, które mogą być zgłoszone przez dowolną osobę związaną z projektem.\nSE4 - Analizowanie zagadnień projektowych - polega na analizie wszystkich zagadnień projektowych i skutków. Zagadnienia projektowe powinny być badane z perspektywy klienta, biznesu czy dostawcy. Odpowiedzialność spoczywa na kierowniku.\nSE5 - Dokonywanie przeglądu stanu etapu - proces ten zapewnia regularne sprawdzanie stanu realizacji etapu zarządczego w zestawieniu z zatwierdzonym planem.\nSE6 - Raportowanie o ważnych zdarzeniach - jest to raportowanie komitetowi sterującemu o ważnych zdarzeniach w sposób regularny (co miesiąc). Celem jest dostarczenie komitetowi sterującemu sumarycznych informacji.\nSE7 - Podejmowanie działań korygujących - umożliwia kierownikowi projektu dokonywania niewielkich korekt realizowanych prac w ramach uzgodnionej tolerancji. Projekty nie zmieniają się w sposób dramatyczny a za te działania odpowiedzialny jest kierownik projektu, wspomagany przez zespół zarządzania projektem.\nSE8 - Przenoszenie zagadnień projektowych na wyższy szczebel - po stwierdzeniu, że etap zarządczy może wykroczyć poza granice tolerancji, kierownik projektu musi powiadomić o tym komitet sterujący poprzez złożenie raportu o odchyleniach.\nSE9 - Odbieranie wykonanej grupy zadań - polega na odnotowywaniu pomyślnie wykonanej grupy zadań i przekazaniu jej organizacji realizującej projekt w sposób ustalony. Wyniki procesu są używane do oceny postępu prac poprzez dokonanie zapisu o wykonaniu zadania i aktualizacji zapisów dotyczących etapu zarządczego i projektu.\n\n\n\nSterowanie etapem - podstawowy proces zarządzania projektem–autoryzacja prac nad tworzeniem produktów, zbieranie danych o realizacji, ocenianie postępu i składanie sprawozdań strategicznemu kierownictwu projektu. Zapisywanie proponowanych zmian i błędów a w razie potrzeby informowanie o nich kierownictwa projektu.\n\n"
    },
    {
        "nr": 183,
        "q": " Six sigma i schematy przepływów, to narzędzia zalecane w PMI/PMBoK do",
        "a": "\nZarządzania jakością\n\n \n"
    },
    {
        "nr": 184,
        "q": " Warstwę prezentacji klienta aplikacji internetowej określamy w języku",
        "a": "\nPrzeglądarka WWW, HTML, CSS, JavaScript, Flash\n\n"
    },
    {
        "nr": 185,
        "q": " Do pobierania zawartości strony WWW ze źródeł, które mogą powodować opóźnienia w ich wyświetlaniu należy stosować",
        "a": "\ncachowanie/ładowanie asynchroniczne idk\n-ładowanie asynchroniczne dla plików CSS oraz JavaScript\n-redukcja żądań http\n-skompresowanie strony,\n-zredukuj rozmiar zdjęć,\n-CDN (Content Delivery Network)\n-zredukuj liczbę wykorzystywanych wtyczek,\n\n"
    },
    {
        "nr": 186,
        "q": " Za dostosowanie zawartości strony WWW do szerokości urządzenia, na którym jest wyświetlana odpowiada",
        "a": " \nMedia Queries dodane w  CSS3,\nRWD - responsive web design\n"
    },
    {
        "nr": 187,
        "q": " Sprawdzenie poprawności danych (np. adresu e-mail) wpisanego przez użytkownika w formularzu na stronie WWW najłatwiej zrealizować przez",
        "a": "  \t\nWukorzystanie frameworka np. Angular\nUstawienia odpowiednich atrybutów elementów <input>\nNapisanie odpowiedniego kodu po stronie serwera (np. w PHP)\nDopisanie kodu JavaScript, który sprawdza poprawność danych\nwyrażenia regularne(regex) - pattern=\ninput o typie email\n\n"
    },
    {
        "nr": 188,
        "q": " Poprawność systemu logicznego określa związek pomiędzy",
        "a": "\nPredykatami i zmiennymi\nJęzykiem a interpretacją\nFunkcjami i predykatami\nSkładnią a semantyką\nsemantyka(znaczenie) a syntaktyką(składnia)\n\n"
    },
    {
        "nr": 189,
        "q": " Poprzednikiem w regule systemu regułowego jest zazwyczaj",
        "a": " \nPrzesłanka lub warunek lub wyrażenie logiczne\n"
    },
    {
        "nr": 190,
        "q": " Kluczem w relacji jest",
        "a": "\nwybrany minimalny zestaw atrybutów relacji, jednoznacznie identyfikujący każdy rekord tej relacji, identyfikator\n \n"
    },
    {
        "nr": 191,
        "q": " Druga postać normalna relacji wyklucza",
        "a": "\nnie ma sytuacji ze atrybut zalezy od czesci klucza glownego a nie zalezy od calosci. kolumny zawierające atrybuty, które są innych typów niż typ wskazywany przez klucz podstawowy. Oznacza to. że wartości niekluczowych kolumn muszą zależeć od klucza podstawowego. Kolumny, które nie zależą od klucza podstawowego, najłatwiej rozpoznać po tym, że zawierają powtarzające się wartości. Nie mau\n [] polecam sobie obczaić przykład :D podbijam xd\n \n"
    },
    {
        "nr": 192,
        "q": " W kluczu nie może występować",
        "a": "\nWartość NULL\n \n"
    },
    {
        "nr": 193,
        "q": " Klucz obcy występuje w relacji pełniącej rolę",
        "a": "\nZależności, asocjacji\n \n"
    },
    {
        "nr": 194,
        "q": " Funkcjonalność systemów dziedzinowych dotyczy",
        "a": "\njednej lub kilku wybranych sfer działalności techniczno - ekonomicznej przedsiębiorstwa\n\n"
    },
    {
        "nr": 195,
        "q": " Funkcjonalność systemów CRM dotyczy",
        "a": "\n\nSystemy CRM to z angielskiego Customer Relationship Management, czyli  zarządzanie relacjami z klientami to zespół działań i instrumentów niezbędnych w zarządzaniu kontaktami z klientami.\nFunkcjonalności systemu CRM: komunikacja z klientem, łatwiejsze nawiązywanie  i poprawa kontaktów handlowych, efektywniejsza obsługa klienta, klasyfikacja klientów i lepszy marketing docelowy\n\n\n\n"
    },
    {
        "nr": 196,
        "q": " Funkcjonalność systemów ERP dotyczy",
        "a": "\n\n\tSystem ERP (Enterprise Resource Planning) - to informatyczny system wspomagania zarządzanie zasobami przedsiębiorstwa.\nFunkcjonalność systemów ERP dotyczy zasobów przedsiębiorstwa.\nCelem jest zapewnienie integracji wszystkich działów w firmie.\n\n"
    },
    {
        "nr": 197,
        "q": " Podstawowa funkcjonalność systemów obiegu dokumentów dotyczy",
        "a": "\n\nułatwienie komunikacji pomiędzy działami przedsiębiorstwa\n\t\n"
    },
    {
        "nr": 198,
        "q": " Celem nadrzędnym narzędzi Business Intelligence jest",
        "a": "\n\n\tPrzekształcenie dużych zbiorów danych na informację a informacji na wiedzę, która może być wykorzystana do zwiększenia konkurencyjności przedsiębiorstwa.\n\t\n"
    },
    {
        "nr": 199,
        "q": " Związek pomiędzy użycia z poniższego diagramu oznacza, że",
        "a": "\n\nPrzypadek użycia A jawnie, w miejscu przez siebie określonym, włącza zachowanie przypadku użycia B\nPrzypadek użycia B pod pewnymi warunkami może być rozszerzony przez zachowanie reprezentowane przez przypadek użycia A\nPrzypadek użycia B jawnie, w miejscu przez siebie określonym, włącza zachowanie przypadku użycia A\nPrzypadek użycia A pod pewnymi warunkami może być rozszerzony przez zachowanie reprezentowane przez przypadek użycia B\n\nPrzypadek A zawiera w sobie przypadek B.\n \n"
    },
    {
        "nr": 200,
        "q": " Związek pomiędzy przypadkami użycia z poniższego diagramu oznacza, że",
        "a": "\n\nPrzypadek użycia A jawnie, w miejscu przez siebie określonym, włącza zachowanie przypadku użycia B\nPrzypadek użycia B pod pewnymi warunkami może być rozszerzony przez zachowanie reprezentowane przez przypadek użycia A\nPrzypadek użycia B jawnie, w miejscu przez siebie określonym, włącza zachowanie przypadku użycia A\nPrzypadek użycia A pod pewnymi warunkami może być rozszerzony przez zachowanie reprezentowane przez przypadek użycia B\n\nPrzypadek B jest opcjonalnym rozszerzeniem przypadku A.\n  \n"
    },
    {
        "nr": 201,
        "q": " Związek widoczny na poniższym diagramie przypadków użycia oznacza, że",
        "a": "\n\n\n\n(Uogólnienie) Przypadki B i C dziedziczą wszystko po przypadku A i dodatkowo posiadają własne elementy.\n \n\n\n\n"
    },
    {
        "nr": 202,
        "q": " Związek pomiędzy aktorami na poniższym diagramie przypadków użycia oznacza, że",
        "a": "\n\nAktor Y (potomek)posiada wszystko to co Aktor X (przodek) a dodatkowo jeszcze inne własne elementy\n dziedziczenie\n"
    },
    {
        "nr": 203,
        "q": " Celem rachunkowości finansowej jest",
        "a": " [88]\nDostarczanie informacji o zdarzeniach gospodarczych na zewnątrz podmiotu gospodarczego.\n*dotycząca sprawozdawczości finansowej: tradycyjnego rachunku kosztów, sprawozdania finansowego, ewidencji danych o zdarzeniach gospodarczych\n \n"
    },
    {
        "nr": 204,
        "q": " Podstawy prawne rachunkowości finansowej kształtuje",
        "a": " [89]\n•       Ustawa o rachunkowości z 29 września 1994 roku z póz.zm.\n•       Krajowe Standardy Rachunkowości (KSR)\n•       Międzynarodowe Standardy Rachunkowości (MSR)\n•       Międzynarodowe Standardy Sprawozdawczości Finansowej (MSSF)\n \n"
    },
    {
        "nr": 205,
        "q": " Do zasad rachunkowości zalicza się",
        "a": " [90]\nZasada prawdziwego i wiernego obrazu, na która składają się:\n1.       Zasada memoriałowa- przychody uważa się za osiągnięte a koszty za poniesione w momencie ich wystąpienia, a nie w momencie wpływu lub wydatku pieniężnego\n2.       Zasada współmierności- wynik finansowy przedsiębiorstwa z danego okresu jest następstwem przychodów osiągniętych w tym czasie i niezbędnych do ich osiągnięcia kosztów\n3.       Zasada ostrożnej wyceny- przychody uznaje się tylko gdy są pewne a koszty gdy są możliwe, tak by wynik finansowy w wykazywany w księgach był realny\n4.       Zasada kontynuacji działalności- jednostka bd kontynuowała w dającej się przewidzieć przyszłości działalność w niezmniejszonym istotnie zakresie\n5.       Zasada istotności- jednostka może w ramach przyjętych zasad rachunkowości stosować uproszczenia, które nie zniekształcają info. Prezentowanych w sprawozdaniu finansowym\n6.       Zasada przewagi treści nad formą- zagadnienia ujmuje się w księgach rachunkowych i wykazuje w sprawozdaniu finansowym zgodnie z ich treścią i rzeczywistością gospodarczą nawet jeśli nie powinny się tam znaleźć z formalnego punktu widzenia\n7.       Zasada zakazu kompensat-  wartości poszczególnych składników aktywów i pasywów, przychodów i związanych z nimi kosztów ustala się oddzielnie\n8.       Zasada ciągłości- przyjęte zasady rachunkowości należy stosować w sposób ciągły\n \n"
    },
    {
        "nr": 206,
        "q": " Płynność to zdolność do terminowego regulowania",
        "a": " [91]\nZdolność firmy do bieżącego regulowania zobowiązań krótkoterminowych.\n \n"
    },
    {
        "nr": 207,
        "q": " Podstawowe sprawozdanie finansowe składa się z",
        "a": "\n•       bilansu\n•        rachunku zysków i strat\n•        informacji dodatkowej\n \n"
    },
    {
        "nr": 208,
        "q": " Spółka zwiększa kapitał obcy poprzez",
        "a": " [92]\nŹródła zewnętrzne:\n·   \tZaciąganie pożyczek, kredytów\n·   \tWpływy z emisji papierów dłużnych (obligacji)\n·   \tLeasing finansowy\n \n"
    },
    {
        "nr": 209,
        "q": " Najważniejszym celem NBP jest",
        "a": "[93]\nPodstawowym celem działalności NBP jest utrzymanie stabilnego poziomu cen, przy jednoczesnym wspieraniu polityki gospodarczej Rządu, o ile nie ogranicza to podstawowego celu NBP.\n \n"
    },
    {
        "nr": 210,
        "q": " Której z wymienionych funkcji nie pełni NBP",
        "a": " [94]\n\nNBP pełni trzy podstawowe funkcje: banku emisyjnego, banku banków oraz centralnego banku państwa.\n\nNie wiadomo co bd wymienione XDD\nDo zadań NBP należy:\n1)  organizowanie rozliczeń pieniężnych;\n2) prowadzenie gospodarki rezerwami dewizowymi;\n3) prowadzenie działalności dewizowej w granicach określonych ustawami;\n4) prowadzenie bankowej obsługi budżetu państwa;\n5) regulowanie płynności banków oraz ich refinansowanie;\n6) kształtowanie warunków niezbędnych dla rozwoju systemu bankowego;\n6a) działanie na rzecz stabilności systemu finansowego w zakresie instytucji finansowej w rozumieniu art. 4 pkt 4 ustawy z dnia 5 sierpnia 2015 r. o nadzorze makroostrożnościowym nad systemem finansowym i zarządzaniu kryzysowym w systemie finansowym (Dz. U. poz. 1513);\n6b) działanie na rzecz wyeliminowania lub ograniczania ryzyka systemowego, o którym mowa w art. 4 pkt 15 ustawy z dnia 5 sierpnia 2015 r. o nadzorze makroostrożnościowym nad systemem finansowym i zarządzaniu kryzysowym w systemie finansowym;\n7) opracowywanie statystyki pieniężnej i bankowej, bilansu płatniczego oraz międzynarodowej pozycji inwestycyjnej;\n8) wykonywanie innych zadań określonych ustawami.\n \n"
    },
    {
        "nr": 211,
        "q": " Polityka restrykcyjna banku centralnego polega na",
        "a": "[95]\nObniżeniu stopy lombardowej i dyskontowej\nKupnie papierów wartościowych w ramach polityki otwartego rynku\nPodwyższeniu stopy lombardowej i dyskontowej\nObniżeniu stopy rezerwy obowiązkowej\nZmniejszaniu podaży pieniądza, spadku popytu, wzrostu bezrobocia i zahamowaniu inflacji poprzez sprzedaż papierów wartościowych na otwartym rynku, podwyższanie stóp procentowych, podwyższaniu wskaźnika rezerw obowiązkowych, sprzedaż lub emisję papierów wartościowych– jest to polityka antyinflacyjna w celu zachowania stabilności cen.\n \n "
    },
    {
        "nr": 212,
        "q": " Hipoteza Fishera mówi, że wzrostowi inflacji o 1% towarzyszy wzrost nominalnej stopy procentowej",
        "a": "                                                                                         \t\nTakże o 1%\n\n"
    },
    {
        "nr": 213,
        "q": " W systemie zmiennego kursu walutowego wzmocnienie kursu danej waluty nazywamy",
        "a": "[96]\nAprecjacja\n \n"
    },
    {
        "nr": 214,
        "q": " W systemie stałego kursu walutowego osłabienie kursu danej waluty przez rząd nazywamy",
        "a": " [97]\nDewaluacja\n\n"
    },
    {
        "nr": 215,
        "q": " Przepisy regulujące podejmowanie działalności gospodarczej przez przedsiębiorcę będącego osobą fizyczną znajdują się w",
        "a": " [85]\nPodstawowym źródłem prawa w zakresie działalności gospodarczej prowadzonej przez osoby fizyczne jest Ustawa z dnia 6 marca 2018 r. Prawo przedsiębiorców\n ! Ustawa zastąpiła w dniu 30 kwietnia 2018 roku długo obowiązującą ustawę z dnia 2 lipca  2004 r. o swobodzie działalności gospodarczej. \n\n"
    },
    {
        "nr": 216,
        "q": " Naczelna podstawa prawna wolności działalności gospodarczej zawarta jest w",
        "a": "\nKonstytucji RP\nArt. 20. Społeczna gospodarka rynkowa oparta na wolności działalności gospodarczej, własności prywatnej oraz solidarności, dialogu i współpracy partnerów społecznych stanowi podstawę ustroju gospodarczego Rzeczypospolitej Polskiej. \nArt. 22. Ograniczenie wolności działalności gospodarczej jest dopuszczalne tylko w drodze ustawy i tylko ze względu na ważny interes publiczny.\n"
    },
    {
        "nr": 217,
        "q": " Przepisy nakładające obowiązek zapłaty odsetek za opóźnienie świadczenia pieniężnego znajdują się w",
        "a": " [86]\nKodeksie cywilnym\nArt. 481. § 1. Jeżeli dłużnik opóźnia się ze spełnieniem świadczenia pieniężnego, wierzyciel może żądać odsetek za czas opóźnienia, chociażby nie poniósł żadnej szkody i chociażby opóźnienie było następstwem okoliczności, za które dłużnik odpowiedzialności nie ponosi\n \n"
    },
    {
        "nr": 218,
        "q": " Jednostka organizacyjna uzyskuje osobowość prawną z chwilą",
        "a": "[87] \nartykuł 37 KC\n.. jej wpisu do właściwego rejestru, chyba że przepisy szczególne stanowią inaczej.\n \n"
    },
    {
        "nr": 219,
        "q": " Powstanie, ustrój i ustanie osób prawnych określa (określa/ją)",
        "a": " \nnp Kodeks Spółek Handlowych\n(Powstanie, ustrój i ustanie osób prawnych określają właściwe przepisy; w wypadkach i w zakresie w przepisach tych przewidzianych organizację i sposób działania osoby prawnej reguluje także jej statut. Art. 35 KC)\n \n"
    },
    {
        "nr": 220,
        "q": " Zasadnicze przepisy dotyczące zawiązania spółki cywilnej znajdują się w",
        "a": "\nKodeksie cywilnym (art. 860-875)\n"
    },
    {
        "nr": 221,
        "q": " Zasadnicze przepisy dotyczące funkcjonowania spółek handlowych znajdują się w",
        "a": "\nKodeksie spółek handlowych\n \n"
    },
    {
        "nr": 222,
        "q": " Umowa spółki jawnej powinna zawierać",
        "a": "  \n(art. 25 kodeksu spółek handlowych)\nUmowa spółki jawnej powinna zawierać:\n1.       firmę i siedzibę spółki;\n2.       określenie wkładów wnoszonych przez każdego wspólnika i ich wartość;\n3.       przedmiot działalności spółki;\n4.       czas trwania spółki, jeżeli jest oznaczony.\n\n"
    },
    {
        "nr": 223,
        "q": " Spółka z ograniczoną odpowiedzialnością może być utworzona przez",
        "a": "\nArt. 151. KSH\n§ 1.Spółka z ograniczoną odpowiedzialnością może być utworzona przez jedną albo więcej osób w każdym celu prawnie dopuszczalnym, chyba że ustawa stanowi inaczej.\n§ 2.Spółka z ograniczoną odpowiedzialnością nie może być zawiązana wyłącznie przez inną jednoosobową spółkę z ograniczoną odpowiedzialnością.\n \n"
    },
    {
        "nr": 224,
        "q": " Do powstania spółki akcyjnej wymaga się",
        "a": " (Art. 306 KSH)\nDo powstania spółki akcyjnej wymaga się:\n1) zawiązania spółki , w tym podpisania statutu przez założycieli;\n2) wniesienia przez akcjonariuszy wkładów na pokrycie całego kapitału zakładowego, z uwzględnieniem art. 309 zasady obejmowania i pokrycia akcji spółki akcyjnej § 3 i § 4;\n3) ustanowienia zarządu i rady nadzorczej;\n4) wpisu do rejestru.\n\n"
    },
    {
        "nr": 225,
        "q": " Jaka jest forma umowy o przeniesieniu patentu?",
        "a": " [69]\nPisemna. Art.67 Prawo własności przemysłowej\n2. Umowa o przeniesienie patentu wymaga, pod rygorem nieważności, zachowania formy pisemnej. \n\n"
    },
    {
        "nr": 226,
        "q": " Jakie są kryteria zdolności patentowej?",
        "a": " [70]\n•    nowość,\n•    nieoczywistość (poziom wynalazczy),\n•    charakter techniczny (przemysłowa stosowalność)\n\n\n"
    },
    {
        "nr": 227,
        "q": " Co jest przedmiotem ochrony prawno autorskiej? [71]\nPrzedmiotem prawa autorskiego są",
        "a": "\n-utwory ( w szczególności: wyrażone słowem, symbolami matematycznymi, znakami graficznymi (literackie, publicystyczne, naukowe, kartograficzne oraz programy komputerowe); plastyczne; fotograficzne; lutnicze; wzornictwa przemysłowego; architektoniczne, architektoniczno-urbanistyczne i urbanistyczne; muzyczne i słowno-muzyczne; sceniczne, sceniczno-muzyczne, choreograficzne i pantomimiczne; audiowizualne (w tym filmowe).\n-opracowania utworów (w szczególności tłumaczenie, przeróbka, adaptacja)\n-bazy danych, zbiory, antologie,wybory\nUstawa z dnia 4 lutego 1994 r. o prawie autorskim i prawach pokrewnych:\nArt. 1. 1. Przedmiotem prawa autorskiego jest każdy przejaw działalności twórczej o indywidualnym charakterze, ustalony w jakiejkolwiek postaci, niezależnie od wartości, przeznaczenia i sposobu wyrażenia (utwór)\nArt. 2. 1. Opracowanie cudzego utworu, w szczególności tłumaczenie, przeróbka, adaptacja, jest przedmiotem prawa autorskiego bez uszczerbku dla prawa do utworu pierwotnego\nArt. 3. Zbiory, antologie, wybory, bazy danych spełniające cechy utworu są przedmiotem prawa autorskiego, nawet jeżeli zawierają niechronione materiały, o ile przyjęty w nich dobór, układ lub zestawienie ma twórczy charakter, bez uszczerbku dla praw do wykorzystanych utworów\n\n"
    },
    {
        "nr": 228,
        "q": " Jakie są zasady rozporządzania i korzystania z opracowania przez jego twórcę?[228]",
        "a": "\nRozporządzanie i korzystanie z opracowania zależy od zezwolenia twórcy utworu pierwotnego (prawo zależne), chyba że autorskie prawa majątkowe do utworu pierwotnego wygasły. W przypadku baz danych spełniających cechy utworu zezwolenie twórcy jest konieczne także na sporządzenie opracowania. ( Art 2.2. ustawy o prawie autorskim i prawach pokrewnych)\n\n"
    },
    {
        "nr": 229,
        "q": " Co to jest utwór rozpowszechniony?",
        "a": " [72]\n„Utworem rozpowszechnionym jest utwór, który za zezwoleniem twórcy został w jakikolwiek sposób udostępniony publicznie.” (Art 6 u.p.a.p.p.)\n\n"
    },
    {
        "nr": 230,
        "q": " Metodą ochrony programów komputerowych jest",
        "a": "[115]\nOchrona programu komputerowego wynika z umowy między wykonawca i zamawiającym\nProgramy komputerowe podlegają ochronie patentowej\nProgramy komputerowe podlegają ochronie wyłącznie, jeżeli stanowią tajemnicę przedsiębiorstwa\nProgramy komputerowe podlegają ochronie jako utwory literackie\n(„1. Programy komputerowe podlegają ochronie jak utwory literackie, o ile przepisy niniejszego rozdziału nie stanowią inaczej.\n2. Ochrona przyznana programowi komputerowemu obejmuje wszystkie formy jego wyrażenia. Idee i zasady będące podstawą jakiegokolwiek elementu programu komputerowego, w tym podstawą łączy, nie podlegają ochronie.”)\n\n"
    },
    {
        "nr": 231,
        "q": " Jakie są przesłanki dozwolonego użytku prywatnego?",
        "a": " [73]\n„Zakres własnego użytku osobistego obejmuje korzystanie z pojedynczych egzemplarzy utworów przez krąg osób pozostających w związku osobistym, w szczególności pokrewieństwa, powinowactwa lub stosunku towarzyskiego.”\n\n"
    },
    {
        "nr": 232,
        "q": " Kiedy przysługuje nam prawo cytatu?",
        "a": " [74]\n„Wolno przytaczać w utworach stanowiących samoistną całość urywki rozpowszechnionych utworów oraz rozpowszechnione utwory plastyczne, utwory fotograficzne lub drobne utwory w całości, w zakresie uzasadnionym celami cytatu, takimi jak wyjaśnianie, polemika, analiza krytyczna lub naukowa, nauczanie lub prawami gatunku twórczości.”\nCzyli zawsze gdy utwór był rozpowszechniony i gdy cel cytowania jest uzasadniony.\n\n"
    },
    {
        "nr": 233,
        "q": " Badanie coroczne sprawozdań finansowych jest obligatoryjne dla",
        "a": " [60]\nBanki, zakłady ubezpieczeń\nSpółdzielcze Kasy Oszczędnościowo-Kredytowe\nJednostki działające na podstawie przepisów o obrocie papierami wartościowymi oraz o funduszach inwestycyjnych\nJednostki działające na podstawie przepisów o organizacji i funkcjonowaniu funduszy emerytalnych,\nSpółki akcyjne\nPozostałe jednostki, jeżeli spełniły co najmniej dwa z trzech warunków:\nŚrednioroczne zatrudnienie w przeliczeniu na pełny etat wyniosło co najmniej 50 osób\nSuma aktywów bilansu na koniec roku obrotowego stanowiła równowartość w walucie polskiej co najmniej 2.500.000 euro\nPrzychody netto ze sprzedaży produktów i towarów oraz operacji finansowych za rok obrotowy stanowiły równowartość w walucie polskiej co najmniej 5.000.000 euro\n"
    },
    {
        "nr": 234,
        "q": " Do metod inwentaryzacji należą",
        "a": "[61]\nSpis z natury\nUzgodnienie\nWeryfikacja\n"
    },
    {
        "nr": 235,
        "q": " Środek trwały przyjmuje się do ewidencji według",
        "a": " [105]\n“Za wartość początkową środków trwałych w razie odpłatnego nabycia uważa się cenę ich nabycia. “\n"
    },
    {
        "nr": 236,
        "q": " Do jakiego układu ewidencyjnego kosztów należy konto „Podatki i opłaty”",
        "a": "[62]\nDo układu rodzajowego.\n"
    },
    {
        "nr": 237,
        "q": " Koszty własnej kotłowni w firmie ewidencjonowane są w układzie funkcjonalnym jako",
        "a": " [63]\nKoszty działalności pomocniczej.\n"
    },
    {
        "nr": 238,
        "q": " Rachunek przepływów pieniężnych może zostać przygotowany metodą",
        "a": "[64]\nBezpośrednią i porównawczą\nKalkulacyjną\nBezpośrednią i pośrednią\nŻadna z powyższych odp.\n\n"
    },
    {
        "nr": 239,
        "q": " W którym wariancie ustalania wyniku finansowego dokonuje się korekty przychodów ze sprzedaży +/- zmiana stanu produktów?",
        "a": "[65]\nW wariancie porównawczym.\n"
    },
    {
        "nr": 240,
        "q": " Miarą ryzyka systematycznego jest współczynnik beta (β), który określa siłę reakcji stopy zwrotu spółki na zmianę stopy zwrotu indeksu giełdowego. Jeżeli wartość współczynnika jest w przedziale 0<β<1, to",
        "a": "[66]\nStopa zwrotu z akcji spółki jest w małym stopniu podatna na zmiany zachodzące na rynku. Akcje takiej spółki nazywa się defensywnymi.\n\n\n"
    },
    {
        "nr": 241,
        "q": " Co jest korektą na wyniku finansowym w metodzie pośredniej rachunku przepływu pieniężnego?",
        "a": "[67]\n·        Amortyzacja\n·        Zyski (straty) z tytułu różnic kursowych\n·        Odsetki i udziały w zyskach (dywidendy)\n·        Zysk (strata) z działalności inwestycyjnej\n·        Zmiana stanu rezerw\n·        Zmiana stanu zapasów\n·        Zmiana stanu należności\n·        Zmiana l  ,,  zobowiązań krótkoterminowych, z wyjątkiem pożyczek i kredytów\n·        Zmiana stanu rozliczeń międzyokresowych\n\n"
    },
    {
        "nr": 242,
        "q": " W modelu zdyskontowanych przepływów koszt kapitału własnego szacuje się",
        "a": "[102][103]\n gdzie:\nDu - roczna dywidenda wypłacana posiadaczom akcji uprzywilejowanych\nP - bieżąca cena akcji\n"
    },
    {
        "nr": 243,
        "q": " Złożoność obliczeniową wyznacza się na podstawie liczby operacji dominujących w danym algorytmie. Taką operacją dominująca nie będzie",
        "a": " [117][118][119]\nOperacje dominujące, czyli takie, które najczęściej będą wykonywane, np.\n– liczba instrukcji,\n– liczba operacji arytmetycznych,\n– liczba porównań wykonanych w trakcie realizacji algorytmu,\n– liczba wywołań rekurencyjnych procedur\nPo konsultacji z dr inż. Jerzym Dudą domyślamy się, że będzie tutaj algorytm i na tej podstawie wskazuje się operację niedominującą. Operacją dominującą raczej nie będzie wyświetlanie jakiegoś komunikatu (ale to wszystko zależy od algorytmu)\n\n"
    },
    {
        "nr": 244,
        "q": " Złożoność wyznacza się zazwyczaj z dokładnością do rzędu wielkości przy zastosowaniu notacji asymptotycznej. W notacji tej definiuje się że funkcja jest rzędu, jeśli istnieją stałe c1>0 i c2>0 oraz liczba mN takie, że",
        "a": " [75]\n\ndla każdego n>m zachodzi: \n"
    },
    {
        "nr": 245,
        "q": " Dana jest posortowana tablica T zawierająca n różnych elementów. Jaka jest złożoność algorytmu wyszukiwania binarnego elementu x",
        "a": " [79][80][81][82]\nZłożoność obliczeniowa: - w każdym obiegu pętli algorytm redukuje liczbę elementów o połowę\nZłożoność czasowa:  jest ok\nZłożoność pamięciowa: \n\n"
    },
    {
        "nr": 246,
        "q": " Formuła  jest niezmiennikiem instrukcji warunkowej w strukturze, jeżeli",
        "a": "[83]\nFormułajest niezmiennikiem instrukcji (np. instrukcji pętli while(warunek){p}) w strukturze, jeżeli z tego, że formułajest spełniona przed wykonaniem programu P (czyli treści pętli) wynika , że formułajest spełniona po wykonaniu programu P w strukturze.\n"
    },
    {
        "nr": 247,
        "q": " Algorytm jest poprawny częściowo, jeśli",
        "a": " [76]\nAlgorytm jest poprawny częściowo jeśli każde wykonanie algorytmu dla określonych danych wejściowych spełniających warunek wejściowy, jeśli dobiegnie do końca to zwróci wynik wymagany jako wyjście spełniający warunek wyjściowy.\nAlbo prościej: Algorytm A jest częściowo poprawny względem danego warunku początkowego (WP) i danego warunku końcowego (WK) wtedy i tylko wtedy, gdy dla dowolnych danych wejściowych spełniających warunek WP, jeżeli algorytm A zatrzymuje się (ale nie ma gwarancji, że się zatrzyma), to dane wyjściowe algorytmu spełniają warunek WK.\n"
    },
    {
        "nr": 248,
        "q": " Która warstwa w architekturze MVC odpowiada za przekazanie danych do prezentacji?",
        "a": " [77]\nWarstwa kontrolera.\n"
    },
    {
        "nr": 249,
        "q": " Przykładem tzw. tłustego klienta internetowego, którego nie należy stosować we współczesnych rozwiązaniach jest",
        "a": " [84]\nAdobe Flash (Action Script) \nApache (d. Adobe) Flex\nJava (aplety, Java FX)\nMicrosoft Silverlight\nW większości przypadków również programy antywirusowe należą do programów określanych jako tłusty klient.\n"
    },
    {
        "nr": 250,
        "q": " Jaki mechanizm odpowiada za mapowanie adresów URL na funkcje kontrolera?",
        "a": "\nRouting\n"
    },
    {
        "nr": 251,
        "q": " Kolekcje generyczne w obiektowych językach programowania to",
        "a": " [78]\nKolekcje generyczne są to kolekcje jednorodne, tzn. zawierające elementy jednego typu.\n"
    },
    {
        "nr": 252,
        "q": " Kolekcja w językach C#/Java pozwalająca na obsługę żądań napływających kolejno do systemu to",
        "a": "\nQueue \n\n"
    },
    {
        "nr": 253,
        "q": " W jaki sposób można zapisać realizację kilku odpowiedzialności przez klasę w programowaniu obiektowym",
        "a": "\nKlasy abstrakcyjne/interfejsy, \nOgólnie to pytanie jest lekko niezrozumiałe, bo odpowiedzialność klasy to pojęcie z projektowania klas i w zasadzie można to realizować na wiele sposobów ale te dwie to takie wskazane\n"
    },
    {
        "nr": 254,
        "q": " Wykonanie różnego kodu dla tej samej nazwy metody w zależności od rodzaju obiektu w programowaniu obiektowym to",
        "a": "\nPrzeciążanie metody (overloading) - wiele metod o tej samej nazwie różniących się argumentami wejściowymi (rozwiazanie nie jest stricte obiektowe ale mozna je stosowac).\nPolimorfizm (który prowadzi do abstrahowania, np. przez klasy abstrakcyjne i interfejsy ) - mamy na przykład różne klasy dla różnych figur geometrycznych (kwadrat koło itd) każda ma metodę Obwod() Wywołujemy na przykłąd kolo.Obwod() \tkwadrat.Obwod() itd\tczyli ta sama nazwa metody ale to zupelnie rozne metody bo są zdefiniowane w różnych klasach. \noverride wg. 3 osob, ale raczej legit\n"
    },
    {
        "nr": 255,
        "q": " Zadaniem maszyny wirtualnej w kodzie zarządzanym jest",
        "a": "\nmaszyna wirtualna kompiluje kod zarządzany do maszynowego (kompilacja JIT - Just in Time) i wykonuje go na maszynie rzeczywistej. Maszyna wirtualna służy separacji aplikacji od sprzętu\n"
    },
    {
        "nr": 256,
        "q": " Przekroczenie indeksu tablicy w języku Java/C# skutkuje",
        "a": "\n wywołaniem wyjątku (exception), jeżeli wyjątek jest obsługiwany program nie kończy działania (nie crashuje)\n"
    },
    {
        "nr": 257,
        "q": " Autentyczność danych jest zachowana, gdy",
        "a": "\npewność co do pochodzenia (autorstwa i treści) danych\nzapewnienie, że tożsamość podmiotu lub zasobu jest taka, jak deklarowana\n\n"
    },
    {
        "nr": 258,
        "q": " Poufność danych jest zachowana, gdy",
        "a": "[627]\ndostęp do informacji jest ograniczony wyłącznie do grona użytkowników do tego upoważnionych, czyli dane pozostają w tajemnicy.\n"
    },
    {
        "nr": 259,
        "q": " Dostępność danych jest zapewniona, gdy",
        "a": "[627]\ndo informacji można uzyskać dostęp w każdych okolicznościach, które są dopuszczone przez politykę bezpieczeństwa informacji, czyli gdy istnieje nieograniczona możliwość korzystania z danych przez osoby do tego upoważnione.\n"
    },
    {
        "nr": 260,
        "q": " Heteroskedastyczność składnika losowego jednorównaniowego liniowego modelu ekonometrycznego dotyczy sytuacji, w której",
        "a": "\nHeteroskedastyczność składnika losowego modelu jest odstępstwem od klasycznych założeń MNK. Oznacza to, że choć składniki losowe są wzajemnie nieskorelowane, to mają różne wariancje. W konsekwencji otrzymujemy estymator parametrów modelu, który pozostaje estymatorem nieobciążonym, liniowym, i zgodnym, ale nie jest estymatorem najefektywniejszym w klasie estymatorów liniowych i nieobciążonych.\n"
    },
    {
        "nr": 261,
        "q": " Analizę istotności współczynnika determinacjiw w jednorównaniowym liniowym modelu ekonometrycznym dokonać można z użyciem",
        "a": "\nTest F Snedecora-Fishera \n"
    },
    {
        "nr": 262,
        "q": " Według założeń Klasycznej Metody Najmniejszych Kwadratów zmiennymi losowymi w jednorównaniowym liniowym modelu ekonometrycznym są",
        "a": "\nZmienne objaśniające są nielosowe a przez to nie są skorelowane ze składnikiem losowym. Ponieważ zmienne ekonomiczne są losowe (więc dopuszcza się losowość zmiennych, ale muszą one być nieskorelowane ze składnikiem losowym,\nZmienne nie mogą być współliniowe\nNiekiedy przyjmuje się założenie, że składniki losowe mają w każdym z okresów rozkład normalny (). Ogólnie składniki losowe to zakłócenia, natomiast zmienna losowa, to funkcja przypisująca zdarzeniom elementarnym liczby.\nCzyli Y jest zmienną losową, czy X, czy chodzi o składnik losowy  ?? ( tu np.  pisze, że Y jest losowy, X nie, ale tu:  pisze, że X jest losowy, wiec?)\n//chyba Y no i składnik losowy, czyli e xd\n\n"
    },
    {
        "nr": 263,
        "q": " Estymując parametry wielorównaniowego modelu ekonometrycznego można posłużyć się Klasyczną Metodą Najmniejszych Kwadratów w sytuacji, gdy jest to model",
        "a": "\nmodel o równaniach łącznie współzależnych - jednoznacznie i niejednoznacznie identyfikowalnych. -> a wtedy nie jest podwójna MNK ? (wykład z ekonoemtrii, str 124)\nWedług tego wykładu (str. 138) gdy model jest prosty ? (macierz B jest diagonalna) lub  gdy jest postać zredukowana (czy wtedy jest pośrednia MNK, str 120?)? (str 117). Z tego wykłady wynika, ze klasyczne MNK można tylko w tej postaci prostej / typu prostego. //mógłby ktoś to sprawdzić, może ktoś znajdzie inne źródła?\nwg tego:   model prosty i rekurencyjny. \nGdy jest to model regresji liniowej? \n\n\n"
    },
    {
        "nr": 264,
        "q": " W modelu ekonometrycznym grupa zmiennych egzogenicznych opisuje zbiorczo interesujące badacza zjawisko. Aby zbadać łączną istotność wpływu wybranej grupy zmiennych na zmienną endogeniczną,należy posłużyć się",
        "a": "\ntestem walda\n()\n"
    },
    {
        "nr": 265,
        "q": " Skutkiem występowania współliniowości zmiennych objaśniających w modelu ekonometrycznym nie jest",
        "a": "\nto ze liczba obserwacji n jest większa od liczby szacowanych parametrów: k zmiennych + 1 wyraz wolny\nNatomiast skutkiem występowania współliniowości jest (wykład z ekonometrii):\nniemożliwy staje się pomiar oddziaływania poszczególnych zmiennych objaśniających,\noceny wariancji estymatorów MNK, związanych ze skorelowanymi zmiennymi, są bardzo duże,\noszacowania parametrów są bardzo wrażliwe na dodanie lub usunięcie z próby niewielkiej liczby obserwacji.\nJednak estymatory MNK dalej są BLUE.\n\n"
    },
    {
        "nr": 266,
        "q": " Niech X będzie zmienną losową o skończonej wartości oczekiwanej EX. Wówczas dla jej wariancji D^2(X)  prawdziwy jest wzór",
        "a": "\n\n"
    },
    {
        "nr": 267,
        "q": " Niech x0 będzie medianą zmiennej losowej X . Wówczas, dla jej dystrybuanty F prawdziwy jest warunek",
        "a": "\n, gdzie ME to mediana (x0)\n\n"
    },
    {
        "nr": 268,
        "q": " Niech X będzie zmienną losową o rozkładzie Poissona z ƛ = 7 . Wtedy",
        "a": "\n\nEX = ƛ = 7\nD^2X = ƛ = 7\n"
    },
    {
        "nr": 269,
        "q": " Niech X będzie zmienną losową o rozkładzie N(0,1) i niech Φ będzie jej dystrybuantą. Wtedy",
        "a": " \n\nEw. jeszcze średnia = 0 i odch. stand.=wariancja=1, czyli jest to rozkład normalny standardowy,  jest to rozkład symetryczny\n"
    },
    {
        "nr": 270,
        "q": " Niech X będzie cechą o rozkładzie normalnym o wartości oczekiwanej m i nieznanym odchyleniu standardowym σ. Wówczas, statystyka służąca do weryfikacji hipotez H0",
        "a": " m=5, H1, ma rozkład \nt-Studenta o n - 1 stopniach swobody, statystyka \n"
    },
    {
        "nr": 271,
        "q": " Niech X będzie cechą o rozkładzie normalnym o wartości oczekiwanej m i znanym odchyleniu standardowym σ. Wówczas, statystyka służąca do weryfikacji hipotez H0",
        "a": " m=5, H1 , ma rozkład:\nN(0,1) , statystyka     \n"
    },
    {
        "nr": 272,
        "q": " Analiza wariancji służy do",
        "a": "  \nbadania wpływu czynników (zmiennych niezależnych) na badaną cechę (zmienna objaśnianą). Celem jest testowanie istotności różnic pomiędzy średnimi. ANOVA bada obserwacje, które zależą od jednego lub wielu działających równocześnie czynników.\n(Wiki) Metoda ta wyjaśnia, z jakim prawdopodobieństwem wyodrębnione czynniki mogą być powodem różnic między obserwowanymi średnimi grupowymi.\n"
    },
    {
        "nr": 273,
        "q": " Odrzucenie hipotezy głównej w ANOVA oznacza, że\n\nśrednie populacje różnią się\nH0",
        "a": " brak różnic między średnimi populacyjnymi\nH1:  średnie populacyjne różnią się\n"
    },
    {
        "nr": 274,
        "q": " Warstwę widoku w typowej aplikacji internetowej w architekturze MVC tworzymy za pomocą",
        "a": "\nhtml, wszystko co jest używane do frontendu\n "
    },
    {
        "nr": 275,
        "q": " Strona HTML5 powinna zaczynać się od deklaracji",
        "a": "\n<!DOCTYPE html>\n"
    },
    {
        "nr": 276,
        "q": " Jaki element pozwotli na import do HTML kodu JavaScript z zewnętrznego pliku",
        "a": "\n<script>\n<script type=\"text/javascript\" src=\"lokalizacja skryptu\">\n</script>\n"
    },
    {
        "nr": 277,
        "q": " W celu zapisania większej ilości informacji wyłącznie po stronie klienta internetowego należy wykorzystać ",
        "a": "\nweb storage, ewentualnie cookies, internal storage\n"
    },
    {
        "nr": 278,
        "q": " Co to jest preprocesor? ",
        "a": "\nMechanizm/program komputerowy, który przetwarza tekst (kod) źródłowy programu przed jego kompilacją, w sposób określony przez programistę za pomocą dyrektyw preprocesora na kod wyjściowy.  Tak przetworzony kod źródłowy poddawany jest następnie analizie składniowej, kompilacji, a w końcu konsolidacji. Preprocesor jest najczęściej zintegrowany z kompilatorem języka programowania.\n"
    },
    {
        "nr": 279,
        "q": " Czym jest unia w języku C?",
        "a": "\nSpecjalny typ danych, który pozwala na przechowywanie różnych typów danych w tym samym obszarze pamięci. \n\n"
    },
    {
        "nr": 280,
        "q": " Jak wygląda zapis binarny liczby zmiennoprzecinkowej podwójnej precyzji w standardzie IEEE 758-1979?",
        "a": "\nstandard 754\n0\t10000101\t10010000000000000000000\nz(1 bit)  cecha(11 bitów)bity ułamkowe mantysy(52 bity)\n\n\n"
    },
    {
        "nr": 281,
        "q": " Graficzny sposób przedstawienia algorytmu to",
        "a": "  \nSchemat blokowy\n\n"
    },
    {
        "nr": 282,
        "q": " Obiekty w GUI w środowiskach obiektowych komunikują się na zasadzie wzorca",
        "a": "\nprojektowe, obserwatora\nEvent Sourcing\n"
    },
    {
        "nr": 283,
        "q": " Typ obiektu agregującego dowolną liczbę obiektów to",
        "a": "\nkolekcja (ew. w c # to jest collections generics)\n"
    },
    {
        "nr": 284,
        "q": " Klasę lub metodę, która nie będzie już dalej rozszerzana, oznaczamy w C# jako",
        "a": "\nsealed\n"
    },
    {
        "nr": 285,
        "q": " Co oznacza ostatnia litera C w metodyce projektowania klas za pomocą diagramów CRC?",
        "a": "\nClass Responsibility Collaboration (collaboration- interakcja obiektu z innymi klasami)\n"
    },
    {
        "nr": 286,
        "q": " Jeśli po wysłaniu komunikatu nadawca wstrzymuje przetwarzanie do momentu aż odbiorca obsłuży komunikat, wówczas mówimy, że komunikat jest",
        "a": " \nsynchroniczny\n"
    },
    {
        "nr": 287,
        "q": " Jeśli po wysłaniu komunikatu nadawca kontynuuje przetwarzanie, nie czekając aż odbiorca obsłuży komunikat, wówczas mówimy, że komunikat jest",
        "a": "\nasynchroniczny\n"
    },
    {
        "nr": 288,
        "q": " Na podanym diagramie BPMN występują bramki typu",
        "a": " \n\n\n\n\n\n\n\n\n\n\nRównoległe \nOR\nXOR\nzłożone\n\n"
    },
    {
        "nr": 289,
        "q": " Mechanizm porozumiewania się w BPMN oparty na komunikatach pozwala na",
        "a": " \nprzesyłanie informacji pomiędzy uczestnikami biznesowymi (pulami). Musi być określony adresat, komunikat może uruchomić co najwyżej  jeden proces oraz nie można przesyłać komunikatów w obrębie tej samej puli. \n"
    },
    {
        "nr": 290,
        "q": " W PRINCE2 miarę dla poszczególnych ryzyk wylicza się jako",
        "a": "\nIloczyn miary prawdopodobieństwa wystąpienia dostrzeganego zagrożenia lub szansy oraz miary wielkości jego/jej wpływu na cele.\n"
    },
    {
        "nr": 291,
        "q": " Cena emisyjna obligacji zerokuponowych jest",
        "a": "\nCena emisyjna jest niższa niż cena nominalna.(Obligacje nie mają oprocentowania)\n"
    },
    {
        "nr": 292,
        "q": " Wzrost przeciętnego poziomu cen w połączeniu z depresją (jako fazą cyklu koniunkturalnego) w gospodarce określamy jako",
        "a": "\nSlumpflacja (występowanie zarówno znaczącej inflacji, jak i spadku produkcji i dochodu narodowego w ujęciu bezwzględnym)\n"
    },
    {
        "nr": 293,
        "q": " Bezrobocie, które pojawia się wtedy, kiedy płaca jest rozmyślnie utrzymywana powyżej poziomu równowagi na rynku pracy (np. w wyniku działalności związków zawodowych czy wprowadzeniu płacy minimalnej) nazywamy",
        "a": "\nTu była odpowiedź naturalne, ale  poprawna to bezrobocie klasyczne.[293]  \n"
    },
    {
        "nr": 294,
        "q": " Jak nazywane są systemy kryptograficzne, które używają dwóch kluczy do  szyfrowania i odczytu?",
        "a": "\nSzyfry Asymetryczne.\n"
    },
    {
        "nr": 295,
        "q": " Prognozowanie za pomocą SSN to",
        "a": "\nsumowaniu iloczynu wag i wejść\nproces uczenia sieci\njedna z najskuteczniejszych metod prognozowania \n"
    },
    {
        "nr": 296,
        "q": " Szkieletowe systemy regułowe oparte są na systemach logicznych",
        "a": "\nsystemach ekspertowych (np. clips, jess, mandarax, drools, sphinx, exsys,...)\n"
    },
    {
        "nr": 297,
        "q": " Jaki mechanizm logiczny stosowany jest do wnioskowania w języku Prolog",
        "a": "\nRachunek predykatowy pierwszego rzędu, jednak ogranicza się tylko do klauzul Horna.\n"
    },
    {
        "nr": 298,
        "q": " Systemy regułowe bazują na wiedzy",
        "a": "\n(Pytanie jest tragicznie sformułowane)\nBazie wiedzy + faktach o przedmiocie\nBazują na wiedzy eksperckiej/specjalistycznej, zapisanej jako zbiór reguł, faktów i ramy\n"
    },
    {
        "nr": 299,
        "q": " Jakie są zasady działania SSN typu MLP (perceptron wielowarstwowy)?",
        "a": " [107]\n\tSztuczna sieć neuronowa typu MLP posiada co najmniej jedną warstwę ukrytą. Neurony (poza warstwą 1wejściową) są obliczane przy użyciu NIEliniowej funkcji aktywacji. Stosuje metodę \n"
    },
    {
        "nr": 300,
        "q": " Uczenie sieci neuronowej polega na",
        "a": "\n\tObliczeniu wag dla każdego połączenia w tej sieci, by przy ich użyciu obliczać wektor wyjściowy na podstawie wektora wejściowego. Uczenie rozpoczyna się od z góry ustalonych wag, które dają niedokładne rezultaty. Niedokładność uwzględnia się w poprawce wartości wag stosując odpowiednią funkcję uczącą. Takie poprawki mają miejsce po każdej iteracji. Uczenie kończy się po określonej liczbie iteracji lub częściej po osiągnięciu określonego dopuszczalnego poziomu błędu wartości obliczonych przez sieć względem empirycznych wartości.\n"
    },
    {
        "nr": 301,
        "q": " Opłata skarbowa jest ewidencjonowana na koncie",
        "a": " [108]\n\t403 - Podatki i opłaty\n\n\n"
    },
    {
        "nr": 302,
        "q": " Zakup maszyny z odroczonym terminem płatności jest ewidencjonowany po stronie",
        "a": " [109][110]\\\n\n\tZależy od konta. W kosztach po stronie aktywów (strona debetowa, lewa).\nA nie tak:  po debecie (strona lewa, Dt) na Środki trwałe, albo po kredycie (prawa, Ct) na Zobowiązania wobec dostawców? \nRaczej po debecie na koncie rzeczowe aktywa trwałe i po kredycie w zobowiązaniach wobec dostawców, tak było w przykładzie na wykładzie zad 1.8. \n"
    },
    {
        "nr": 303,
        "q": " Cykl środków pieniężnych w firmie ABC wynosi 5 dni. Jak należy zinterpretować ten wynik?",
        "a": " [111]\n\tJest to przeciętny czas jaki mija od wydania gotówki (na zakup czegoś) przez dany podmiot do jej powrotu (jako należności). Inaczej cykl konwersji gotówki.\nCKG=Cykl zapasów+Cykl należności-Cykl zobowiązań krótkoterminowych\n\n"
    },
    {
        "nr": 304,
        "q": " W firmie ABC wskaźnik ogólnego zadłużenia jest na poziomie 0,6. Wynik ten oznacza, że",
        "a": "\n\t\n\t60% aktywów jest finansowana z kapitału obcego (blisko pożądanej wartości)\n\n"
    },
    {
        "nr": 305,
        "q": " Formuła φ w rachunku predykatów jest spełniona,jeśli",
        "a": " [113]\nJeżeli jest tautologią rachunku predykatów\nPrzy ustalonym wartościowaniu, jeżeli jest tożsamością przy tym wartościowaniu\nJeżeli istnieje wartościowanie, przy którym φ jest tożsamością\nJeżeli dla każdego wartościowania φ jest spełniona\n?\n\tistnieje interpretacja, dla której formuła jest prawdziwa. (ang. Satisfiability)\n\n"
    },
    {
        "nr": 306,
        "q": " Możliwość zastosowania reguły modus tollens wynika z",
        "a": " [68]\ntego, że formuła odpowiadająca tej regule jest tautologią klasycznego rachunku zdań\nmoże być zastosowana do dowolnych dwóch formuł, z których jedna jest implikacją, a druga - zanegowanym następnikiem tej implikacji. Bo licznik jest prawdziwy.\nWynika z wnioskowania? reguł logicznych? \n"
    },
    {
        "nr": 307,
        "q": " Problem weryfikacji czy formuła jest tautologią w KRP jest",
        "a": "\nFormuła A jest tautologią KRP, gdy jest prawdziwa we wszystkich interpretacjach.\nProblem weryfikacji tautologii jest zatem problemem co-NP i to co-NP-zupełnym (głównie tym).  Def.: Problem co-NP to taki, że jego dopełnienie jest problemem NP ( można je zweryfikować w czasie wielomianowym).\n\n\n"
    },
    {
        "nr": 308,
        "q": " W  jakiej  bazie  można  znaleźć  informacje  dotyczące  znaków  towarowych  wszystkich oficjalnych urzędów ds. znaków towarowych, które uczestniczą w .działaniach na poziomie krajowym, międzynarodowym i unijnym?",
        "a": "\nTMV\nTMclass\nTMview\nDesignview\n\nTMview - EUIPO\nGlobal Brand Database - WIPO\n\n"
    },
    {
        "nr": 309,
        "q": " W  jaki  sposób  można uzyskać  informacje,  czy  wynalazek  lub  produkt  o  określonych atrybutach jest chroniony na terenie RP?",
        "a": "\nz baz danych Urzędu Patentowego,\nz ustawy prawo wł przemysłowej\n\n\n"
    },
    {
        "nr": 310,
        "q": " Czy istnieje, zorganizowana w formie bazy danych, możliwość kontaktu uprawnionych ze służbami celnymi i policją, aby pomóc chronić produkty przed podrabianiem?",
        "a": "\nEnforcement Database. Jest to bezpieczna baza danych, w której właściciele praw własności intelektualnej zamieszczają informacje o produktach oryginalnych i ich podróbkach. Są to dane istotne przede wszystkim dla organów celnych i policji. Dzięki działaniu bazy EDB, instytucje te mogą w łatwy sposób rozpoznać podrobione towary.\n(Andrzej Fus chyba mówił o takowej bazie w analogii do sytuacji z podrobionymi płytami CD. x.x)\nA to nie jest EUIPO XD? zgodnie z Google:\n\n \n tak, baza EDB, Enforcement Database (EDB) – baza danych dotycząca egzekwowania ochrony\nThe Enforcement Database (baza EDB). Jest to bezpieczna baza danych, w której właściciele praw własności intelektualnej zamieszczają informacje o produktach oryginalnych i ich podróbkach. Są to dane istotne przede wszystkim dla organów celnych i policji. Dzięki działaniu bazy EDB, instytucje te mogą w łatwy sposób rozpoznać podrobione towary.\n\n"
    },
    {
        "nr": 311,
        "q": " Na podstawie danych przedstawionych w tabeli, względny udział w rynku analizowanego przedsiębiorstwa wynosi(wartość x w analizie BCG)",
        "a": "\n\nwzględnego udziału w rynku, mierzonego stosunkiem procentowego udziału w rynku badanego przedsiębiorstwa do udziału przedsiębiorstwa o największym udziale w rynku\nwzględny udział w rynku: rok bieżący - 120%\nX = 100*90/75 = 120%\n \ntutaj raczej chodziło o to :\nWzględny udział w rynku - jest to stosunek sprzedaży danej firmy do wielkości sprzedaży jej , (a nie do całości sprzedanego produktu)\n\nto jest na podstawie macierzy BCG a wiec pierwsze odp 120% jest dobra ()\nA według tej stronki przypadkiem obie nie są dobre?....\n\n"
    },
    {
        "nr": 312,
        "q": " Na  podstawie  danych  przedstawionych  w  tabeli,  dynamika  produktu  oferowanego  przez analizowane przedsiębiorstwo wynosi (wartość y w analizie BCG)",
        "a": "\n\n(255-192)/192*100%=     32,8% \n\na nie tak? w poleceniu jest oferowanego przez analizowane przedsiębiorstwo \n(90-65)/65 *100% = 38,4615%\n\n\n"
    },
    {
        "nr": 313,
        "q": " Na podstawie danych przedstawionych w tabeli, produkt analizowanego przedsiębiorstwa w ujęciu analizy BCG jest (dynamika całego sektora wynosi 11%)",
        "a": "\n\nGwiazdą\n\n"
    },
    {
        "nr": 314,
        "q": " Ile wektorów liniowo niezależnych potrzeba do rozpięcia bazy w przestrzeni trójwymiarowej?",
        "a": " [98][99]\n3 - np. (0,0,1), (0, 1, 0), (1, 0, 0) - tzw. baza kanoniczna\nMówi się, że dany zbiór wektorów v1,v2…,vn rozpina przestrzeń liniową, jeżeli wszystkie inne wektory tej przestrzeni można otrzymać w wyniku dodawania i mnożenia przez skalar wektorów tego zbioru.\nDowód w \n"
    },
    {
        "nr": 315,
        "q": " Ile wynosi część rzeczywista liczby zespolonej     ",
        "a": "\n0\n\n"
    },
    {
        "nr": 316,
        "q": " Ile wynosi wyznacznik z macierzy A",
        "a": "\n\n(-1)*2*(-3) + 4*(-2)*0 + 1*0*0 - 0*2*1 - 0*(-2)*(-1) - (-3)*0*4 = 6\nMacierz trójkątna: wyznacznik to iloczyn wartości na  głównej przekątnej\n(-1)*2*(-3) = 6\n\n"
    },
    {
        "nr": 317,
        "q": " Pan Kowalski dokonuje na koniec każdego roku wpłaty w wysokości 1000 przez 5 lat.Obliczyć przyszłą  wartość  renty  na  koniec ostatniego    okresu,  jeżeli  w  banku  obowiązuje oprocentowanie 3% w skali roku. [607]\n5309,13581\nNależy posłużyć się wzorem na wartość przyszłą sumy jednakowych wpłat na końcu kolejnych okresów (tzw. wpłaty z dołu). Wzór przedstawia się następująco",
        "a": "\n\n"
    },
    {
        "nr": 318,
        "q": " Cena emisyjna dwuletnich obligacji zerokuponowych o cenie wykupu 100 zł wynosi 95 zł. Obliczyć rentowność tej inwestycji. [608]\nYTM = 2,6% , 2.598%\nRentowność tej inwestycji jest równa stopie dochodu w terminie do wykupu, czyli YTM (ang. Yield to Maturity). Wzór na YTM dla obligacji zerokuponowych",
        "a": "\n\nCzy rentowność z inwestycji, to nie jest czasami ROI? W takim wypadku byłoby 5,3% https://forsal.pl/finansopedia/finanse/hasla/912604,rentownosc-inwestycji-roi.html\n\n"
    },
    {
        "nr": 319,
        "q": " Kredyt w wysokości 10 tys. spłacany jest w 5 rocznych ratach łącznych w wysokości",
        "a": " A1 =3 tys., A2 =3,3 tys., A3 =2,55 tys., A4 =2,3 tys. (stopa procentowa 10% w stosunku rocznym, kapitalizacja zgodna z dołu). Odsetki Z3 płacone w 3 racie są równe:\n550\n\n\n"
    },
    {
        "nr": 320,
        "q": " Oceniono metodą kapitałową cztery urządzenia dostępne na rynku. Dla stopy procentowej 3% NPV1=200, NPV2=50, NPV3=-10, NPV4=0. Które z tych urządzeń należy kupić?",
        "a": "\nPierwsze urządzenie ( im większe NPV, tym lepiej).\n\n"
    },
    {
        "nr": 321,
        "q": " W celu weryfikacji zestawu hipotez , ,zastosowano statystykę U o rozkładzie N(0,1). Jej wartość obliczona na podstawie 15 danych wynosi 0,3. Na podstawie tych informacji",
        "a": "\nPowinna tu byc teoretycznie statystyka t-Studenta\nDla żadnego dopuszczalnego alfa nie będziemy odrzucać H0 przy U=0,3, bo U=0,3 daje p-wartość = 0,19 dla rozkładu jednostronnego.\n////odrzucamy H0 - a nie tak:\nDla alfa=0,05 -> -u2a = -1,645, czyli mniejsze od 0,3 nie odrzucamy H0 ??\nDla alfa=0,1 -> -u2a=-1,282,czyli mniejsze od 0,3 nie odrzucamy H0 ??\nDla alfa=0,01 -> -u2a = -2,326, czyli mniejsze od 0,3 nie odrzucamy H0 ??\nDla alfa=0,025 -> -u2a = -1,96, czyli mniejsze od 0,3 nie odrzucamy H0 ??\nTylko żeby obliczyć u2a trzeba tablice, to nie wiem jakie mogą być odp na egzaminie….\n\nDo sprawdzenia:\nNależy obliczyć wartość krytyczną dla np alfa = 0,05 wtedy z tablicy rozkładu normalnego odczytać U dla (1- alfa), skonstruować przedział //czemu tu jest t1?\n\n\n\nchyba że w mozliwych odpowiedziach dadzą np podanie średniej albo odchylenia i trzeba bd użyc odpowiedneij statystyki \n\n"
    },
    {
        "nr": 322,
        "q": " Na podstawie 22 pomiarów określono, że średnie stężenie pyłów PM10 w pewnej miejscowości wynosiło 43ug/m3 przy odchyleniu stand. 13 ug/m3 . W celu sprawdzenia czy wartość oczekiwana stężenia pyłów PM10 w tej miejscowości jest istotnie niższa niż 50 ug/m3 należy zweryfikować hipotezy",
        "a": "\n; \n\n"
    },
    {
        "nr": 323,
        "q": " Niech X będzie zmienną losową o rozkładzie N(1,2) . Niech F będzie jej dystrybuantą. Wtedy",
        "a": "\nF(1)=½\n\n\n"
    },
    {
        "nr": 324,
        "q": " Niech będzie zmienną losową o następującym rozkładzie",
        "a": " \n\nWtedy: \nWartość oczekiwana: 0, Wariancja: 3, Odchylenie standardowe: \n\n"
    },
    {
        "nr": 325,
        "q": " Odchylenie od harmonogramu (SV) w metodzie wartości wypracowanej (EVM) liczone jest jako różnica pomiędzy",
        "a": "\nPomiędzy wartością wypracowaną (EV - earned value) a wartością planowaną (PV - planned value).\n\n"
    },
    {
        "nr": 326,
        "q": " Rozwiązaniem całki nieoznaczonej jest",
        "a": "\n+ C  \n"
    },
    {
        "nr": 327,
        "q": " Pole ograniczone funkcjami y=2-x^2 oraz y^3=x^2 wynosi",
        "a": "\nLiczymy to jako całkę oznaczoną (punkty przecięcia) różnicy tych funkcji:\n\nPole wynosi 32/15. wolfram pokazuje wykres y=x^(⅔) jako tylko dla x>=0, więc wtedy powinniśmy chyba liczyć samo P1 jako całość - niby czm ? np. (-1)^(⅔)= ((-1)^2)^(⅓)= 1^(⅓)=1 albo  (-2)^(⅔) = 4^(⅓)= ok. 1,59 itd….Symbolab pokazuje wykres tez dla ujemnych, można sobie zobaczyć dla x^(⅔): \nPoprawne jest : 32/15 \n"
    },
    {
        "nr": 328,
        "q": " jest zbieżny?",
        "a": " ()\njest rozbieżny, szereg harmoniczny\n"
    },
    {
        "nr": 329,
        "q": " Funkcja z=x^2+y^2-xy+x+y w obszarze x<=0 y<=0 x+y<=3 przyjmuje wartość najmniejszą w punkcie",
        "a": "\n()\nŻeby to obliczyć, należy wyznaczyć ekstremum lokalne w powyższym obszarze (w takim trójkącie). Trzeba policzyć pochodną cząstkową po x i po y, z tego zrobić układ równań i przyrównać do 0. Dostaniemy z tego kandydata na ekstremum lokalne (x=-1, y=-1). Takich kandydatów wyznaczyć trzeba też na krawędziach trójkąta. \nPo obliczeniach otrzymujemy odpowiedź: \nFunkcja z przyjmuje najmniejszą wartość w punkcie (x = -1, y = -1).\nAlbo mi się wydaje, albo Pani w przykładzie z yt ma inne ograniczenia, u niej owszem jest trójkąt, u nas (przez inny znak przy 3, mamy y<=3-x, a nie y= -3-x) jest cała III ćwiartka układu współrzędnych. ///(dla takich danych wyszło mi x=3/2, y=3/2, z=5,25 (nie wiem czy sie gdzieś nie pomylilam xd ) wiec odpowiedz sie i tak nie zmienia.\n\n\n\n\n\n"
    },
    {
        "nr": 330,
        "q": " W celu zbadania przebiegu zmienności funkcji jednej zmiennej należy",
        "a": "\nWyznaczyć:\nDziedzinę.\nMiejsca zerowe.\nPunkt przecięcia z osią Oy.\nGranice na krańcach dziedziny.\nAsymptoty.\nPrzedziały monotoniczności.\nEkstrema lokalne.\nprzedziały wypukłości i punkty przegięcia\n"
    },
    {
        "nr": 331,
        "q": " W jaki sposób można wykorzystać rachunek różniczkowy w badaniu zależności pomiędzy dochodem a wydatkami na dane dobro?",
        "a": "\nTu mogą być różne odpowiedzi np.: można zbadać ekstremum, czyli ile maksymalnie przy danych dochodach konsumenci są w stanie wydać na dane dobro.\nDo wyznaczania dochodowej elastyczności popytu, albo do wyznaczania tempa zmian\nKrzywa konsumpcji/obojętności,\n"
    },
    {
        "nr": 332,
        "q": " Pan Kowalski dokonuje na początku każdego roku wpłaty w wysokości 1000 przez 5 lat. Obliczyć przyszłą wartość renty na koniec ostatniego okresu, jeżeli w banku obowiązuje oprocentowanie 3% w skali roku.",
        "a": "\nWpłaca na początku każdego roku, a odsetki doliczane są na koniec każdego okresu (roku), zatem wartość renty po ostatnim okresie wyniesie 5468,41.\n\nA w tym zadaniu mamy FV z góry, a rn/n to r, bo wpłaca tylk oraz w roku i k*t to po prostu liczba rat, bo wpłaca raz w roku\nz\n"
    },
    {
        "nr": 333,
        "q": " Obliczyć cenę trzyletnich obligacji zerokuponowych o stałym oprocentowaniu 6% rocznie i cenie wykupu 10 tys.",
        "a": "\n10000\n11910,16\n8200\n8396,19\n()\n\n"
    },
    {
        "nr": 334,
        "q": " Kredyt w wysokości 10 tys. spłacany jest w 4 rocznych ratach łącznych w wysokości",
        "a": " A1 = 3 tys., A2 = 3,8 tys., A4 = 2,75 tys. (stopa procentowa 10% w stosunku rocznym, kapitalizacja zgodna z dołu). Rata łączna A3 jest równa:\n3000 \n\n"
    },
    {
        "nr": 335,
        "q": " Jaką postać ma portfel budowany metodą Markowitza dla awersji do ryzyka równej zero?",
        "a": " [628]\nPreferencją racjonalnego inwestora jest według Markowitza wybór portfela efektywnego.\n\nA co ta odp. ma do postaci ?... Może chodzi o to, że ten portfel ma postać protfela efektywnego? Myślę, że to autor(ka) miał(a) na myśli.\n\n\n"
    },
    {
        "nr": 336,
        "q": " Przesuwanie zadań na późniejszy termin w harmonogramie projektu związane jest z",
        "a": " [605] Bilansowanie zasobów praktycznie w każdym przypadku związane jest z wydłużeniem harmonogramu, za wyjątkiem sytuacji gdy uwzględnione zostaną zapasy czasu. Bilansowanie zasobów w dalszym horyzoncie czasowym eliminuje zarówno konflikty w harmonogramie jak i przeciążenia z wykorzystaniem zasobów. Efektem ubocznym może być przesunięcie terminu sfinalizowania projektu, co zazwyczaj wiąże się ze wzrostem kosztów.\n"
    },
    {
        "nr": 337,
        "q": " Jakie narzędzie należy zastosować do wyspecyfikowania zadań projektowych, które muszą być zrealizowane w celu osiągnięcia zakładanych celów?",
        "a": " [605]\nStruktura Podziału Prac (SPP, ang. Work Breakdown Structure – WBS) – hierarchiczny opis pracy, którą należy wykonać aby osiągnąć cel projektu\nAlbo po prostu odpowiedź MS Project/\nA nie ścieżka krytyczna, która określa główne zadanie ?\n\n"
    },
    {
        "nr": 338,
        "q": " Które z działań dotyczących zadań na ścieżce krytycznej może nie przynieść skrócenia czasu realizacji projektu?",
        "a": " [606]\nMetody skracania długości ścieżki krytycznej:\n – skracanie czasów zadań występujących na ścieżce \n– usuwanie zadań na ścieżce \n– zrównoleglenie zadań\n"
    },
    {
        "nr": 339,
        "q": " Zasób, dla którego koszt naliczany jest w jednostkach zużycia, niezależnie od długości trwania zadania w MS Project, należy zdefiniować jako",
        "a": "[607]\nMateriały\n\n"
    },
    {
        "nr": 340,
        "q": " Które z czynników (pozacenowych determinant) nie będą miały wpływu na wielkość podaży danego produktu?\n\nNa podaż dobra poza ceną wpływają również inne czynniki, są to m.in.",
        "a": "\nceny czynników produkcji, czyli płace, opłaty za energię, czynsz, ceny urządzeń i surowców, procenty od zaciągniętych kredytów – czyli poziom kosztów produkcji;\ntechnologia, w szczególności technologia wytwarzania dobra;\nliczba producentów na danym rynku;\noczekiwania dotyczące zmian cen na rynku;\nwartość eksportu oraz importu;\nczynniki przypadkowe, np. zmienność pogody;\ninterwencyjna polityka państwa, dotacje, subwencje, warunki prawne.\nPozacenowe determinanty popytu:\n•\tDochód kupujących \n•\tCeny dóbr substytucyjnych i komplementarnych\n•\tLiczba nabywców i ich struktura\n•\tPreferencje nabywców\n•\tOczekiwania co do zmiany cen i dochodów w przyszłości\n•\tSytuacja polityczna i gospodarcza kraju\n"
    },
    {
        "nr": 341,
        "q": " Przedsiębiorstwo rozważa inwestycję, która z prawdopodobieństwem 75% zakończy się zyskiem w wysokości 1 000 000 zł a z prawdopodobieństwem 25% zakończy się stratą 100 000 zł. Ile wynosi wartość oczekiwana tej inwestycji",
        "a": "\n\nEX = 1 000 000*0,75 - 100 000*0,25 = 750 000- 25 000 = 725 000\n"
    },
    {
        "nr": 342,
        "q": " Dla danych",
        "a": " koszt stały = 1000 zł/mies.; jednostkowy koszt zmienny = 2 zł/szt.; cena jednostkowa = 3 zł/szt. Oblicz próg rentowności (inaczej – punkt krytyczny):[621]\n500szt/mies\n1000zł/szt\n1000szt/mies\n200zł\n\n]\n\n"
    },
    {
        "nr": 343,
        "q": " Na podstawie poniższych danych ustal długość ścieżki krytycznej dla opisanego procesu",
        "a": "\n\nDługośc scieżki krytycznej wynosi 10\n\n\n\n"
    },
    {
        "nr": 344,
        "q": " Jeśli bieżąca wielkość produkcji jest wyższa niż punkt krytyczny (próg rentowności), to",
        "a": "\nOsiągany jest dochód\n(dochod to przychód po odjęciu kosztów, jak nie ma odp dochód, to zysk)\n"
    },
    {
        "nr": 345,
        "q": " Młyny i ze zbioru M mają zapas mąki równy z(i), a piekarnie j ze zbioru P maja popyt równy p(j). Niech x(i, j) opisuje wielkość dostaw z młyna i do piekarni j. Jaką postać ma ograniczenie w modelu programowania liniowego mieszanego, które gwarantuje, że popyt wszystkich piekarni zostanie zaspokojony",
        "a": " \nNajprościej to: z(1)+z(2)+z(3) >= p(1)+p(2)+p(3), ale nw czy to nie trzeba z tymi xij jakoś zapisać, tylko w sumie xij to konkretne dostawy….\nmoże tak:\n\n\n\n\n"
    },
    {
        "nr": 346,
        "q": " Pierwsze dopuszczalne rozwiązanie zadania programowania liniowego dane jest tablicą simpleksową",
        "a": " \n\nIle wynosi wartość funkcji celu x0 po wykonaniu następnej iteracji algorytmu simpleks: \nBez iteracji -  funkcja celu: max x0=2x1 + x2\nPo iteracji tablica simplex:\n\n?? Funkcja celu: max x0 = ⅓ x5 + ⅓ x2 +7 \n\n"
    },
    {
        "nr": 347,
        "q": " Przy uprawie pszenicy konieczne jest stosowanie mieszanki kilku nawozów j ze zbioru N. Nawozy te zawierają różne składniki i ze zbioru S. Zawartość procentowa składnika i w nawozie j wynosi z(i, j). Mieszanka musi zawierać co najmniej m(j) składnika j. Niech x(j) oznacza udział nawozu j w mieszance. Jaką postać ma ograniczenie, które zapewnia, że wybrana mieszanka nawozów będzie zawierać co najmniej wymaganą ilość wszystkich składników j",
        "a": "\nPo pierwsze, chyba jest błąd, bo najpierw składniki i, a potem j ? Zakładając, że składnik j to dalej składnik i, myślę że można to zapisać jako:\n - dla każdego składnika i\n(ew. dodać, że suma m(j)=1 /chodzi o to, żeby te ilości składników nie przekroczyły mieszanki, ale nie wiem czy to tak zapisane ?) - \nchyba bardziej suma x(j)=1, czyli suma wszystkich udziałów wszystkich nawozów w mieszance dopełnia się do całości (1)\n\n"
    },
    {
        "nr": 348,
        "q": " Jaka jest postać zadania dualnego dla zadania pierwotnego w postaci",
        "a": " \n\nZadanie dualne:\n\n\n\n\n"
    },
    {
        "nr": 349,
        "q": " Brygadzista musi przydzielić pracowników j = 1,…,5 do stanowisk k = A,…,E. Wydajność pracownika j na stanowisku k wynosi w(j, k). Należy tak przydzielić pracowników do stanowisk by zmaksymalizować łączną wydajność. Niech x(j, k) będzie zmienną przyjmującą wartość 1 gdy pracownik j jest przydzielony do stanowiska k, a 0 w przeciwnym razie. Jaką postać ma ograniczenie, które wymusza, by dokładnie jeden pracownik został przydzielony do stanowiska k",
        "a": " \n\nRADOM JAZDAAAA\ndla każdego k=A,...,E:\nx(j,k)=1\n"
    },
    {
        "nr": 350,
        "q": " Zakupiona w firmie produkcyjnej maszyna dziewiarska wymagająca montażu jest ewidencjonowana jako",
        "a": "\nŚrodki trwałe w budowie\n"
    },
    {
        "nr": 351,
        "q": " Otrzymana dywidenda jest ewidencjonowana w firmie jako",
        "a": "[609]\n W księgach rachunkowych przychody z tytułu dywidendy zalicza się do przychodów finansowych jednostki i ujmuje w księgach w kwocie brutto tej dywidendy na koncie 75-0 \"Przychody finansowe\".\n"
    },
    {
        "nr": 352,
        "q": " Gdzie w przepływach pieniężnych przedstawia się otrzymanie pożyczki dwuletniej?\nW przepływach pieniężnych z działalności finansowej jako pozycja ",
        "a": " Otrzymane kredyty i pożyczki.\nOgólna kategoria: przepływy z działalności finansowej\n "
    },
    {
        "nr": 353,
        "q": " Firma X finansuje się",
        "a": " akcjami zwykłymi, które stanowią 40% ogółu kapitału, których koszt szacuje się na poziomie 12% i kredytem stanowiącym 60% ogółu kapitału, którego stopa nominalna wynosi 14% rocznie. Firma wypracowuje zysk operacyjny i płaci podatek dochodowy 19% . Średni ważony koszt kapitału firmy X przedstawia zapis: \n0,4*12%*(1-0,19)+0,6*14%*(1-0,19)\n0,4*12%+0,6*14%*(1-0,19)\n0,4*12%*(1-0,19)+0,6*14%\n(12%+14%)/2\n\nWACC = E/V * Re + D/V * Rd*(1-Tc)\nWACC = 0,4 * 0,12 + 0,6 * 0,14 * (1 - 0,19) = 11,6 %\nRe - koszt  kapitału własnegw\nRd - koszt długu\nE/V udział kapitałów własnych\nD/V udział długu\n1- Tc -> uwzględniamy przy długu korzyść podatkową\n\n"
    },
    {
        "nr": 354,
        "q": " Przy stałej krańcowej stopie technicznej substytucji czynników wytwórczych izokwantę przedstawia",
        "a": "\nIzokwanta ma kształt prostej o ujemnym nachyleniu\n"
    },
    {
        "nr": 355,
        "q": " Jeżeli spadek ceny o 1% powoduje wzrost wielkości popytu o 2% to popyt jest",
        "a": "\nLiczymy z współczynnika prostej cenowej elastyczności popytu:\nEd = (zmiana popytu na wskutek zmiany ceny/ dotychczasowy popyt) : ( zmiana ceny/dotychczasową cene)\nEd = 0,02 : 0,01 = 2  , Ed > 1 popyt jest cenowo elastyczny.\n"
    },
    {
        "nr": 356,
        "q": " Jeżeli PKB wzrósł nominalnie z 200 do 220 a inflacja wyniosła 10% to realny wzrost PKB wyniósł",
        "a": "\nPKB nominalnie wzrosło o 10%, jednak inflacja wyniosła w tym roku tak samo 10%. Jeśli liczylibyśmy realny PKB to wtedy pomijamy wzrost cen, badamy samą aktywność.\nOdp. Realny wzrost PKB wynosi 0%.\n"
    },
    {
        "nr": 357,
        "q": " Jeżeli PKB realnie wzrósł a nominalnie spadł to",
        "a": "\nWzrosła aktywność gospodarcza dlatego realnie wzrósł ( liczymy PKB w cenach przed spadkiem) , jednak spadły ceny produktów i usług dlatego nominalnie spadł (pomimo wzrostu aktywności).\nWystąpiła deflacja\n"
    },
    {
        "nr": 358,
        "q": " Który typ oprogramowania steruje wykorzystaniem zasobów komputera?",
        "a": "\nOprogramowanie narzędziowe, np System operacyjny\n\n"
    },
    {
        "nr": 359,
        "q": " Jaki model jest podstawą języka Visual Basic for Application?",
        "a": " [359]\nModel obiektowy\n\n"
    },
    {
        "nr": 360,
        "q": " Pasek narzędzi Toolbox w oknie edytora VBA dla Excela pozwala na",
        "a": " [360]\nTworzenie 15 różnych kontrolek takich jak: Label, TextBox, ComboBox, ListBox, Frame, ScrollBar itp.\n\n"
    },
    {
        "nr": 361,
        "q": " Jaki typ komputera jest używany do obsługi wielkich baz danych?",
        "a": "\nmainframe (komputery głównego szeregu)\n\n"
    },
    {
        "nr": 362,
        "q": " Przedsiębiorstwo XYZ, zajmujące się wynajmem samochodów, zatrudnia w swoich punktach obsługi klienta wysoce wykwalifikowany personel. Ten fakt jest, w ujęciu analizy SWOT",
        "a": "  [362]\nMocną stroną\n\n"
    },
    {
        "nr": 363,
        "q": " Przedsiębiorstwo XYZ posiada patenty na najnowocześniejsze rozwiązania technologiczne w swojej branży. Ten fakt jest, w ujęciu analizy SWOT",
        "a": "  [363]\nMocną stroną - dobra odpowiedź\n\n"
    },
    {
        "nr": 364,
        "q": " Według koncepcji analizy pięciu sił konkurencyjnych Portera które ze zjawisk zwiększałoby atrakcyjność analizowanego sektora",
        "a": " [364]\n\nZmniejszenie siły oddziaływania dostawców i możliwości wywierania przez nich presji na przedsiębiorstwa sektora (siła ta jest mierzona przez stopień koncentracji sektora, uzależnienie jakości produktu finalnego od jakości wyrobu dostawcy, niepowtarzalność wyrobu dostawcy, łatwości i koszty zmiany dostawcy, udział dostawcy w tworzeniu zysku producentów w sektorze, możliwości podjęcia przez dostawcę produkcji wyrobu finalnego, ostrości walki konkurencyjnej w sektorze dostawców).\nZmniejszenie siły oddziaływania nabywców i możliwości wywierania przez nich presji na przedsiębiorstwa sektora (siła ta zależy od stopnia koncentracji sektora nabywcy, uzależnienia jakości produktu finalnego od jakości wyrobu dostawcy, niepowtarzalności produktu, dużego udziału dostawcy w tworzeniu zysku nabywcy, łatwości i kosztu zmiany dostawcy, możliwości podjęcia przez nabywcę produkcji wyrobu finalnego, ostrości walki konkurencyjnej w sektorze nabywców).\nZmniejszenie natężenia walki konkurencyjnej wewnątrz sektora (koncentracja sektora, struktura udziałów rynku, liczba konkurentów).\nMniejsza możliwość wejścia nowych konkurentów.\nMniejsza możliwość pojawienia się substytutów. (obecna wielkość sektora, przyszła wielkość sektora i dynamika sprzedaży w poszczególnych latach, obecna i przewidywana rentowność sektora, większe bariery wejścia, szybkość zmian technologii).\n\nSektor atrakcyjny, to taki, w którym konkurencja jest mniejsza, mniejsze jest także zagrożenie ze strony nowo wchodzących konkurentów i produktów substytucyjnych, a dostawcy i nabywcy mają niewielką siłę przetargową, co wpływa na większą potencjalną rentowność sektora. \n\n"
    },
    {
        "nr": 365,
        "q": " Wraz z upływem czasu i zmniejszającą się dynamiką rynku produkt obecnie będący znakiem zapytania stanie się w przyszłości",
        "a": " [365]\n“Psem” (inaczej kulą u nogi). Są to produkty nie przynoszące znaczącej nadwyżki i nie mające perspektyw rozwoju. Należy więc rozważyć możliwość wycofania się z danego sektora rynku, gdyż produkty te pochłaniają zbyt dużo środków finansowych, przynosząc w zamian znikome dochody.\n\n"
    },
    {
        "nr": 366,
        "q": " Ekonometryk pracujący na danych przekrojowych (niezależnych od czasu) na pewno nie zetknie się z problemem",
        "a": " [366]\nNiestacjonarności, autokorelacji\n"
    },
    {
        "nr": 367,
        "q": " Metoda Hellwiga doboru zmiennych objaśniających jako właściwy wybiera podzbiór o",
        "a": " [367]\nNajwiększym integralnym wskaźniku pojemności informacyjnej. Wybierane zmienne objaśniające są silnie skorelowane ze zmienną objaśnianą i słabo skorelowane między sobą.\n\n"
    },
    {
        "nr": 368,
        "q": " Czy zasadna jest estymacja parametrów funkcji produkcji Cobba-Douglasa za pomocą Klasycznej Metody Najmniejszych Kwadratów?",
        "a": " [368]\nTak. Ale dopiero jak to zlogarytmujemy.\n\n"
    },
    {
        "nr": 369,
        "q": " Do estymacji parametrów wielorównaniowego modelu ekonometrycznego o równaniach współzależnych można posłużyć się",
        "a": " [369]\nPośrednią metodą najmniejszych kwadratów (jeśli model jest identyfikowalny) lub Podwójną Metodą Najmniejszych Kwadratów. Obie metody wykorzystują postać zredukowaną modelu.\n\n"
    },
    {
        "nr": 370,
        "q": " Do weryfikacji hipotez zastosowano statystykę U  o rozkładzie N(0,1). Jej wartość obliczona na podstawie 18 danych wynosi -1,8. Wiemy, że dla dystrybuanty ɸ rozkładu N(0,1) mamy",
        "a": " ɸ(1,28)≈0,9, ɸ(1,64)≈0,95, ɸ(1,96)≈0,975 . Wówczas: [370][371][372]\nDla poziomu istotności równego 0,1 -u=-1,28, zatem jest to wartość większa od U ⇒ odrzucamy hipotezę zerową. (bo 1- = 0,9, więc ) (tzn. na 90% wartość m będzie mniejsza od 35).\nDla 0,05: - =-1,64;  U< - ⇒ odrzucamy hipotezę zerową.\nDla: -=-1,96;  U>-\n\n"
    },
    {
        "nr": 371,
        "q": " Do weryfikacji hipotez  zastosowano statystykę U o rozkładzie N(0,1). Jej wartość obliczona na podstawie 45 danych wynosi -1,8. Wiemy, że dla dystrybuanty ɸ rozkładu N(0,1) mamy",
        "a": " ɸ(1,28)≈0,9, ɸ(1,64)≈0,95, ɸ(1,96)≈0,975. Wówczas: [370][371][372]\nDla poziomu istotności równego 0,2, u=1,28, zatem jest to wartość mniejsza od |U| ⇒ odrzucamy hipotezę zerową,  tzn. z prawdopodobieństwem równym 80% wartość m będzie się znacząco różniła od 57. (bo 1-/2 = 0,9, stąd =0,1, czyli )\nDla 0,1:  u=1,64;  |U|>u ⇒ odrzucamy hipotezę zerową.\nDla: u=1,96;  |U|<u\n\n"
    },
    {
        "nr": 372,
        "q": " Do weryfikacji hipotez  zastosowano statystykę U o rozkładzie N(0,1). Jej wartość obliczona na podstawie 76 danych wynosi 1,4. Wiemy, że dla dystrybuanty ɸ rozkładu N(0,1) mamy",
        "a": " ɸ(1,28)≈0,9, ɸ(1,64)≈0,95, ɸ(1,96)≈0,975. Wówczas:  [370][371][372]\nNa poziomie istotności  należy odrzucic hipotezę H0\nNa poziomie istotności  należy odrzucic hipotezę H0\nNa poziomie istotności  nie ma podstaw do odrzucenia hipotezy H0\nNa poziomie istotności  nie ma podstaw do odrzucenia hipotezy H0\n\nDla poziomu istotności równego 0,1 =1,28, zatem jest to wartość mniejsza od U ⇒ odrzucamy hipotezę zerową. (bo tym razem 1- = 0,9 )\nDla 0,05:  =1,64;  U<\nDla: =1,96;  U< ⇒ nie ma podstaw do odrzucenia hipotezy zerowej (tzn. na 97,5% wartość m =123).\n\n\n"
    },
    {
        "nr": 373,
        "q": " Analiza 91 przypadków wypłat odszkodowań komunikacyjnych w pewnej firmie ubezpieczeniowej pokazała, że średnia wartość odszkodowania (w tys. zł) wynosi 11,2 przy odchyleniu stand. 2,5. W celu sprawdzenia, czy wartość oczekiwana wypłat jest istotnie wyższa niż 10 tys. zł należy zweryfikować hipotezy",
        "a": " [372]\n10tys\n10tys\n\n"
    },
    {
        "nr": 374,
        "q": " 40 spośród 135 ankietowanych klientów pewnego banku uznało stosowane w nim prowizje za zbyt wysokie. W celu weryfikacji, że prowizje są zbyt wysokie dla ponad 30% klientów banku należy przeprowadzić test następującego zestawu hipotez",
        "a": " [372]\n0,3\n0,3\n\n"
    },
    {
        "nr": 375,
        "q": " Na podstawie analizy obserwacji 36 dni pracy bankomatu obliczono średnią dzienną wartość wypłat równą 15,7 tys. zł i odchylenie stand. równe 1,8 tys. zł. W celu sprawdzenia przypuszczenia, że odchylenie stand. wartości dziennych wypłat z bankomatu (wyrażonych w tys. zł) jest istotnie mniejsze niż 2 należy zweryfikować następujący zestaw hipotez",
        "a": "\n4   (bo )\n\n\n\n"
    },
    {
        "nr": 376,
        "q": " Definiowanie klasy w Visual Basic for Application polega na",
        "a": "\nPublic Class NazwaKlasy\nEnd Class\n\n"
    },
    {
        "nr": 377,
        "q": " W trybie projektowania tabeli bazy danych programu MS Access można",
        "a": " [377]\nWpisać nazwę pola, wybrać typ danych z listy oraz wpisać opis każdego pola. Można też ustawić właściwości pól (rozmiar pola, formatowanie, maska wprowadzania, wartość domyślna oraz wymagane).\n\n"
    },
    {
        "nr": 378,
        "q": " Czy tablica, w której nie ma żadnego rekordu, zawiera jakąkolwiek informację?",
        "a": "\nNie, ponieważ tablica ma wartość null.\na co z nazwą albo miejscem w pamięci zarezerwowanym na tablicę?\nmowa tu o rekordach, czyli chodzi zapewne o tablice bazy danych, a nie strukture programistyczna, skoro tak to nie wchodzi w gre miejsce zarezerwowane w pamieci\n\ntyp danych, miejsce w pamieci\n\n"
    },
    {
        "nr": 379,
        "q": " Językiem znacznikowym wykorzystywanym do tworzenia dokumentów hipertekstowych WWW jest",
        "a": " [379]\nHTML\nEwentualnie XHTML\n"
    },
    {
        "nr": 380,
        "q": "Która maska jest wykorzystywana do oznaczenia adresów IP klasy B?",
        "a": " [380][380.1]\n 255.255.0.0 \nAle są też maski podsieci:\n255.255.0.0\n255.255.128.0\t\n255.255.192.0\t\n255.255.224.0\t\n255.255.240.0\t\n255.255.248.0\t\n255.255.252.0\t\n255.255.254.0\n255.255.255.0\t\n255.255.255.128\t\n255.255.255.192\t\n255.255.255.224\t\n255.255.255.240\t\n255.255.255.248\t\n255.255.255.252\n"
    },
    {
        "nr": 381,
        "q": " W jakiej tablicy można odczytać nazwę bieżąco wykonywanego skryptu PHP?",
        "a": " [381]\n$_SERVER['PHP_SELF']\n"
    },
    {
        "nr": 382,
        "q": " Informację o nazwie przeglądarki w JavaScript uzyskamy odwołując się do właściwości",
        "a": " [382]\nwindow.navigator.appName \nwindow.navigator.userAgent\n - racja\n"
    },
    {
        "nr": 383,
        "q": " Po zadeklarowaniu w języku JavaScript zmiennej var i=10, zmienna i będzie miała typ",
        "a": " [383 - 386]\nnumber\n"
    },
    {
        "nr": 384,
        "q": " Co zostanie wypisane na standardowe wyjście w wyniku wykonania poniższego kodu",
        "a": " [383 - 386]\nint x[5] = { 1,2,3, };\nint *p = &x[0];\n*++p += 10;\nfor (int i = 0; i < 5; i++) {\nprintf(\"%d \", x[i]);\n}\nOdp.: 1 12 3 0 0\n"
    },
    {
        "nr": 385,
        "q": " Jak należy uzupełnić format w funkcji printf, aby wartości poszczególnych zmiennych zostały wypisane na standardowe wyjście jako",
        "a": " [383 - 386]\nc = A, a = 10, x= 1.23456e+17;\nint a = 10;\ndouble x = 123.456;.\nchar c = 'A';\nprintf(\"c = ..., a = ..., x = ...\\n\", c, a, x);\nOdp.: printf(\"c = %c, a = %d, x = %e \\n\", c, a, x);\n%e- notacja naukowa, wypisuje: c = A, a = 10, x = 1.234560e+02 - ale nie jest to takie same jak w treści pytania!\n"
    },
    {
        "nr": 386,
        "q": " Co zostanie wypisane na standardowe wyjście po wykonaniu następującego kodu?",
        "a": " [383 - 386]\nvoid swap(int, int);\nint main(){\nint x = 10, y = 20;\nswap(x, y);\nprintf(\"x = %d, y = %.0f\\n\", x, y);\n}\nvoid swap(int a, int b)\n{ int c = a; a = b; b = c; }\nOdp.: x = 10, y = 0 // zero bo to bierze pierwsze miejsce po przecinku chyba\n(warning: format ‘%f’ expects argument of type ‘double’, but argumen\nt 3 has type ‘int’)\n\n\n"
    },
    {
        "nr": 387,
        "q": " Jaki  interfejs  implementowany  jest  w  klasie  w  celu  kopiowania  wartości obiektu do nowej instancji?",
        "a": " [387.1][387.2]\nC#: ICloneable;   Java: Cloneable\n"
    },
    {
        "nr": 388,
        "q": " Jaki związek pomiędzy dwiema klasami należy zastosować w klasie, która zarządza kolekcją obiektów drugiej klasy?",
        "a": " [388]\nAgregację\nUżycie\nGeneralizację\nDziedziczenie\n\n"
    },
    {
        "nr": 389,
        "q": " Co się stanie, gdy edytor programistyczny (Visual Studio, Net Beans) oznaczy w którejś linijce kodu warning (ostrzeżenie)?",
        "a": " [389.1][389.2]\nNic / zależy od poziomu błędu\nKompilację przerywa tylko błąd. W przypadku ostrzeżenia nie stanie się nic, ponieważ kompilacja kodu zakończy się powodzeniem (program się skompiluje), chociaż kompilator może wskazać obszary wymagające uwagi lub naruszające niektóre reguły - wtedy wyświetli warning. Można też ustawić, że warning są traktowany jako exception.\n"
    },
    {
        "nr": 390,
        "q": " Wiedzę analityczną można pozyskać z wykorzystaniem",
        "a": " [390]\nnp. sieci neuronowych?, drzew decyzyjnych ?, na podstawie data mining?\nUczenia maszynowego, statystyki, sztucznej inteligencji,\n\n"
    },
    {
        "nr": 391,
        "q": " Do zewnętrznych źródeł pozyskiwania wiedzy należy zaliczyć",
        "a": " [391]\n* wiedza od uczestników rynku: kontakty z udziałowcami, dostawcami, konkurencją, firmami partnerskimi, klientami – badanie potrzeb, elastyczności popytowej i dochodowej, zarządzanie reklamacjami;\n* wiedza ekspertów zewnętrznych;\n* współpraca ze stowarzyszeniami branżowymi, uczelniami, instytutami badawczymi;\n* zakup wiedzy (patenty, oprogramowanie, wzory użytkowe);\n* produkty związane z wiedzą;\n* targi przemysłowe i pokazy handlowe;\n* biura projektowe lub biura konsultantów projektowych;\n* organizacje międzynarodowe;\n* prywatne firmy świadczące usługi w zakresie informacji technicznej, audytu organizacyjnego, itd.;\n* literatura dotycząca patentów, czasopisma techniczne, wydawnictwa o charakterze przeglądów naukowych, periodyki profesjonalne,\n* urzędy patentowe, kancelarie prawno-finansowe;\n* stowarzyszenia handlowe i profesjonalne;\n* pośrednicy i konsultanci w dziedzinach dotyczących technologii, patentów i licencji;\n* wydziały handlowe ambasad;\n* uczelnie wyższe i inne instytucje akademickie;\n* kontakty osobiste;\n* serwisy internetowe informacyjne branżowe i ogólnoinformacyjne;\n* firmy audytorskie, specjalizujące się w reinżynierii procesów, zmianach organizacyjnych\n\n"
    },
    {
        "nr": 392,
        "q": " Pozyskanie wiedzy z danych nie jest realizowane przez",
        "a": " ...[392]\nJest realizowane przez:\nwizualizacje na wykresach\nmetody statystyczne\nsieci neuronowe\nmetody uczenia maszynowego\nmetody ewolucyjne\nlogikę rozmytą\nzbiory przybliżone\n\n"
    },
    {
        "nr": 393,
        "q": " W  jakich  sytuacjach  należy  przeprowadzić  estymację  modelu  ekonometrycznego  z wykorzystaniem metody Cochrane-Orcutt’a",
        "a": " [393]\n„Metoda Cochrane'a -Orcutta (...) jest wersją UMNK (uogólnionej metody najmniejszych kwadratów) a stosowana bywa przy wystąpieniu autokorelacji pierwszego rzędu.”\n"
    },
    {
        "nr": 394,
        "q": " Regresja (metoda) krokowa wsteczna polega na skonstruowaniu modelu zawierającego",
        "a": " [394]\n(końcowo w modelu) tylko te zmienne (predyktory), które istotnie przewidują zmienną zależną.\n(w procesie metody)„wszystkie potencjalne zmienne objaśniające, a następnie na stopniowym eliminowaniu zmiennych tak, aby utrzymać model z najwyższą wartością współczynnika determinacji przy zachowaniu istotności parametrów.”\n\n"
    },
    {
        "nr": 395,
        "q": " Jak należy interpretować związek między zmiennymi x i y w modelu",
        "a": "[395] \nprocentowy przyrost zmiennej x skutkuje wzrostem y o α1 procent\njednostkowy przyrost zmiennej x skutkuje wzrostem y o α1 procent\njednostkowy przyrost zmiennej x skutkuje wzrostem y o α1 jednostek\nprocentowy przyrost zmiennej x skutkuje wzrostem y o α1 jednostek\n\nJeżeli x wzrośnie o 1% to y wzrośnie o a1% ? - > tak by było jakby przy x były ln, a nie zwykły alfa 1\n\n\n\n\n\n\nJest to model wykładniczy, a nie logarytmiczny, więc chyba prędzej tak:\n\n\nCzyli, jeśli X wzrośnie o jedną jednostkę, to Y wzrośnie około e^(alfa1) razy.\nLub jeśli X wzrośnie o jedną jednostkę,zakładając, że beta1=e^(alfa1) to Y wzrośnie około beta1 razy w\nLub najlepiej powiedzieć, że jeśli X wzrośnie o jedną jednostkę, to Y wzrośnie o około  (beta1 - 1)*100 procent (%) albo (e^(alfa1) - 1) *100%. (wg etrapeza)\nA wg drugiego linku: Lub jeśli X wzrośnie o jedną jednostkę, to Y wzrośnie o 100alfa1 % jednostek.\n\n str. 13\n\n(Z zadań zestawu VI ze studiów mamy Y = e ^(a + bX + e) => ln Y = a + bX + e)\n\nJa w notatkach mam dla modelu: ln y= a +bx, że „jeżeli X zmieni się o jednostkę, to y zmieni się o b%”\n\n"
    },
    {
        "nr": 396,
        "q": " Dany jest model",
        "a": " niezależne składniki losowe. Czy parametry tego modelu można szacować Klasyczną Metodą Najmniejszych Kwadratów? [396]\nWszystkie zmienne są z góry ustalone, więc to model wielorównaniowy prosty - można estymować KMNK. (chyba xd)\nNaszym zdaniem nie, bo model jest o strukturze niezintegrowanej.\n\n\n\n"
    },
    {
        "nr": 397,
        "q": " Pan Kowalski dokonuje na początku każdego kwartału wpłaty w wysokości 1000. Obliczyć przyszłą wartość renty po pięciu latach, jeżeli w banku obowiązuje oprocentowanie 4% w skali roku",
        "a": " [397]\n\nA = 1 000 zł\nrn  = 4%\nk = 4\nn = 4\nt = 5\nk*t = 20\nOdp.: FV = 22 239,19 zł\n\nRenta (ang. annuity) jest zdefiniowana jako ciąg płatności dokonywanych w równych odstępach czasu. Płatności, które składają się na rentę, nazywane są ratami.\nPłatna z góry – płatności są dokonywane na początku okresu.\nWartość przyszła renty to suma kolejnych wartości przyszłych stałych płatności (PMT), które\nbędą wypłacane (lub wpłacane) na koniec każdego z n okresów (oprocentowanie potrzebne do obliczania wartości przyszłych równe jest r).\n\n"
    },
    {
        "nr": 398,
        "q": " Bank A ma w swojej ofercie lokatę dwuletnią z kapitalizacją kwartalną złożoną z dołu. Nominalna stopa procentowa 2%. Bank B ma w swojej ofercie lokatę dwuletnią z kapitalizacją kwartalną złożoną z góry. Nominalna stopa dyskontowa 2%. Która oferta jest korzystniejsza?",
        "a": " [398]\nkapitalizacja kwartalna: m = 4; lata: n = 2   => k = n*m = 8\nnominalna stopa proc: jm = 2%    =>  względna stopa proc: jm/m =0,5%\nK0 = 1000 np.\n1) Kapitalizacja złożona z dołu (odsetki dopisywane są do kapitału na końcu okresów)\nKk/m = K0(1 + jm/m)k, gdzie k=0,1,2,3,…\nKk/m = 1000*(1 + 0,5%)8 = 1040.71\n2) Kapitalizacja złożona z góry (odsetki dopisywane są do kapitału na początku okresów)\nKk/m = K0m/m), gdzie k=1,2,3,…\nKk/m = 1000*(1 - 0,5%)-8 = 1040.91\nOdp.: Oferta banku B jest korzystniejsza.\n\n"
    },
    {
        "nr": 399,
        "q": " Nominalna stopa procentowa (oprocentowanie z dołu) jest równa 10%. Równoważna jej stopa dyskontowa (oprocentowanie z góry) jest",
        "a": " [399]\nZależność:  =>  \n\nOdp: d = 9,09%\n\n\n"
    },
    {
        "nr": 400,
        "q": " Jak zmienia się stopa jednorazowej składki netto dla polisy na życie?",
        "a": "\nWzrasta wraz z wiekiem(pytanie jest to stopę a nie składkę)\na nie jest stała, z góry ustalona ? tak wynika z tego:  ale nie wiem czy to na pewno o to chodzi, ktoś coś ?\nAlbo w zależności od wieku ? im ktoś starszy tym wyższa? <zgaduje>\nTa stopa zależy od czasu trwania, czyli ryzyka jej wypłacenia i zmiany wartości pieniądza, czyli inflacji?\n “Wysokość stopy technicznej zależy od roku zawarcia umowy ubezpieczeniowej oraz od typu polisy. Maksymalną stopę techniczną ustala co roku Komisja Nadzoru Finansowego. “\n\n"
    },
    {
        "nr": 401,
        "q": " Oceniono metodą kapitałową pewne urządzenie otrzymując przy stopie procentowej  3% NPV= -1200. Wewnętrzna stopa zwrotu dla urządzenia jest",
        "a": "\nmniejsza od stopy granicznej\nwięc jest wyższa niż stopa procentowa (?) - chyba nie ?\n[]\nIRR to taka stopa dyskontowa, dla której NPV wynosi 0. \nNa podstawie poniższego linku:\n\nWychodzi, że skoro NPV<0 to IRR jest mniejszy niż 3%?\nmniejsza stopa procentowa -> większe NPV -> IRR będzie mniejsze niż 3%\n(wynika to również z faktu, że wyższa stopa dyskonotwa zmienjsza NPV - u nas jest ujemne, więc skoro IRR określa NPV=0, to u nas trzeba je jakby zwiększyć <by doszło do 0>, zatem pożądana stopa dyskontowa powinna wtedy się zmniejszyć <czyli skoro IRR to stopa do NPV=0, to na pewno jest niższa niż ta, dla której NPV jest ujemne> \nA może po prostu stopa jest procentowa jest zbyt wysoka? Gdyby ją zmniejszyć, to NPV by wzrosło, a to dobrze, bo jeśli jest ujemne to inwestycja jest nieopłacalna\n"
    },
    {
        "nr": 402,
        "q": " 17 spośród 70  ankietowanych  przedsiębiorców  uznało  nowe  rozwiązania  podatkowe  za korzystne. W celu weryfikacji przypuszczenia, że nowe przepisy podatkowe za korzystne uznaje  istotnie  mniej  niż ¼  przedsiębiorców  należy  przeprowadzić  test  następującego zestawu hipotez",
        "a": "\n\tH0: p = ¼\nH1: p < ¼ \n"
    },
    {
        "nr": 403,
        "q": " W celu badania istotności korelacji pomiędzy dwoma cechami można zastosować statystykę daną wzorem , która",
        "a": " \nocenia istotność liniowej korelacji Pearsona, ma rozkład t-studenta o (n-2) stopniach swobody, \nH0: korelacja nieistotna (=0),\n H1: korelacja istotna;\n gdy |t|>=talfa to odrzucamy H0\n"
    },
    {
        "nr": 404,
        "q": " Pewna linia lotnicza dokonała analizy liczby przewożonych pasażerów w wybranych 110 lotach.  W  przypadku  27  spośród  nich,  sprzedano  bilety  na  mniej  niż  85%  miejsc  w samolotach.  W  celu weryfikacji, czy na tej podstawie można stwierdzić, że ponad 15% wolnych miejsc jest w istotnie mniej niż 30% lotów należy przeprowadzić test następującego zestawu hipotez",
        "a": "\n\tH0: p = 0,3\nH1: p < 0,3\n"
    },
    {
        "nr": 405,
        "q": " Jaką rolę pełni metoda GET wykorzystywana w protokole http?",
        "a": " \t\nPrzekazywania danych między poszczególnymi odsłonami dokumentów sieciowych\nPolega na umieszczeniu par parametr=wartość w adresie  strony, np. index.php?lang=pl&cat=2&sidebar=yes. Ciąg po znaku zapytania może być wykorzystywany przez skrypty serwerowe do dostosowania generowanego kodu  do preferencji klienta. Najczęściej służy to do podania podstrony serwisu, którą chcemy obejrzeć, wersji językowej lub specjalnej wersji do wydruku. Metoda GET jest też często używana do przekazywania identyfikatora .\nPobiera dane, nie zmieniając ich stanu (standard restful API)\n\n\n"
    },
    {
        "nr": 406,
        "q": " Jakie wartości zostaną wypisane na standardowe wyjście w wyniku wykonania poniższego kodu",
        "a": "\nint a = 1;\na = a++ + ++a;\nprintf(\"%d %d %d\\n\", a, a++, a++);\n4 4 5\n++a - najpierw inkrementacja zmiennej, potem ewaluacja działania\na++ - najpierw ewaluacja działania, potem inkrementacja zmiennej\na = (1++) + (++2) = 4\n*print* a = 4, a++ = 4, a++ = 5\n\n\nJest to niezdefiniowane zachowanie (undefinied behavior) - ale jeśli nie będzie takiej odpowiedzi, to pewnie 6 5 4 \na jak nie ma takiej odp to 6 5 4\n"
    },
    {
        "nr": 407,
        "q": " Jaki znak (znaki) służy do wstawiania komentowania linii lub części linii w kodzie źródłowym zapisanym w języku C?",
        "a": "\n /* */\n\n"
    },
    {
        "nr": 408,
        "q": " Elementem dokumentacji użytkowej nie jest",
        "a": " [116]\nDokumentacja użytkowa zawiera dokumentację dla użytkowników zewnętrznych, użytkowników wewnętrznych oraz administratora merytorycznego (wszystko w postaci “podręcznikow”)\n\ndokumentacja użytkownika to opis programu przeznaczony dla jego użytkownika. Składają się na nią np.  pomocy, ogólne informacje o programie i jego sposobie obsługi.\nTylko czy dokumentacja użytkowa to użytkownika? (zgodnie z tym:  str 3, to chyba to samo) \nByć może będzie wymieniony element dokumentacji technicznej, to wtedy trzeba zaznaczyć jego.\ndokumentacja techniczna jest przeznaczona dla osób, które mogą potrzebować modyfikować program. Zawiera dokładny opis metody działania programu/biblioteki,  w nim zastosowanych, rozmieszczenia i sposobu działania poszczególnych komponentów itp. Ze względu na swoją naturę jest ona przeznaczona dla , a dla zwykłego użytkownika właściwie niezrozumiała.\n\n\n"
    },
    {
        "nr": 409,
        "q": " Odpowiedź sztucznego neuronu #N_0# o aktywacji \"skok jednostkowy\" wynosi",
        "a": "\n\t\n1\nPoprawna odp.: Odpowiedź neuronu Ys = 1, ponieważ sygnał (suma xi*wi wraz z biasem) wynosi 0,5 co jest wartością większą niż 0 (czyli sygnał >0), więc skok jednostkowy przypisuje wyjście równe 1. \n"
    },
    {
        "nr": 410,
        "q": " Z trzech surowców s1, s2 i s3 produkuje się dwie mieszanki M1, M2. Ilość surowców jest ograniczona odpowiednio do 100, 200 i 300 jednostek. Ograniczenia zużycia trzech surowców związanych z produkcją dwóch mieszanek w proporcjach",
        "a": " mieszanka M1 –3:5:1; mieszanka M2 –2:3:2 mają postać:\n\t3/9*M1 + 2/7*M2 <= 100\n5/9*M1 + 3/7*M2 <= 200\nM1* 1/9 + 2/7*M2 <= 300\nJako jednostki zwykłe: \n3M1 + 2M2 <= 100\n5M1 + 3M2 <= 200\nM1+ 2M2 <= 300\nto co wyżej ma sens, zakładając że M1 i M2 to ilości tych mieszanek, a chyba z polecenia to nie wynika tak wprost, chyba najlepiej przyjąć xi jako ilość np w. KG i-tej mieszanki, wtedy:\n3/9*x1+ 2/7*x2 <= 100\n5/9*x1 + 3/7*x2 <= 200\n1/9*x1 + 2/7*x2<= 300\n3/9*x1 +  2/7*x1 <= 100 | \n5/9*x1 + 3/7*x2 <= 200 | \n1/9*x1 + 2/7*x2 <= 300\n\n"
    },
    {
        "nr": 411,
        "q": " W pewnym pierwotnym modelu programowania liniowego wprowadzono zmienne x6 i x7, które są zmiennymi sztucznymi stosowanymi w metodzie dwóch faz algorytmu simpleks. Jaka funkcja kryterialna może być zastosowana do wyznaczenia pierwszego rozwiązania bazowego problemu pierwotnego?",
        "a": "\n\nfunkcja kryterialna, to nie min albo max xD ? // max z0 = -x6 - x7 (max dla x6 i x7 równego 0) jakakolwiek suma, byleby współczynniki były ujemne.\n\n\n "
    },
    {
        "nr": 412,
        "q": " Produkcja 3 wyrobów w liczbie x1, x2, x3 musi się odbywać w proporcji 3",
        "a": "2:5.Jaką postać liniową ma ta zależność:\nx3 = 2,5x2 = (5/3)x1\nx3 - 2,5x2 = 0\nx3 - (5/3)x1 = 0\n\n 3x1 + 2x2 + 5x3 = 1\n//a nie jest czasem tak, że całą lewą stronę trzeba jeszcze podzielić przez x1+x2+x3?..dlaczego :O\nRaczej poprawnie jest tak:\n3/10 x1 + 2/10 x2 + 5/10 x3 = 1\nczyli ew.: 0,3x1+0,2x2+0,5x3=1\nno ale nawet jakby tych wyrobów było 10 wszystkich to znaczy ze:\nx1 musi byc 3, x2 - 2 i x3 - 5. \nZ drugiego wzoru jak sie to podstawi no to nie wychodzi 1. Ale z tego 1 również XD \n0,3 = x1/suma x , 0,2 = x2/ suma x i 0,5 = x3/suma x ??? (to na pewno jest OK, ale czy o to chodzi ? :/ )\nto jaka jest w koncu dobra odpowiedz?? ;c \n"
    },
    {
        "nr": 413,
        "q": " W ramach pewnego projektu trzeba wykonać operacje j oznaczone literami A,...,G.  W  tabeli podane  są  czasy  tych  wykonywania  operacji p(j),  a  także  najwcześniejsze ES(j)   oraz najpóźniejsze LS(J)  czasy ich  rozpoczęcia.Skrócenie  których  operacji  może  skrócić czas wykonywania całego projektu? ",
        "a": "\n \nPytanie raczej odnosi się do ścieżki krytycznej, bo to zadania które się w niej znajdują decydują o czasie trwania projektu, więc również A, E, G -> poprawna odp.\n//chyba również A oraz E, z racji tego że ES i LS mają to samo, więc każde ich skrócenie może skrócić też projo? - dokładnie !\n"
    },
    {
        "nr": 414,
        "q": " Testem stabilności postaci analitycznej modelu ekonometrycznego jest",
        "a": "\nTest Ramseya\n"
    },
    {
        "nr": 415,
        "q": " W teście istotności pojedynczej zmiennej otrzymano p-value = 0.95 . W związku z tym",
        "a": "  \njest niestotne\nnie ma podstaw do odrzucenia hipotezy zerowej o braku istotności zmiennej\nWhen you say p value is 0.95 the area under the curve for a particular value of your sample statistic (the area to the right) under the curve is 95%. Which means the sample statistics is in the right extreme of the distribution.\nmoże chodzi o to: zmienna jest nieistotna statystycznie (pvalue>alpha) … a skąd wiemy jakie jest alfa xD ? nie wiemy, ale może być w odpowiedziach jakieś odniesienie do alfa \nByć może chodzi o to, że pvalue jest >alfa, dla każdego poziomu istotności mniejszego niż 0,95 -> czyli prawie zawsze, bo alfa z reguły jest małe, to z reguły nie ma podstaw do odrzucenia H0 (która mówi o nieistotności), więc przyjmujemy, że badana zmienna X pojedynczo nie wpływa istotnie na Y.\n\n\n"
    },
    {
        "nr": 416,
        "q": " Współczynnik determinacji skorygowany jest stosowany, gdy",
        "a": " \nszacowany model nie posiada wyrazu wolnego \nliczba szacowanych parametrów jest niewiele mniejsza od liczby dostępnych obserwacji\nwśród zmiennych objaśniających znajdują się katalizatory\nbadane związki pomiędzy zmiennymi nie są liniowe\n?\n\nChcemy porównać jakość kilku modeli w których liczba zmiennych objaśniających jest różna, na podstawie ich R^2 ()\nwspółczynnik determinacji r kwadrat w analizie regresji rośnie zawsze gdy dodamy jakiś kolejny predyktor. Nawet gdy ten nie wnosi nic nowego do wyjaśnienia zmienności naszej zmiennej objaśnianej. Dlatego też jeśli w modelu mamy więcej niż 1 predyktor to należy odczytywać wartość skorygowanego r kwadrat.\n\n"
    },
    {
        "nr": 417,
        "q": " Wyestymowano   parametry   modelu. Jeżeli  wartość  zmiennej Xt jednorazowo wzrosła o jednostkę, to w rezultacie w następnym okresie zmienna Yt",
        "a": "\n\t\n\t?Jakiej zmiennej? - Zmiennej Xt, tak jest w poleceniu.\nJeśli objaśniana Yt zmieniła się o jednostkę to w następnym okresie zmieni się o 0.5. A nie o 0,9*0,5=0,45 ? \n\n\n\n"
    },
    {
        "nr": 418,
        "q": " W przypadku testowania hipotez H0",
        "a": "m=m0, H1:m≠m0 obliczona wartość statystyki t daje podstawy do odrzucenia hipotezy głównej na poziomie istotności α. Na tej podstawie testując hipotezy H0:m=m0, H1:m>m0, możemy stwierdzić, że:.\n \njeżeli zakładamy, że statystyka testowa wyszła dodatnia to odrzucamy hipotezę bo jeśli wpadła w obszar krytyczny alfa/2 to tym bardziej wpadnie gdy będzie dla alfy (obszar jednostronny)\nALE jeżeli nie doszukujemy się tam logiki i statystyka moze wyjsc ujemna to moze sie zdazyc sytuacja ze statystyka jest ujemna a nasz obszar krytyczny prawostronny czyli statystyka tam nie wpadnie i nie odrzucamy Ho\n\nTakże odrzucamy hipotezę zerową, na rzecz hipotezy alternatywnej H1: m > m0.\nA nie przypadkiem trzeba dodać że na poziomie istotności alfa/2 ? \nPOWINNO !\nOSTATECZNA ODP Odrzucamy  H0 na poziomie istotnosci alfa/2\nNie można stwierdzić, że odrzuca się hipotezę zerową. W przypadku porównywania czy m jest różne od m0 bierzemy wartość bezwzględną ze statystyki z t. Porównując czy jest większe od m0 bierzemy wartość statystyki t, która może być MNIEJSZA od zera, a wtedy nie odrzucimy H0. //jako pomysłodawcy odp z ½ też mi sie tak teraz wydaje teraz (alfa/2 by miala sens jakbysmy przyjmowali H0, a odrzucamy)\n"
    },
    {
        "nr": 419,
        "q": " Dokonano analizy spalin 61 samochodów pewnej marki i obliczono, że w ich przypadku średnia emisja cząstek stałych wynosi 0,007 g/km, przy odchyleniu stand. równym 0,001 g/km. W celu sprawdzenia czy wartość oczekiwana emisji cząstek stałych w samochodach tej marki istotnie przekracza normę równą 0,005 g/km należy przeprowadzić test następującego zestawu hipotez",
        "a": "\nNależy przeprowadzić test istotności wartości oczekiwanej, który charakteryzuje się brakiem rozkładu normalnego, lecz dużą próbą (większą od 30). Powinniśmy wyróżnić dwie hipotezy:\nH0: m = 0,005 g/km\nH1: m > 0,005 g/km\n"
    },
    {
        "nr": 420,
        "q": " Niech F będzie dystrybuantą zmiennej losowej o rozkładzie N(2,3) . Wtedy",
        "a": "\nY=  (X-2)/3\n"
    },
    {
        "nr": 421,
        "q": " Niech X i Y  będą niezależnymi zmiennymi losowymi takimi, że",
        "a": " D2X=9 i D2Y=4. Wtedy D^2 (X-Y): \nJest mniejsza niż 5\nJest równa 5\nJest równa 13\nJest większa niż 13\nOdp to 9+4=13, ze wzoru D2(X-Y) = D2X + D2Y\n\n"
    },
    {
        "nr": 422,
        "q": " Dla ilości sprzedaży pewnego produktu wyznaczono indeks łańcuchowy. Wartość tego indeksu w roku 2018 wynosiła 1,21. Oznacza to, że",
        "a": "\nSprzedaż w 2018 roku wzrosła o 21% względem roku 2017.\nDef: Indeksy łańcuchowe (o zmiennej podstawie) mówią nam jak zmieniła się wartość zjawiska w danym okresie względem okresu poprzedniego. \n"
    },
    {
        "nr": 423,
        "q": " Dla ilości sprzedaży pewnego produktu wyznaczono indeks o stałej podstawie, jako podstawę przyjmując rok 2016. Wartość tego indeksu w roku 2017 wynosiła 1,21, natomiast w roku 2018 indeks wynosił 0,83. Oznacza to, że",
        "a": "\n\nSprzedaż w roku 2017 wzrosła o 21% względem roku 2016, a w roku 2018 spadła o 17% względem roku 2016.\nDef: Indeksy jednopodstawowe (o ustalonej podstawie) mówią nam jak zmieniła się wartość zjawiska w danym okresie względem okresu podstawowego.\n"
    },
    {
        "nr": 424,
        "q": " Które miary badają nam kształt rozkładu badanej cechy?\nSkośność i kurtoza. ( miary asymetrii i koncetracji)\n\nWspółzależność badanych cech, których wartości podane co najmniej na skali porządkowej\ndowolną monotoniczną zależność między rangami obserwacji w uporządkowanej rosnąco próbie (zmienne na skali nominalnej i mało obserwacji)\nsiłę korelacji(zależności) dwóch cech, w przypadku gdy",
        "a": "\ncechy mają charakter jakościowy, pozwalający na uporządkowanie ze względu na siłę tej cechy,\ncechy mają charakter ilościowy, ale ich liczebność jest niewielka.\n"
    },
    {
        "nr": 425,
        "q": " Brak pytania",
        "a": "\n\nBrak odpowiedzi\n"
    },
    {
        "nr": 426,
        "q": " W wyniku rozwiązania gry o sumie zero gracz A stosując dwie strategie A1 i A2 z częstością odpowiednio p1=14/15 i p2=1/15 osiągnie przeciętny zysk w wysokości v=2180/15. Ile wynosi przegrana gracza B i jak powinien zachować się gracz A w najbliższej grze?",
        "a": "\nprzegrana gracza B wynosi tyle co wygrana gracza A, czyli 2180/15.\nW najbliższej grze gracz A powinien grać strategią A1 z częstością 14/15 i 1/15 A2 (czyli tak jak grał)\n\n "
    },
    {
        "nr": 427,
        "q": " Które ze strategii graczy A i B są zdominowane przez pozostałe w grze o sumie 0, w której macierz wypłat przedstawia się następująco",
        "a": "\n\nPOPRAWNA ODP:\nMacierz wypłat konstruowana jest dla gracza A. Dlatego lepszą sytuacją dla gracza B jest strategia (kolumna) zawierająca mniejsze wartości. \nDla gracza A: strategia A1 jest zdominowana przez strategię A2, Dla gracza B: strategia B2 jest zdominowana przez strategię B1\n"
    },
    {
        "nr": 428,
        "q": " Jak w metodzie PERT szacuje się średni oczekiwany czas trwania czynności (to) i jaką postać przyjmuje wariancja  - miara rozbieżności pomiędzy optymistyczną i pesymistyczną oceną czasu trwania czynności (oznaczenia",
        "a": " a – czas optymistyczny, m – czas modalny, b – czas pesymistyczny): sz\nW celu obliczenia oczekiwanego czasu realizacji zadania wg rozkładu beta w metodzie PERT w wersji klasycznej, posługujemy się wzorem:\nto = (ta+4tm+tb)/6\nWariancję czasu realizacji zadania oblicza się wg poniższego wzoru:\n=((tb-ta)/6)^2\n"
    },
    {
        "nr": 429,
        "q": " Jaki język należy zastosować do zaprojektowania struktury klas?",
        "a": "\nNależy zastosować język UML\n"
    },
    {
        "nr": 430,
        "q": " Brak modyfikatora widoczności dla klasy oznacza, że klasa będzie miała widoczność",
        "a": "\nWedług wykładu 3. z AiPSI widoczność w UML nie posiada wartości domyślnej, ale według jednego z PDFów z wazniak.mimuw.edu.pl „Elementom, których w definicji atrybutu nie podano wartości, przypisywane są wartości domyślne (widoczność prywatna, krotność 1), lub pomija się je”. \n//bez sensu to pytanie, wiem że w poprzednim jest o UML ale to rownie dobrze może chodzić o klasę w C#, i w takim wypadku bedzie to modyfikator “internal” jbc \n"
    },
    {
        "nr": 431,
        "q": " W celu utworzenia dokumentacji XML dla kodu w środowisku Visual Studio należy",
        "a": "\nPodczas tworzenia aplikacji w Visual Studio należy kliknąć prawym przyciskiem na projekt i wybrać Właściwości. W oknie dialogowym właściwości należy wybrać zakładkę Kompilacji i zaznaczyć plik dokumentacji XML.\nhttps://docs.microsoft.com/pl-pl/dotnet/csharp/codedoc\n"
    },
    {
        "nr": 432,
        "q": " W celu przeprowadzenia testów jednostkowych w środowisku .NET należy",
        "a": " \nużyć biblioteki xUnit  <- //można użyć równie dobrze kilku albo i wiecej innych bibliotek, wiec ta odpowiedz nie ma sensu \nNależy użyć środowiska Visual Studio. Otwórz projekt, który chcesz przetestować w programie Visual Studio. W Eksploratorze rozwiązań, należy węzeł rozwiązania. Następnie na pasku menu u góry wybierać Plik > Dodaj > Nowy projekt. Okno dialogowe Nowego projektu zawiera szablony projektów, tym Unit Test Project, który należy wybrać. Należy kliknąć przycisk dalej, należy wybrać nazwę dla projektu testowego i kliknąć przycisk Utwórz. Taki projekt jest dodawany do rozwiązania. W projekcie testu jednostkowego należy dodać odwołanie do projektu, który chcesz przetestować, klikając prawym przyciskiem myszy Odwołania lub Zależności , a następnie wybierając Dodaj odwołanie. Wybierz projekt, który zawiera kod do przetestowania kliknij przycisk OK. Dodaj kod do metody testów jednostkowych w programie Visual Studio.\n\t Aby uruchomić tak przygotowany test jednostkowy otwórz Eksplorator testów, wybierając Test > Windows > Eksplorator testów na pasku menu u góry. Uruchom testy jednostkowe, klikając pozycję Uruchom wszystkie. Po zakończeniu testów, zielony znacznik wskazuje, że test zakończony pomyślnie. Ikona z czerwonym symbolem \"x\" oznacza, że test nie powiódł się.\nNa chuj mam zapamiętywać to wszystko\n"
    },
    {
        "nr": 433,
        "q": " Komentarz klasy lub metody w .NET dla dokumentacji XML umieszczamy po znakach",
        "a": "\nW języku C# robi się to za pomocą znaków /// a w Visual Basic za pomocą znaków ‘’’   .\n\n"
    },
    {
        "nr": 434,
        "q": " Kod, który powinien zostać wykonany niezależnie od tego czy wystąpi wyjątek należy umieścić w sekcji",
        "a": "\nfinally{}\nKod w sekcji „finally” jest wykonywany nawet, gdy występuje wyjątek.\n"
    },
    {
        "nr": 435,
        "q": " Metody testujące kod klas muszą być w środowisku VisualStudio oznaczane przez zastosowanie",
        "a": "\natrybutu [Test]\nJeśli chodzi o same metody to należy je poprzedzić atrybutem:: [TestMethod] \n"
    },
    {
        "nr": 436,
        "q": " Wyrzucanie wyjątków w środowisku VisualStudio musi być testowane poprzez wykorzystanie",
        "a": "\nKonstrukcji Try...catch…\nJeśli chodzi o samo testowanie to:  poprzedzamy testowaną metodę atrybutem [ExptectedException]\nassert.throws \n\n\n\n\n\n\n"
    },
    {
        "nr": 437,
        "q": " W repozytorium kodu źródłowego aplikacji w środowisku .git pomijamy zwykle (.gitignore)",
        "a": "\nKod klas dla testerów jednokodowych\nPliki wykonywalne i tymczasowe\nPliki rzadko używanych klas\nPliki tymczasowe\n?\nimo tymczasowe\nKatalogi zawierające efekt kompilacji projektu (bin, obj etc…), ustawienia szczególne dla konkretnego użytkownika (pliki *.user) czy kod będący efektem pracy jakiegoś generatora (po co trzymać go w repo, skoro każdy może go sobie odtworzyć lokalnie)\nIgnorowane pliki w repozytorium to zazwyczaj pliki pochodzące z kompilacji albo pliki wygenerowane przez komputer, których można się pozbyć ze źródła repozytorium. Kilka typowych przykładów to:\n- Pamięć podręczna zależności (dependency cache), taka jak zawartość\n\tnode_modules albo /packages\n- Skompilowany kod, czyli np. pliki typu .o, .pyc, czy .class\n- Lokalizacje wyników kompilacji (build output directories), takie jak /bin, /out, czy     /target\n- Pliki wygenerowane podczas działania programu, takie jak .log, .lock, albo .tmp\n- Ukryte pliki systemowe, takie jak np. .DS_Store albo Thumbs.db\n- Pliki konfiguracji środowiska (IDE), takie jak .idea/workspace.xml\n\n\n"
    },
    {
        "nr": 438,
        "q": " Nowy kod aplikacji, który dopiero będzie testowany (przygotowanie nowych funkcji) zapisujemy w środowisku .git w",
        "a": "\nRepozytorium (zwykle w osobnej gałęzi(branch) stworzonej specjalnie dla tego kodu)\n"
    },
    {
        "nr": 439,
        "q": " Jakiego algorytmu użyjesz do efektywnego wyszukiwania elementu w liście L zawierającej n elementów?",
        "a": "\nWyszukiwanie sekwencyjne (np. liniowe). Zadanie takie można rozwiązać algorytmem wyszukiwania liniowego (ang. linear search algorithm). Przegląda on kolejne elementy listy, aż napotka poszukiwany element lub koniec listy (w przypadku listy cyklicznej – aż wróci z powrotem do punktu wejścia). Zwraca adres znalezionego elementu lub zero w przypadku nie odnalezienia poszukiwanego elementu.\n"
    },
    {
        "nr": 440,
        "q": " Jakiego algorytmu użyjesz do efektywnego wyszukiwania elementu w posortowanej tablicy T zawierającej n elementów?",
        "a": "\nWyszukiwanie interwałowe (np. binarne). Do takiego zadania można użyć algorytmu wyszukiwania binarnego. Algorytm szuka danego elementu w tablicy uporządkowanej (posortowanej). Złożoność obliczeniowa tego sposobu wyszukiwania jest rzędu O(log). Oznacza to, że metoda jest znacznie szybsza niż algorytm przeszukiwania liniowego. Dla tablicy 1000−elementowej wystarczy wykonać w pesymistycznej sytuacji około log2 1000 ≈ 10 kroków, natomiast w przypadku przeszukiwania liniowego należy wykonać tych kroków 1000. Algorytm jest realizowany metodą \"dziel i zwyciężaj\". Dzieli on tablicę na mniejsze podtablice do momentu wyszukania pozycji (lub nie w przypadku gdy taki element nie istnieje) elementu szukanego.\n"
    },
    {
        "nr": 441,
        "q": " W programowaniu strukturalnym Dijkstra zaproponował użycie tylko trzech rodzajów struktur. Nie należy do nich",
        "a": "\nDijkstra proponował użycie tylko trzech rodzajów struktur sterujących:\nSekwencja (lub konkatenacja) — czyli po prostu wykonanie instrukcji w określonej kolejności. W wielu językach rolę „operatora konkatenacji instrukcji” spełnia niepozorny średnik...\nWybór — czyli wykonanie jednej z kilku instrukcji zależnie od stanu programu. Przykładem jest if-then-else i switch/case.\nIteracja, czyli powtarzanie instrukcji tak długo, jak długo spełniony (lub niespełniony) jest dany warunek. Chodzi oczywiście o pętle, np. while, repeat-until, for itp.\n Więc każdą inną opcję odrzucamy.\nSzczególną uwagę Dijkstra zwracał na odrzucenie struktury typu GoTo, co opisał nawet w liście pt. “Goto statement considered harmful”, więc zapewne o tę strukturę chodziło w tym pytaniu.\n"
    },
    {
        "nr": 442,
        "q": " Heurystyka jest wykorzystywana w celu",
        "a": "\nHeurystyka (gr. heuresis – odnaleźć, odkryć, heureka – znalazłem) – metoda znajdowania rozwiązań, dla której nie ma gwarancji znalezienia rozwiązania optymalnego, a często nawet prawidłowego. Rozwiązań tych używa się np. wtedy, gdy pełny algorytm jest z przyczyn technicznych zbyt kosztowny lub gdy jest nieznany (np. przy przewidywaniu pogody lub przy wykrywaniu niektórych zagrożeń komputerowych, takich jak wirusy lub robaki). Metody używa się też często do znajdowania rozwiązań przybliżonych, na podstawie których później wylicza się ostateczny rezultat pełnym algorytmem. To ostatnie zastosowanie szczególnie dotyczy przypadków, gdy heurystyka jest wykorzystywana do nakierowywania pełnego algorytmu ku optymalnemu rozwiązaniu, aby zmniejszyć czas działania programu w typowym przypadku bez poświęcania jakości rozwiązania\n"
    },
    {
        "nr": 443,
        "q": " Jaki mechanizm należy wykorzystać, projektując dostęp do danych w aplikacji PHP?\nPHP może zostać rozszerzony o mechanizmy dostępu do różnych baz danych",
        "a": "\n• MySQL moduł mysql albo jego nowsza wersja – mysqli (moduł mysqli ma dwa interfejsy: proceduralny i obiektowy)\n• PostgreSQL\n• Oracle\n• MS SQL Server Istnieją również rozszerzenia (biblioteki), zapewniające wspólny interfejs dostępu do baz danych, niezależnie od ich typu. Dla PHP jest to biblioteka PEAR\nAby obsługiwać dostęp do baz danych w aplikacji PHP można użyć abstrakcyjnego rozszerzenia/biblioteki/interfejsu PDO (skrót od PHP Data Object).\n"
    },
    {
        "nr": 444,
        "q": " W jakim pliku w środowisku PHP należy włączyć sterownik określonej bazy danych?",
        "a": "\nW pliku php.ini \n"
    },
    {
        "nr": 445,
        "q": " Jeżeli serwer nie będzie mógł przetworzyć skryptu PHP z powodu błędu, zwrócony zostanie kod statusu HTTP",
        "a": "\n \tW takim przypadku zostanie zwrócony kod 500 (Internal Server Error)\n"
    },
    {
        "nr": 446,
        "q": " Wstępny wygląd stron (położenie elementów) oraz ich hierarchię dla interfejsu klienta internetowego tworzymy, wykorzystując",
        "a": "\n\tWykorzystując budowanie szkieletu strony w HTML (np. div’y), nowe znaczniki (np. header, nav, section,...)\nKtoś coś, to jest ok???\n"
    },
    {
        "nr": 447,
        "q": " Kursor w proceduralnym języku SQL jest",
        "a": "\n\tObszarem roboczym, w którym mieści się wynik zapytania. Udostępnia on podzbiór danych zdefiniowanych przez zapytanie i służy do ich pobierania lub modyfikacji. Kursor jest wskaźnikiem do miejsca w pamięci, gdzie pobrane są dane z zapytania. Rodzaje kursorów: bezpośrednie, pośrednie zmienne kursorowe, podzapytania kursorowe.\nKursor – tymczasowa struktura służąca do pobierania wyniku zapytania . Kursor umożliwia pobieranie  sekwencyjnie, po jednym lub więcej naraz, a także przemieszczanie się po wynikach zapytania.Kursor może być zdefiniowany i działać po stronie , jak i po stronie .\n"
    },
    {
        "nr": 448,
        "q": " Zapis modelu relacyjnego jako modelu obiektowego jest",
        "a": "\n\tMapowaniem modelu relacyjnego na język programowania obiektowego, w którym klasy reprezentują poszczególne encje, a powiązania między klasami są reprezentacją związków z modelu relacyjnego. ??\n\n"
    },
    {
        "nr": 449,
        "q": " W celu pobrania danych z dwóch lub więcej relacji konieczne jest użycie",
        "a": "\n\tKonieczne jest użycie tzw. złączeń reprezentowanych w języku SQL przez polecenia “join”: (INNER) JOIN, LEFT (OUTER) JOIN, RIGHT (OUTER) JOIN, FULL (OUTER) JOIN , UNION\t\n"
    },
    {
        "nr": 450,
        "q": " Warunkiem złączenia teta jest\n\tWystępowanie innego symbolu porównania niż “=”, np",
        "a": " “>”, “BETWEEN”, “!=”.\n"
    },
    {
        "nr": 451,
        "q": " Aby rozróżnić dwie klasy o identycznych nazwach w języku C#, należy wykorzystać",
        "a": "\n\tOperatory dostępu do składowych. Klasy muszą być umieszczone w różnych przestrzeniach nazw (namespace). Gdy chcemy się odwołać do takich klas należy ich typ poprzedzić operatorem dostępu, czyli nazwą przestrzeni nazw w jakiej się znajdują.\n"
    },
    {
        "nr": 452,
        "q": " Co zostanie wypisane po wywołaniu metody Main() w języku C#/Java jeśli",
        "a": " \n\nWypisane zostanie: Klasa A1,Klasa A2,\n"
    },
    {
        "nr": 453,
        "q": " \tZbiór pewnych funkcji (kontrakt), które realizują różne klasy najlepiej zaprojektować w postaci",
        "a": "\nKontrakt klasy projektuje się używając interfejsów.\n"
    },
    {
        "nr": 454,
        "q": "  Co jest wymagane w Visual Studio, aby w projekcie danej aplikacji można było korzystać z innego projektu aplikacji?",
        "a": "\n\tWymagane jest dodanie do projektu danej aplikacji referencji do projektu, z którego chcemy korzystać\n"
    },
    {
        "nr": 455,
        "q": " Którego kodu nie są w stanie wygenerować automatycznie współczesne środowiska programistyczne np. Visual Studio? ",
        "a": "\n\tKod źródłowy, ponieważ on tłumaczony jest przez środowiska programistyczne na kod maszynowy (assembler) oraz kod binarny.\n"
    },
    {
        "nr": 456,
        "q": " Wymagania funkcjonalne, formułowane w trakcie projektowania systemu informatycznego dotyczą",
        "a": "\n\tDotyczą tego, co system będzie robił, jakie funkcje będzie wykonywał, oraz jakie procesy wspierał\n"
    },
    {
        "nr": 457,
        "q": " Wymagania niefunkcjonalne, formułowane w trakcie projektowania systemu informatycznego dotyczą",
        "a": " \n\tDotyczą tego, jakie własności będzie posiadał system oraz jakim ograniczeniom będzie podlegał.\n"
    },
    {
        "nr": 458,
        "q": " Specyfikacja wymagań dla zintegrowanego systemu zarządzania dotyczy systemu przeznaczonego do",
        "a": "\t\t\t\t\nZintegrowanego systemu zarządzania (IMS), który  integruje wszystkie systemy i procesy organizacji w jedną kompletną strukturę, umożliwiając organizacji pracę jako pojedynczej jednostki o jednolitych celach. ..ta odpowiedź nie ma sensu….jakby pytanie miało XD\nSpecyfikacja wymagań – opis funkcji i zadań, które system powinien realizować, własności, które powinien posiadać oraz ograniczeń, które powinien spełniać \nNp. dotyczy systemu zarządzania jakością? Systemu klasy ERP? a może po prostu systemu informatycznego xD ?Z reguły związana jest ze spełnieniem norm certyfikacji ISO.\n"
    },
    {
        "nr": 459,
        "q": " Związek pomiędzy aktorami na poniższym diagramie przypadków użycia oznacza, że",
        "a": " \n\nOznacza, że zachodzi związek generalizacji, czyli dziedziczenie cech elementu ogólnego przez element szczegółowy, który może te cechy rozszerzać. Element szczegółowy może zastąpić element ogólny. Zależność generalizacji skierowana jest od elementu szczegółowego do elementu ogólnego. \nA czy to przechodzi też na klasy A,B i C ? tzn. Czy z tego wynika, że klasa B dziedziczy cechy A ? - z tego wynika, że klasa B ma wszystkie atrybuty klasy A, ale też jakieś cechy, które ją “rozszerzają” pod względem A. To samo z klasą C - posiada wszystkie atrybuty klasy A i B, ale ma też jeszcze coś dodatkowego, co ją “rozszerza” pod względem B\n"
    },
    {
        "nr": 460,
        "q": " W węźle sygnału nadawczego na diagramie czynności następuje",
        "a": "\nModelowanie asynchronicznego wysyłania komunikatów. Właściwości: komunikaty mogą być wysłane do innych czynności jak i samych siebie, po wysłaniu następuje automatyczne przejście do wykonania kolejnej akcji lub czynności, po wysłaniu komunikatu proces nie czeka aż odbiorca odbierze komunikat. węzeł ten wygląda następująco \n"
    },
    {
        "nr": 461,
        "q": " Który z diagramów UML może służyć do modelowania dynamiki systemu?\nŻadna z przedstawionych odpowiedzi nie jest poprawna\nDiagram czynności\nDiagram klas\nDiagram obiektów\nDiagram sekwencji. (na niektórych stronach pisze, że one są do interakcji, a na innych, że pokazują też dynamiczne aspekty…)\n\n\n(a nie diagram aktywności/czynności?",
        "a": "):\n\n\nWięc co w końcu, ktoś wie?\n\nRaczej oba. \n"
    },
    {
        "nr": 462,
        "q": " Poniższy diagram zawiera",
        "a": "\n\n\nWygląda to na diagram sekwencji opisujący serwis do pobierania dokumentów z serwera na komputer lokalny. \nZawiera: okres aktywności, dwóch uczestników, 6 komunikatów (2 synchroniczne - pierwszy oraz 2, ten “do siebie”- czyli rekursywny; 1 zwrotny - przerywana linia; 3 asynchroniczne), linie życia\n\n"
    },
    {
        "nr": 463,
        "q": " Jaki rodzaj związku między klasami A i B wynika z poniższego fragmentu kodu C#",
        "a": "\npublic class KlasaB {...} \npublic class KlasaA \n{ \n      public void Metoda(KlasaB b) {...}\n}\nZwiązek “zależność” //ponieważ używa argumentu typu KlasaB\n"
    },
    {
        "nr": 464,
        "q": " Który z wzorców projektowych najlepiej nadaje się do rozwiązania następującego problemu",
        "a": " Czytelnik pragnie wypożyczyć książkę. Wszystkie egzemplarze książki są aktualnie wypożyczone. Czytelnik rejestruje się jako osoba, która chce być powiadamiana, jeśli tylko pojawi się jakiś wolny egzemplarz. [464]\nWzorzec obserwatora (observer pattern), należący do grup wzorców behawioralnych, //event sourcing\n"
    },
    {
        "nr": 465,
        "q": " „List comprehension” w języku Python jest wydajnym mechanizmem tworzenia złożonych sekwencji. Jaka sekwencja zostanie utworzona w wyniku wykonania kodu",
        "a": " „for i in [(i,j) for i in range(2) for j in range(1,3): print(i)”: \nPo wpisaniu do kompilatora wyskakuje błąd, na logikę wygląda to na niepoprawne użycie nawiasu “[“ - brak jego domknięcia w którymś miejscu (być może również jego błędne położenie początkowe) , jednakże należałoby to skonsultować ze specjalistą od Pythona (których na wydziale pełno).\nJeśli doda się brakujący nawias do list comprehension, sekwencja wygląda tak:\n"
    },
    {
        "nr": 466,
        "q": " W języku Python wynikiem wykonania kodu",
        "a": " print(\"Licencjat.\"[:-2]) będzie: [466]\nLicencja\n"
    },
    {
        "nr": 467,
        "q": " W języku Python 3.7 wynikiem wykonania kodu",
        "a": " print \"Licencjat.\"[:-2] będzie:\nWyskakuje błąd, brakuje nawiasów, zatem wynikiem jest BŁĄD. Kod działa po jego zmianie na ten z pytania 466.\n"
    },
    {
        "nr": 468,
        "q": " Do szacowania kosztu realizacji przedsięwzięcia informatycznego można wykorzystać [468] \nMetryki wydajności",
        "a": "\nmetryki oparte na rozmiarze kodu (np. liczba linijek kodu produkowanego miesięcznie przez pojedynczego programistę)\nmetryki oparte na uzyskiwanej funkcjonalności (np. interakcjach z użytkownikiem, interakcjach z urządzeniami we/wy)\nMetryki są bardzo szacunkowe i przybliżone, nie uwzględniają rozmaitości i złożoności oprogramowania\nTechniki:\nmodelowanie algorytmiczne\nekspertyzy specjalistów\nporównanie z uprzednio realizowanymi projektami\nograniczenia (szacowany jest koszt zależnie od ograniczeń i następnie przykrawa się wymagania i szczegóły realizacji do przewidzianego kosztu). Przykładem ograniczeń są np. warunki zamówienia lub stan firmy\nMetody: ////\nCOCOMO II (skrót od ang. COnstructive COst Model)\nMetoda delficka\nMetoda linii kodu\nMetoda punktów funkcyjnych (ang. Function Points Method)\nMetoda punktów przypadków użycia\n"
    },
    {
        "nr": 469,
        "q": "  Metoda delficka ustalania kosztów polega na",
        "a": " \nMetoda delficka polega na wykorzystaniu wiedzy ekspertów oraz ich doświadczenia w celu podejmowania jakichś decyzji. Jest to metoda heurystyczna. \n"
    },
    {
        "nr": 470,
        "q": " Szacowanie rozmiaru oprogramowania wykonuje się w oparciu o",
        "a": " [470]\nMetodę punktów funkcyjnych\n• Sposób mierzenia funkcjonalności\n• Funkcjonalność, czyli system:\n–z punktu widzenia użytkownika\n–niezależnie od technologii\n• Punkt funkcyjny:\n–miara „jednostki” funkcjonalności\n"
    },
    {
        "nr": 471,
        "q": " Do wyznaczenia granic projektu w metodzie punktów funkcyjnych wykorzystujemy",
        "a": " ???(na pewno to jest do sprawdzenia, metoda IFPUG jest późniejszą [zmodyfikowaną i ulepszoną] wersją metody punktów funkcyjnych) [471]\nPunkt widzenia i zapotrzebowanie użytkownika\nMetoda PF IFPUG wprowadza również pojęcie granicy oprogramowania. Granica oprogramowania\\\n wyznacza zakres szacowanego oprogramowania jak i również służy do określenia funkcji wejścia / wyjścia / zapytań, jako funkcji przenoszących dane z zewnątrz do wewnątrz granicy lub z wewnątrz na zewnątrz granicy. Wewnętrzny model danych jest również traktowany jako mechanizm utrwalania danych wewnątrz granicy oprogramowania, podczas gdy interfejsy zewnętrzne są modelowane, jako zbiory danych dostępne dla oprogramowania poza jego granicami. Grac nica danego oprogramowania powinna być zgodnie z założeniami metody wyznaczona w oparciu o perspektywę jego użytkownika a precyzyjniej – jego potrzeb. Oznacza to, iż oprogramowanie objęte granicą powinno realizować spójne określone cele użytkownika, powinno zawierać logicznie powiązane funkcje i dane zgodnie z potrzebami użytkownika. W żadnym wypadku granica ta nie powinna być zatem wyznaczana przez ograniczenia technologiczne, infrastrukturalne czy architektoniczne. W przypadku szacowania zmian oprogramowania należy mieć na uwadze fakt, iż granica oprogramowania jest czymś niezależnym od zmiany – powinna być zdefiniowana dla danego zmienianego oprogramowania, jako logicznej całości a nie, dla danego zmienianego fragmentu.\n\nGranice powinien określać użytkownik w oparciu o swój punkt widzenia i zapotrzebowanie/cele/potrzeby. (zgodnie z IFPUG)\nOgraniczenia technologiczne nie powinny być brane pod uwagę podczas określania granic między współpracującymi systemami. Należy kierować się przy tym ich funkcjonalnością.\n\n"
    },
    {
        "nr": 472,
        "q": " Do obliczenia wagi przypadku użycia wykorzystujemy",
        "a": " \nMetodę punktów przypadków użycia (UCP) /klasy złożoności przypadków użycia\n()\n(wydaje się, że wystarczy znajomość znaczenia “ni” oraz “ci”) [472]\nSposób obliczania nieskorygowanej wagi  UUCW WSZYSTKICH przypadków użycia danego systemu.\n Pierwszą czynnością jest wyznaczenie liczby transakcji w ramach przypadku użycia, czyli kroków lub grup kroków, które mogą zostać wykonane w całości lub w ogóle. Następnie w zależności od liczby transakcji możemy zakwalifikować dany przypadek użycia do jednej z trzech grup złożoności:\nPrzypadki proste – jeśli mają 3 lub mniej transakcji (współczynnik złożoności wynosi wówczas 5)\nŚrednie – liczba transakcji od 4 do 7 (współczynnik złożoności wynosi wówczas 10)\nZłożone – powyżej 7 transakcji (współczynnik złożoności wynosi wówczas 15)\nNależy następnie wymnożyć dla każdej grupy złożoności liczbę zakwalifikowanych do niej przypadków użycia przez współczynniki złożoności.\n(nieskorygowaną) Wagę przypadków użycia UUCW obliczamy sumując powyższe iloczyny. \ni  * ci, gdzie\nni - liczebność i-tego zbioru złożoności przypadków użycia,\nci - współczynnik złożoności i-tego zbioru.\n"
    },
    {
        "nr": 473,
        "q": " Pracochłonność w metodzie Cocomo ustalana jest w oparciu o",
        "a": "\nAby oszacować liczbę osobogodzin, należy najpierw oszacować, z ilu linii kodu lub punktów funkcyjnych będzie się składać gotowy projekt. Liczba linii kodu jest przedstawiana w KDSI (1000 (K) delivered source instructions [1 KDSI = 1000 linii]. \nA według innej strony jednostką jest osobomiesiąc (miesięczny czas pracy jednej osoby).\nCzyli poprawna odp. to: złożoność projektu (jeśli będą wymienione te atrybuty), a jak nie to osobojednostka (albo osobogodzina, albo osobomiesiąc).\n"
    },
    {
        "nr": 474,
        "q": " Jakie  podstawowe  narzędzie  wykorzysta  zespół  zwinny  w  celu zdefiniowania  wymagań klienta? ",
        "a": "[474]\n\tHistoryjki użytkownika, przypadki użycia\n\n"
    },
    {
        "nr": 475,
        "q": " Jeżeli  członek  zespołu  zgłosi  propozycję  zmiany  w  projekcie PRINCE2, kto  może  ją zaakceptować ?",
        "a": " [475]\n\t  Komitet Kontroli Zmian. \n\n"
    },
    {
        "nr": 476,
        "q": " Do jakiego celu kierownik projektu wykorzysta macierz RACI w metodyce PMI/PMBoK?",
        "a": "\nmapowania ról i odpowiedzialności, przypisanie do poszczególnych kroków procesu uczestników, „aktorów”, pełniących różne rodzaje ról\n()\n\n\n"
    },
    {
        "nr": 477,
        "q": " Osoba odpowiedzialna za wygląd strony WWW będzie modyfikować najczęściej warstwę",
        "a": " [477]\nwarstwa prezentacji\n\n"
    },
    {
        "nr": 478,
        "q": " W  celu  ułatwienia  pracy  z  dużą  liczbą  stylów  CSS  dla  aplikacji  internetowej  można wykorzystać",
        "a": " [478]\n\tPreprocesor (Sass lub less) lub w przypadku mniejszej ilości stylów każdy w osobnym pliku.\nalbo coś takiego jak Dreamweaver?\n\n\n"
    },
    {
        "nr": 479,
        "q": " Listę sterowników dla baz danych dostępnych w PHP określamy w pliku",
        "a": "\n(do weryfikacji i do zapytania)\nconfig.inc.php lub php.ini \n\t\n"
    },
    {
        "nr": 480,
        "q": " Łącze ODBC (Open Database Connectivity) wykorzystywane do tworzenia aplikacji to",
        "a": " [480]\n\t Interfejs pozwalający programom łączyć się z systemami zarządzającymi bazami danych. Jest to API niezależne od języka programowania, systemu operacyjnego i bazy danych.\n\n"
    },
    {
        "nr": 481,
        "q": " Do tworzenia aplikacji bazodanowych stosowany jest",
        "a": " [481]\n\tSQL oraz systemy zarządzania bazami danych np. Oracle, MySql, SQL Server, również MS Access.\n\n"
    },
    {
        "nr": 482,
        "q": " Jakimi podstawowymi metodami mogą posłużyć się programiści, aby zaprojektować klasy",
        "a": " [482]\nSOLID\n\tMetoda CRC (Class, Responsibilities, Collaborations) oraz Metoda DDD (Data Driven Design).\n\n\n\n"
    },
    {
        "nr": 483,
        "q": " W diagramach klas UML agregację oznaczamy symbolem",
        "a": " [483]\npusty romb\n\n\n"
    },
    {
        "nr": 484,
        "q": " Do oznaczania prywatnych metod w diagramach klas UML służy symbol",
        "a": " [484]\n\t-\n\n"
    },
    {
        "nr": 485,
        "q": " Których grup pracowników dotyczy polityka bezpieczeństwa danych?",
        "a": " [485]\n\tPolityka bezpieczeństwa powinna przede wszystkim dotyczyć pracowników i współpracowników, którzy mają dostęp do chronionych danych. Każdy pracownik lub współpracownik zobowiązany jest do ochrony swoich danych dostępowych do systemów informatycznych\n\n"
    },
    {
        "nr": 486,
        "q": " Respektowanie  zapisów  polityki  bezpieczeństwa  danych  daje  dodatkową  korzyść  dla organizacji w postaci",
        "a": " [486]\n●   zarządzanie ryzykiem w celu ograniczania go do akceptowanego poziomu,\n●     właściwa ochrona informacji, a w szczególności informacji prawnie chronionych,\n●     zapewnienie odpowiedniego poziomu dostępności informacji i niezawodności   \tsystemów informatycznych,\n●     właściwa ochrona informacji związanych z zawartymi umowami,\n●     wdrażanie i rozwój systemów informacyjnych z zachowaniem zasad bezpieczeństwa,\n● \teksploatowanie systemów informacyjnych zgodnie z zasadami bezpieczeństwa,\n●     stała edukacja użytkowników systemu informacyjnego.\n\n"
    },
    {
        "nr": 487,
        "q": " Wdrożenie  procedur  bezpieczeństwa,  polityki  bezpieczeństwa  czy  zasad,  reguł  itp.  jest zadaniem ",
        "a": " [487]\n\tOsoby zarządzającej całokształtem działań związanych z zapewnieniem systemowi wymaganego poziomu bezpieczeństwa, tzw. Oficera Bezpieczeństwa np. specjalista informatyk odpowiedzialny za ochronę danych\n\n"
    },
    {
        "nr": 488,
        "q": " Który z symbolów krotności oznacza, że pomiędzy obiektami A i B może nie występować powiązanie?",
        "a": " [488]\n\n0..*\n0..* - to oznacza, że może nie być żadnego powiązania, lub może być ich dowolna ilość. Nie ma takiej opcji na powyższym screenie (nwm dlaczego), ale w oprogramowaniach do budowania modeli UML (np. StarUML) są stosowane powszechnie.\n\n"
    },
    {
        "nr": 489,
        "q": " Jeśli atrybut jest widoczny tylko w danej klasie, to jego poziom widoczności jest",
        "a": " [489]\nprywatny - private\n"
    },
    {
        "nr": 490,
        "q": " Jeśli  atrybut  jest  widoczny  tylko  w  danej  klasie  i klasach  pochodnych, to  jego  poziom widoczności jest",
        "a": " [490]\nchroniony - protected\n"
    },
    {
        "nr": 491,
        "q": " Wspólnicy spółki z ograniczoną odpowiedzialnością są zobowiązani jedynie do świadczeń",
        "a": " [491]\nokreślonych w umowie spółki\nwniesienia umówionego w umowie wkładu do spółki.\n\n\n"
    },
    {
        "nr": 492,
        "q": " Wspólnicy spółki z ograniczoną odpowiedzialnością za zobowiązania spółki",
        "a": " [492]\nnie odpowiadają (odpowiada spółka jako osoba prawna - nie licząc wyjątków).\n\n"
    },
    {
        "nr": 493,
        "q": " Do zgłoszenia spółki partnerskiej do sądu rejestrowego należy dołączyć",
        "a": " [493]\ndokumenty potwierdzające uprawnienia każdego partnera do wykonywania wolnego zawodu (art. 93 § 2 K.s.h.) \n"
    },
    {
        "nr": 494,
        "q": " Powództwo przeciwko osobie prawnej lub innemu podmiotowi niebędącemu osobą fizyczną wytacza się według",
        "a": " [494]\nmiejsca ich siedziby. \n\n"
    },
    {
        "nr": 495,
        "q": " Powództwo o roszczenie majątkowe przeciwko przedsiębiorcy można wytoczyć przed sąd",
        "a": " [495]\nw którego okręgu znajduje się zakład główny lub oddział, jeżeli roszczenie pozostaje w związku z działalnością tego zakładu lub oddziału. \n\n"
    },
    {
        "nr": 496,
        "q": " Sąd w toku postępowania może skierować strony do mediacji",
        "a": " [496]\nna każdym etapie postępowania.\n\n"
    },
    {
        "nr": 497,
        "q": " Z zawezwaniem do próby ugodowej – bez względu na własność rzeczową – można zwrócić się do",
        "a": " [497]\nSądu rejonowego ogólnie właściwego dla przeciwnika, a w braku podstaw do ustalenia tej właściwości - do sądu rejonowego właściwego dla miejsca zamieszkania albo siedziby wzywającego. \n\n"
    },
    {
        "nr": 498,
        "q": " W przypadku, gdy nie można w pełni spłacić wszystkich wierzytelności spółki jawnej, albowiem nie wystarcza na ten cel aktywów majątkowych spółki, należy posłużyć się",
        "a": " [498]\nmajątkiem wspólników zgodnie z postanowieniami umowy spółki. W braku takich postanowień, wspólnicy zobowiązani są uzupełnić niedobór w takim stosunku, w jakim uczestniczą w stracie spółki. Jeżeli okaże się, że jeden lub kilku spośród wspólników jest niewypłacalnych, pozostali wspólnicy dzielą pomiędzy siebie tę część niedoboru, którą zobowiązani byli uiścić wspólnicy niewypłacalni.\n\n"
    },
    {
        "nr": 499,
        "q": " W razie zaistnienia potrzeby zastosowania przepisów ustawy obejmującej przepisy części ogólnej i przepisy części szczegółowej należy",
        "a": " [499]\nstosować właściwe przepisy części szczegółowej oraz przepisy części ogólnej, ale w zakresie nieunormowanym częścią szczegółową.\n\n"
    },
    {
        "nr": 500,
        "q": " Przedsiębiorstwo XYZ produkuje, jako jedyne na świecie, wyrób A. Która z decyzji przedsiębiorstwa XYZ spowoduje zwiększenie barier wejścia na ten rynek?",
        "a": "\nZwiększenie ceny wyrobu A\nOpatentowanie technologii wytwarzania wyrobu A\nRezygnacja z wytwarzania wyrobu\nZmniejszenie ceny wyrobu A\n\nobjęcie ochroną patentową wytwarzanego wyrobu. zapisy w umowach z dostawcami\n\n"
    },
    {
        "nr": 501,
        "q": " Przedsiębiorstwo  ABC  jest  producentem  specjalistycznych  podzespołów  X.  Istnieją dwa przedsiębiorstwa (A i B), które używają tych podzespołów w swoich wyrobach. ABC jest dostawcą obu tych przedsiębiorstw. Przedsiębiorstwa A i B właśnie ogłosiły fuzję. Co to oznacza dla firmy ABC?",
        "a": "\nProducent (firma ABC) ma teraz tylko jednego odbiorcę, więc polega teraz tylko na nim i ma słabszą pozycję w negocjacji cen. \n\n"
    },
    {
        "nr": 502,
        "q": " Produkt A przedsiębiorstwa XYZ jest, wg macierzy BCG, psem. Oznacza to, że przedsiębiorstwo XYZ powinno",
        "a": " [502]\nrozważyć możliwość wycofania się z danego sektora rynku, gdyż produkty te pochłaniają zbyt dużo środków finansowych, przynosząc w zamian znikome dochody.\n\n"
    },
    {
        "nr": 503,
        "q": " Produkt A przedsiębiorstwa XYZ jest, wg macierzy BCG, dojną krową. Oznacza to, że przedsiębiorstwo XYZ powinno",
        "a": " \nnie inwestować w rozwój żadnych wyrobów i gromadzić zapasy\nprzeznacyć zyski z niego na utrzymanie jego pozycji, a nadwyżki przeznaczyć na rozwój innych produktów\nnie inwestować w jego rozwój, a może nawet wycofać się z jego. Produkcji\nprzeznaczyć zyski z innych produktów na rozwój produktu A\n\nutrzymać udział w rynku, finansować pozostałe wyroby, inwestycje, wspierać gwiazdy.\n\n"
    },
    {
        "nr": 504,
        "q": " Produkt A przedsiębiorstwa XYZ jest, wg macierzy BCG, gwiazdą. Oznacza to, że przedsiębiorstwo XYZ powinno",
        "a": "\ninwestować w gwiazdę, gdyż jest to bardzo opłacalne, ponieważ tempo wzrostu rynku jest wysokie a sam produkt jest konkurencyjny i rozwojowy. Gwiazdy z biegiem czasu mogą przekształcić się w dojne krowy. \n\n"
    },
    {
        "nr": 505,
        "q": " Możliwą jednostką,w której podajemy wynik analizy ścieżki krytycznej,są",
        "a": " \njednostki czasu.\n\n"
    },
    {
        "nr": 506,
        "q": " W analizie BCG wyrób X ma wysoki udział w dynamicznie rozwijającym się rynku. W związku z tym jest",
        "a": "\ngwiazdą.\n\n"
    },
    {
        "nr": 507,
        "q": " W analizie BCG wyrób X ma niski udział w dynamicznie rozwijającym się rynku. W związku z tym jest",
        "a": "\nznakiem zapytania.\n\n"
    },
    {
        "nr": 508,
        "q": " W analizie BCG wyrób X ma wysoki udział w stabilnym rynku. W związku z tym jest",
        "a": "\ndojną krową.\n\n"
    },
    {
        "nr": 509,
        "q": " W analizie BCG wyrób X ma niski udział w stabilnym rynku. W związku z tym jest",
        "a": "\npsem/kulą u nogi.\n\n"
    },
    {
        "nr": 510,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": "\nr =[1, \"2\", \"b\"*3]\nprint( r )\nto wynikiem jego wykonania będzie (pomijając łamanie wiersza): [1, ‘2’, ‘bbb’]\n\n"
    },
    {
        "nr": 511,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": "\ni = 11\nwhile i>0:\n    print( i )\n    i-= 2\nto wynikiem jego wykonania będzie: 11,9,7,5,3,1\n\n"
    },
    {
        "nr": 512,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": "\ni = 11\nwhile i:\n    print( i )\n    i -= 2\nto wynikiem jego wykonania będzie (pomijając łamanie wiersza): pętla nieskończona\n \n"
    },
    {
        "nr": 513,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": "\ni = 11\nif i>10:\n    print( \"i>10 ,\", i )\nelif i>6:\n    print(\"i>6 ,\", i)\nelse: print(\"i<=5 ,\", i)\nto wynikiem jego wykonania będzie (pomijając łamanie wiersza): i>10 , 11\n\n\n\n\n\n\n"
    },
    {
        "nr": 514,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": "\ni = 5\nif i>10:\n    print( \"i>10 ,\", i )\nelse: \n    if i>5:\n        print(\"i>5,\", i)\n    else: \n        print(\"i<=5 ,\", i)\n\nto wynikiem jego wykonania będzie (pomijając łamanie wiersza): i<=5 , 5\n\n"
    },
    {
        "nr": 515,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": "\na=3; b=4;\nb,a = a,b\nprint(a, b, end=\"!\")\nto wynikiem jego wykonania będzie (pomijając łamanie wiersza): 4 3!\n\n"
    },
    {
        "nr": 516,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": "\na=3; b=4; c=2;\nb,a = a*b**c, a//c*b\nprint(a, b, end=\"!\\n\")\nto wynikiem jego wykonania będzie (pomijając łamanie wiersza): 4 48! (+ nowa linia)\n\n"
    },
    {
        "nr": 517,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": "\nx=1; y=0\ntry:\n    z = x / y\nexcept:\n    print (\"Niepoprawne dane\")\nelse:\n    print (\"Wynik:\", z)\nto wynikiem jego wykonania będzie (pomijając łamanie wiersza): Niepoprawne dane\n\n"
    },
    {
        "nr": 518,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": " #-*-coding: ibm852 -*-\nto wynikiem jego wykonania będzie (pomijając łamanie wiersza): zmiana kodowania\n\n"
    },
    {
        "nr": 519,
        "q": " Jeśli w języku Python 3.7 zdefiniujemy kod",
        "a": " [519]\nclass Kwadrat:\n    bok = 0\n    def wyswietl(self):\n        print(“pole=\", self.pole())\n    def pole(self):\n        return self.bok ** 2\n\nclass Szescian(Kwadrat):\n    def pole(self):\n        return Kwadrat.pole(self)*6\nto powyższy kod: nie wykona nic (jest to jedynie zdefiniowanie klas) - Jest przykładem dziedziczenia\n"
    },
    {
        "nr": 520,
        "q": " Zdarzenie  „powstaje   nowa technologia,  która  zapewni  lepszą  jakość  produktów  przy mniejszym koszcie” w zarządzaniu projektami należy potraktować jako",
        "a": " [520]\nSzansa\n\n"
    },
    {
        "nr": 521,
        "q": " Jakie  podstawowe  narzędzie  wykorzysta  menedżer  projektu  PRINCE2  do  zarządzania ryzykiem? ",
        "a": " [521]\nMapa Ryzyka\n Można wykorzystać pięciostopniową procedurę złożoną z kolejnych kroków:\nIdentyfikacja: Najpierw wypełnij dokument Strategii zarządzania ryzykiem dla projektu, a następnie zidentyfikuj ryzyka (zagrożenia i szanse), które mogą mieć wpływ na projekt.\nOcena: Ocena ryzyka pod względem prawdopodobieństwa i wpływu na cele projektu.\nPlanowanie: W tym miejscu kroki w ramach planu mają na celu przygotowanie konkretnej odpowiedzi na zagrożenia (np. w celu zmniejszenia lub uniknięcia zagrożenia), lub może to również polegać na planowaniu maksymalizacji szansy w przypadku wystąpienia ryzyka.\nWdrożenie: Wykonaj planowane odpowiedzi wymienione w punkcie 3, jeśli wystąpi ryzyko.\nKomunikacja: komunikuj się z interesariuszami. Użyj istniejących raportów zarządzania, które zostały utworzone podczas projektu (np. Raport końcowy etapu).\nTo powyższe to metoda M_o_R (Management of Risk)\nWykorzysta też Rejestr Ryzyka? - prince2\n\n"
    },
    {
        "nr": 522,
        "q": " Zdarzenie „musimy użyć nowej technologii, w której nie mamy doświadczenia” w zarządzaniu projektami należy traktować jako",
        "a": " [522]\n   słaba strona,  bo to MY nie mamy doświadczenia  \n"
    },
    {
        "nr": 523,
        "q": " W którym miejscu strony HTML należy umieścić podstawowe informacje wykorzystywane przez wyszukiwarki internetowe do indeksowania stron?",
        "a": "\nw sekcji <meta>\n"
    },
    {
        "nr": 524,
        "q": " Jakiej techniki należy użyć w celu bieżącego odświeżania danych z serwisu giełdowego na stronie HTML?",
        "a": " [524]\n\nGET ?\nSymulatora\nAJAX ?\nSilnika wnioskującego\n?\nMożna wykorzystać ramki (frames) w połączeniu z meta tagami lub Javascript\nMożna także wykorzystać tylko Javascript lub JQuery (bez ramek)\nWebsocket, cykliczne requesty, albo long requesty.\n"
    },
    {
        "nr": 525,
        "q": " Konfiguracji protokołu HTTPS po stronie serwera w celu zabezpieczenia przesyłanych danych wymaga",
        "a": " [525]\nWdrożenia certyfikatu SSL\n Zastosowania protokołu TLS (protokół kryptograficzny), składającego się z 3 głównych warstw zabezpieczeń: Szyfrowania, Integralności danych i Uwierzytelniania\n\n"
    },
    {
        "nr": 526,
        "q": " Praktyczne wykorzystanie regułowego systemu szkieletowego wymaga zdefiniowania przez użytkownika",
        "a": " [526]\n  Bazy wiedzy (zbioru faktów i zbioru reguł)\n"
    },
    {
        "nr": 527,
        "q": " Do realizacji klauzul Horna w Prologu stosuje się",
        "a": " [527]\nOperator „:-‘’   np.  p :- r, q\nReguły, w których lewa strona jest termem atomowym, a z prawej znajduje się koniunkcja lub alternatywa. Takie formuły logiczne, bez alternatyw, albo z alternatywami wyłącznie negatywnych literałów, albo z najwyżej jednym literałem pozytywnym, nazywa się klauzulami Horna (Klauzula Horna ( Horn clause) – , w której co najwyżej jeden element jest niezanegowany. )\n"
    },
    {
        "nr": 528,
        "q": " Sprawdzenie pewnej hipotezy jest realizowane przez wnioskowanie",
        "a": " [528]\nw tył, wnioskowanie wstecz\n\n"
    },
    {
        "nr": 529,
        "q": " Złączenie naturalne wymaga by w obu łączonych relacjach",
        "a": " [529]\nobie kolumny występujące w warunku łączącym były tej samej nazwy.\n\n"
    },
    {
        "nr": 530,
        "q": " W celu zapewnienia integralności danych w różnych relacjach konieczne jest",
        "a": " [530]\njednoznaczne identyfikowanie wszystkich atrybutów dowolnego obiektu na podstawie jednego lub kilku jego atrybutów, czyli innymi słowy zastosowanie unikatowych kluczy głównych.\n\n"
    },
    {
        "nr": 531,
        "q": " Mechanizm upraszczania opisu jakiegoś obiektu (np. banku) w projektowaniu obiektowym określamy jako",
        "a": "[531]\nAbstrakcja\n"
    },
    {
        "nr": 532,
        "q": " Grupa metod, która realizuje kluczowe zadania dla klasy np. zakładanieKonta, wykonajPrzelew itp. dla konta bankowego, określana jest w programowaniu obiektowym jako",
        "a": " \ninterfejs.\n\n"
    },
    {
        "nr": 533,
        "q": " Przekazywanie danych jakiegoś obiektu do innej zewnętrznej aplikacji biznesowej w postaci XML można zrealizować w .NET za pomocą",
        "a": "[533]\nSerializacji,\nwebAPI, protokół HTTP\n\n"
    },
    {
        "nr": 534,
        "q": " W odniesieniu do której grupy metod zastosowanie nie jest zazwyczaj wymagane w przypadku konstrukcji systemów do wspomagania podejmowania decyzji dobrze ustrukturyzowanych",
        "a": "\nto po polsku? XD...tak XD\n\n"
    },
    {
        "nr": 535,
        "q": " Konstrukcja systemów do wspomagania podejmowania decyzji słabo ustrukturyzowanych bazuje na zastosowaniu metod",
        "a": "[535]\nOLTP, OLAP oraz technologii związanych z wydobywaniem danych (oparte o sztuczną inteligencję). Są to metody i technologie stosowane w DSS czyli Decision Support System.\n//optymalizacji i symulacji - tak mieli w tym pliku z 2016r. xd\n\n"
    },
    {
        "nr": 536,
        "q": " Implementacja algorytmów ukierunkowanych na wspomaganie decyzji w przedsiębiorstwie może być realizowana za pomocą",
        "a": "\nSztucznych sieci neuronowych, drzew decyzyjnych \nsystemy eksperckie\n\n"
    },
    {
        "nr": 537,
        "q": " Procesy decyzyjne w przedsiębiorstwie nie są wspomagane przez rozwiązania informatyczne ukierunkowane na",
        "a": "\nklienta?\n coś z kreatywnością czy coś?\n\n"
    },
    {
        "nr": 538,
        "q": " Model dziedziny (konceptualny) nie zawiera",
        "a": " \nZawiera: relacja(powiązanie, dziedziczenie, agregacja, kompozycja), nazwę oraz liczność relacji oraz pojęcia (czyli klasę)\nNa zajęciach było, że ZAWIERA atrybuty w klasach, a NIE ZAWIERA operacji (czynności/metod) -> chyba tak\n\n"
    },
    {
        "nr": 539,
        "q": " Jeżeli obiekty jednej klasy pełnią rolę całości, a obiekty innej klasy rolę części, przy czym obiekty pełniące rolę części mogą należeć do kilku obiektów pełniących rolę całości, to mamy do czynienia z",
        "a": " \nAgregacją\n\n"
    },
    {
        "nr": 540,
        "q": " Jeżeli obiekty jednej klasy pełnią rolę całości, a obiekty innej klasy rolę części, przy czym obiekt pełniący rolę części może w danym momencie należeć tylko do jednego obiektu typu całość, to mamy do czynienia z",
        "a": " \nKompozycją\n\n"
    },
    {
        "nr": 541,
        "q": " Rozwiązań grę o sumie zero przy macierzy wypłat danej poniższą tabelą. Jakie decyzje powinien podjąć gracz A, a jakie gracz B",
        "a": " \n\nIstnieje punkt siodłowy: Obaj gracze powinni grać strategią 3.\n\n"
    },
    {
        "nr": 542,
        "q": " W ramach projektu trzeba m.in. wykonać cztery operacje oznaczone literami a,…,d, o czasach trwania wynoszących odpowiednio 1, 2, 3 i 4 godzinę. O której godzinie najpóźniej powinna się rozpocząć operacja a, jeżeli dopiero po jej zakończeniu będą mogły rozpocząć się operacje b, c i d, a ich tzw. najpóźniejsze dopuszczalne terminy zakończenia określono odpowiednio na godzinę",
        "a": " 7:00, 6:00, 8:00: \nO godzinie 2:00  \n\n\n"
    },
    {
        "nr": 543,
        "q": " W celu bezpiecznego wywołania kodu SQL w aplikacji internetowej najlepiej jest wykorzystać",
        "a": " \nProcedury składniowe\nKod SQL w postaci binarnej\nFunkcje\nKod SQL w postaci tekstowej\n\n"
    },
    {
        "nr": 544,
        "q": " Mechanizm pozwalający na niezaplanowane wykonanie kodu SQL np. za pomocą formularza HTML określany jest jako",
        "a": " \nSQL False Execution\nForm Overriding\nForm Violation\nSQL Injection\n\n"
    },
    {
        "nr": 545,
        "q": " W celu uniknięcia problemów z bezpieczeństwem w JavaScript nie należy wykorzystywać funkcji",
        "a": " [625]\n\neval()\n\n"
    },
    {
        "nr": 546,
        "q": " Komunikacja zaszyfrowana pomiędzy klientem a serwerem WWW odbywa się standardowo na porcie",
        "a": " \n443\n\n"
    },
    {
        "nr": 547,
        "q": " Odpowiedź z serwera o braku uprawnień klienta do żądanego zasobu oznaczona jest statusem błędu",
        "a": " \n403 Forbidden\n\n"
    },
    {
        "nr": 548,
        "q": " Warunkiem koniecznym pozwalającym na komunikację pomiędzy klientem a serwerem po porcie HTTPS jest ważny certyfikat",
        "a": " \nCertyfikat SSL\n\n"
    },
    {
        "nr": 549,
        "q": " Nadrzędnym celem polityki bezpieczeństwa danych jest",
        "a": " \nOchrona danych, zachowanie poufności danych\n//Zapewnienie integralności systemu informatycznego wraz z przechowywanymi i przetwarzanymi w nim informacjami.  - z pliku z odp z 2016\n\n "
    },
    {
        "nr": 550,
        "q": " Wymiernym efektem polityki bezpieczeństwa danych jest/są",
        "a": " \nunikanie powtarzania sie incydentow\n//Ochrona danych. - z pliku z odp z 2016\n\n"
    },
    {
        "nr": 551,
        "q": " Określ, kiedy system informatyczny organizacji można uznać za bezwarunkowo bezpieczny",
        "a": " \nNa dobrą sprawę nie istnieje system bezwarunkowo bezpieczny. Nigdy nie możemy przewidzieć wszystkiego.\n//System bezwarunkowo bezpieczny to system, którego stegoanaliza nie prowadzi do jego złamania.- z pliku z odp z 2016\n\nSzyfr jest bezwarunkowo bezpieczny, jeśli nie jest możliwe odtworzenie tekstu jawnego, nawet przy nieograniczonych zasobach obliczeniowych. []\nto nie isntnieje taki system, czy to system zaszyfrowany ?\n\n"
    },
    {
        "nr": 552,
        "q": " Podstawowym, programowym mechanizmem zabezpieczającym system komputerowy jest",
        "a": " \nWindowsDefender/Firewall\nzapora sieciowa\nlub inaczej: oprogramowanie antywirusowe, systemy firewall i kontroli treści \n\n"
    },
    {
        "nr": 553,
        "q": " Zapewnienia bezpiecznej komunikacji sieciowej pomiędzy dwoma budynkami nie można uzyskać przez",
        "a": " \na) http; b) https; c) ssh; d)ftp \nPrzez wysyłanie niezaszyfrowanych informacji przez sieć bezprzewodową i przy braku uwierzytelniania.\n\n"
    },
    {
        "nr": 554,
        "q": " Algorytm budowy drzewa kodowego dla optymalnego kodu prefiksowego Huffmana jest przykładem",
        "a": " \nKodowanie Hoffmana jest to metoda kompresji danych oparta o strategię zachłanną. Algorytm budowy drzewa jest niedeterministyczny, bezprzystankowy.\n\n"
    },
    {
        "nr": 555,
        "q": " Poprawnym algorytmem rozwiązującym rekurencyjnie problem wyznaczania silni liczby naturalnej n (n!) jest algorytm postaci",
        "a": " \nNa przykład:\nprivate static int silnia1(int i)\n{\nif(i < 1)\nreturn 1;\nelse\nreturn i * silnia1(i - 1);\n}\nBardziej tak: przecież oba te algorytmy są poprawne <- mają innego ifa dla return 1 ? <- no i co z tego? wyjście będzie takie samo, bo silnia i dla 0, i dla 1, równa się 1\n\n\n"
    },
    {
        "nr": 556,
        "q": " Programowanie dynamiczne to strategia rozwiązywania zagadnień optymalizacyjnych, która nie wymaga",
        "a": " \nrozwiązywania problemu złożonego, chodzi  o podproblemy\nmyślenia/stosowania złożonych algorytmów, dużej mocy obliczeniowej //chyba źle\n\nProgramowanie dynamiczne jest techniką lub strategią projektowania , stosowaną przeważnie do rozwiązywania zagadnień . \nProgramowanie dynamiczne opiera się na podziale rozwiązywanego problemu na podproblemy względem kilku parametrów. W odróżnieniu od techniki  podproblemy w programowaniu dynamicznym nie są rozłączne, ale musi je cechować . Zagadnienia odpowiednie dla programowania dynamicznego cechuje również to, że zastosowanie do nich  (ang. brute force) prowadzi do ponad wielomianowej liczby rozwiązań podproblemów, podczas gdy sama liczba różnych podproblemów jest wielomianowa. NIE WYMAGA KORZYSTANIA Z REKURSJI (czyli rekurencji heh)\n"
    },
    {
        "nr": 557,
        "q": " Mechanizm, jaki może zastosować programista klienta internetowego do ukrycia hasła wpisywanego do pola <input>, to",
        "a": "[557]\n<input type=\"password\" name=\"nazwa\">\n"
    },
    {
        "nr": 558,
        "q": " Co zrobi przeglądarka w przypadku błędu w składni języka CSS (np. zła nazwa właściwości dla jakiegoś selektora)",
        "a": "[558]\nStrona może wyświetlić się błędnie, beda brzydkie krzaczki ale sie przegladarka bedzie probowac wyswietlic\n\nlub w ogóle się nie wyświetlić.\n"
    },
    {
        "nr": 559,
        "q": " W przypadku konieczności szybkiego odwołania się do dużej ilości danych przez aplikację internetową na podstawie jakiejś wartości, najlepiej zastosować bazę",
        "a": "\n\tnoSQL\nMySQL\n[]\n"
    },
    {
        "nr": 560,
        "q": " Jakiego typu aplikację internetową można wykorzystać w celu utworzenia witryny pozwalającej na prezentację i modyfikację treści",
        "a": "[560]\nCMS (Content management system)\n"
    },
    {
        "nr": 561,
        "q": " Krotka w relacji identyfikowana jest przez",
        "a": "\nklucz główny\n"
    },
    {
        "nr": 562,
        "q": " Jaki warunek musi spełnić klasa, aby kolekcja obiektów tej klasy mogła być posortowana?",
        "a": " [562]\nMusi ona implementować interfejs IComparable lub IComparable<T>.\n"
    },
    {
        "nr": 563,
        "q": " W sytuacji, w której można utworzyć tylko jeden obiekt danej klasy, najlepiej zastosować wzorzec",
        "a": " [563]\nSingleton\n"
    },
    {
        "nr": 564,
        "q": " Kompozycja w programowaniu obiektowym jest typem relacji, w której",
        "a": "[564]\nobiekt składa się z obiektów składowych, które nie mogą istnieć bez obiektu głównego.\n"
    },
    {
        "nr": 565,
        "q": " Projekt i implementacja sklepu internetowego dedykowanego masowemu odbiorcy (klientowi) dotyczy relacji",
        "a": "\nb2c\n"
    },
    {
        "nr": 566,
        "q": " Projekt i implementacja platformy odwzorowującej sytuacje popytowo-podażowe między firmami dotyczy relacji",
        "a": "\nb2b\njeden do jeden\n"
    },
    {
        "nr": 567,
        "q": " Projekt i implementacja platformy odwzorowującej interakcje pomiędzy przedsiębiorcami, a urzędami administracji rządowej i samorządowej dotyczy relacji",
        "a": "\nbusiness to government\nwiele do wielu\n"
    },
    {
        "nr": 568,
        "q": " Analiza wymagań jest składową procesu wytwarzania oprogramowania następującą po",
        "a": "[568]\nzbieraniu wymagań (ew. u Macioła było tak, że zbieranie wymagań jest cześcią procesu analizy wymagań - więc wtedy chyba po prostu byłby to 1 etap)\npo planowaniu*\n"
    },
    {
        "nr": 569,
        "q": " W przypadku konieczności outsourcingu usług informatycznych",
        "a": "\ntniemy koszty\nOutsourcing polega na przekazywaniu zadań, funkcji, projektów i procesów do realizacji firmie zewnętrznej.\n"
    },
    {
        "nr": 570,
        "q": " Węzeł połączenia na diagramie czynności kończy przebiegi rozpoczęte",
        "a": "\nw węźle decyzyjnym (in. rozgałęzieniu), zatem oznacza koniec alternatywnego zachowania\n\n"
    },
    {
        "nr": 571,
        "q": " Rozdzielenie przepływów na równoległe na diagramie czynności występuje w",
        "a": "[571]\nwęźle rozwidlenia\n"
    },
    {
        "nr": 572,
        "q": "  Podproces typu Ad Hoc w BPMN kończy się, gdy",
        "a": "\nZakończenie podprocesu zależy od parametrów:\ncompletionCondition zawiera wyrażenie warunkowe — jeśli jest ono prawdziwe, wtedy proces jest kończony.\ncancelRemainingInstances (true/false) . Jeśli ustawiona jest wartość true i jednocześnie podproces ad hoc jest w trybie Par,allel, wtedy spełnienie warunku completionCondition jest równoważne z anulowaniem wszystkich czynności składowych danego podprocesu ad hoc, które były w trakcie realizacji.\nLub gdy skończą się wszystkie czynności tego podprocesu\n"
    },
    {
        "nr": 573,
        "q": " Jaką miarę zastosuje menedżer projektu PRINCE 2 dla ryzyka związanego z parametrami projektu?",
        "a": "\nMiarą ryzyka jest wartość iloczynu miary  wystąpienia dostrzeganego zagrożenia lub szansy oraz miary wielkości jego/jej  na cele.\n"
    },
    {
        "nr": 574,
        "q": " Dla ryzyka negatywnego, które w projekcie zostało określone jako mało prawdopodobne z małym wpływem na projekt stosujemy strategię",
        "a": "\nAkceptowania\n"
    },
    {
        "nr": 575,
        "q": " Dla ryzyka negatywnego, które w projekcie zostało określone jako wysoce prawdopodobne z dużym wpływem na projekt stosujemy strategię",
        "a": "\nUnikania\nhttp://dotproject.net.pl/node/58\n"
    },
    {
        "nr": 576,
        "q": " Dla ryzyka negatywnego, które w projekcie zostało określone jako wysoce prawdopodobne z umiarkowanym wpływem na projekt stosujemy strategię",
        "a": "\nŁagodzenie / przeniesienie  współdzielenie(?)\nhttp://dotproject.net.pl/node/58\n"
    },
    {
        "nr": 577,
        "q": " Prawdopodobieństwo wystąpienia ryzyka w projekcie w metodyce PRINCE2 określa się metodą",
        "a": "\nekspercką/delficka\n(znalazlam jeszcze macierz prawdopodobieństwa - ale nie jestem tez pewna)\niloczynu prawdopodobieństwa wystąpienia dostrzeżonego zagrożenia lub szansy oraz wielkość jego/jej wpływu na cele to tak zwana mapa ryzyka (na osi poziomej wpływ a na pionowej prawdopodobieństwo)\nhttp://prince2.wiki/Risk  \n"
    },
    {
        "nr": 578,
        "q": " Określenie ryzyka w tradycyjnym zarządzaniu projektami należy rozpocząć od",
        "a": "\nokreślenia ryzyka dla każdego zadania\nidentyfikacji ryzyka w projekcie\nszacowania wpływu ryzyka na projekt\nutworzenia macierzy ryzyka\nIdentyfikacji ryzyka\nRozpoznanie ryzyka / identyfikacja ryzyka\n\n"
    },
    {
        "nr": 579,
        "q": " Kto jest odpowiedzialny za obserwację określonego ryzyka w projekcie w metodyce PRINCE2?",
        "a": "\nwłaściciel ryzyka lub kierownik projektu\nKierownik projektu opracowywuje podejście do zarządzania ryzykiem, zakłada i prowadzi rejestr ryzyk, jest odpowiedzialny za zarządzanie ryzykiem, a właściciel ryzyka to funkcja wspierająca kierownika projektu. Właściciel ryzyka to osoba odpowiedzialna za zarządzanie, monitorowanie i kontrolowanie wszystkich aspektów przypisanego jej konkretnego ryzyka.\n\n\n\n"
    },
    {
        "nr": 580,
        "q": " Kto jest odpowiedzialny za opracowanie reakcji na ryzyko po jego wystąpieniu w metodyce PRINCE2?",
        "a": "\nwykonawca reakcji na ryzyko- osoba wspierająca kierownika projektu, odpowiedzialna za wykonanie działań związanych z reakcją na ryzyko\nUWAGA  kierownik projektu jest odpowiedzialny za opracowanie podejścia do zarządzania ryzykiem, a więc ma to miejsce przed wystąpieniem danego ryzyka\n"
    },
    {
        "nr": 581,
        "q": " Kto odpowiada za obserwację wydarzeń zewnętrznych mogących stanowić ryzyko dla projektu?",
        "a": "\nNadzór projektu\n"
    },
    {
        "nr": 582,
        "q": " W celu pobrania danych z dwóch lub wiecej relacji konieczne jest użycie",
        "a": "\n złączenie JOIN\n"
    },
    {
        "nr": 583,
        "q": " W celu zapewnienia integralności danych w różnych relacjach konieczne jest",
        "a": "\nIntegralność encji jest zachowana, jeśli każda tabela posiada klucz główny, a jego wartości w ramach tabeli są unikatowe i różne od wartości null\nhttps://zeszyt.jedlikowski.com/2014-11-03/sbd/integralnosc-relacyjnych-baz-danych-rodzaje-zwiazkow-relacji-pomiedzy-relacjami-tabelami-relacyjnych-baz-danych/\n"
    },
    {
        "nr": 584,
        "q": " Kategorie i związki można przedstawić na diagramie",
        "a": "\nEntity-Relationship Diagram ERD, Duda wskazał, że tutaj bardziej chodzi o ERD.\nJest jeszcze UML\n"
    },
    {
        "nr": 585,
        "q": " Fakt, że klasa A implementuje interfejs B w języku C#, oznaczany jest przez",
        "a": " \ndwukropek\nhttps://cezarywalenciuk.pl/blog/programing/post/kurs-obiektowosc-w-c-interfejsy-explicite-vs-implicit-13 \n"
    },
    {
        "nr": 586,
        "q": " Konstruktory mogą wywoływać się nawzajem poprzez konstrukcję",
        "a": " \nthis()\nbase()?\nhttps://docplayer.pl/11026549-Konstruktory-streszczenie-celem-wykladu-jest-zaprezentowanie-konstruktorow-w-javie-syntaktyki-oraz-zalet-ich-stosowania-czas-wykladu-45-minut.html \n"
    },
    {
        "nr": 587,
        "q": " Przeciążenie operatora dodawania dla klasy Ułamek w C# wymaga napisania funkcji",
        "a": " [114]\npublic static Ułamek operator+(){...}\n\tprzeciążającej (statycznej) ze słowem kluczowym operator\n"
    },
    {
        "nr": 588,
        "q": " Instrukcją pozwalającą na dostęp do danych w SQL, jest instrukcja",
        "a": "\nUSE nazwa bazy - to jest sam dostęp do bazy danych, żeby później móc wykonywać na niej zapytania, takie jak np:\n\n"
    },
    {
        "nr": 589,
        "q": " Podstawowy obiekt służący do realizacji technologii SOA to",
        "a": "\nusługa\n"
    },
    {
        "nr": 590,
        "q": " Który styl CSS będzie miał najwyższy priorytet przy ustalaniu ostatecznego wyglądu elementu HTML",
        "a": " [590]\ninline→ head => zewnętrzny => biblioteki\npriorytet od najwyższego do najniższego:\nStyl lokalny (formatowanie określonego elementu strony) tzw. styl w linii (ang. inline)\nRozciąganie stylu (znacznik <span>)\nWydzielone bloki (znacznik <div>)\nWewnętrzny arkusz stylów (w nagłówku dokumentu)\nImport stylów do wewnętrznego arkusza\nZewnętrzny arkusz stylów (w osobnym pliku z rozszerzeniem .css)\nImport stylów do zewnętrznego arkusza\nAtrybuty prezentacyjne HTML (np. align=\"...\", bgcolor=\"...\")\n\n\n"
    },
    {
        "nr": 591,
        "q": " Zespół odpowiedzialny za frontend nie będzie korzystał z języka",
        "a": " \nbędzie korzystał z: HTML, CSS, JavaScript\nTutaj pewnie będzie Java, C# (?), C, C++, SCALA, Python do zaznaczenia.\n"
    },
    {
        "nr": 592,
        "q": " Warstwa logiki biznesowej może być budowana za pomocą",
        "a": "\nTu chyba chodzi o PHP\nreguł biznesowych?\n//środowisk komponentowych wspierających budowę warstwy przetwarzania biznesowego. Obejmują trzy podstawowe technologie: CCM (CORBA Component Model), EJB (Enterprice Java Beans), oraz COM+ (Common Component Model). - z pliku z odp z 2016\nBackend (?)\n\n\n"
    },
    {
        "nr": 593,
        "q": " Który algorytm szyfrujący jest standardowo wspierany poprzez funkcję PHP",
        "a": " [593]\nhashowanie(DES-based) albo base64\nFunkchashująceje : sha1, md5, hash, crc32, crypt. \nMD5,  DES, BLOWFISH \n"
    },
    {
        "nr": 594,
        "q": " Menu w standardzie HTML5 powinno być zapisywane w znaczniku",
        "a": " [594]\n<nav>\nGadałem z Dudą to tu chodzi o znacznik semantyczny chyba i on by zaznaczył <nav>,\nZnacznik menu jest nie wspierany nigdzie. W każdym tutorialu robiącym menu, zawsze jest zapisywane w <li>.\n\n"
    },
    {
        "nr": 595,
        "q": " W jakim znaczniku włączamy informację o zewnętrznym arkuszu stylów do kodu HTML",
        "a": " [595]\nw znaczniku <link>\nnp.\n<link rel=\"stylesheet\" href=\"arkusz.css\"\na to umieszczane jest w <head>\n"
    },
    {
        "nr": 596,
        "q": " Jeśli posiadasz",
        "a": " wiedzę ekspercką, umiejętność tworzenia nowatorskich rozwiązań, motywację do osiągnięć i rozwiązywania problemów, to z pewnością: [596]\nPosiadasz cechy osoby kreatywnej\nCechuje cię autorytarny styl kierowania\nUzyskasz wysokie stanowisko kierownicze\nBędziesz niewygodny dla swojego przełożonego\n\n"
    },
    {
        "nr": 597,
        "q": " Jeśli zachowanie innych uważam za właściwe, to odwołuję się do",
        "a": "\nZasady niedostępności\nZasady potwierdzania oczekiwań\nZasady społecznego dowodu słuszności\nZasady pozytywnych skojarzeń\n?\n\n"
    },
    {
        "nr": 599,
        "q": " Postawa charakteryzująca się dystansem emocjonalnym do wykonywanych zadań, przekonaniem, iż cel uświęca środki, to",
        "a": " [599]\n\tMakiawelizm\n"
    }
]